Description: Download recipe for Prism x64.
Identifier: com.github.NickETH.recipes.download.Prism-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Prism
  URL: https://www.graphpad.com/updates
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: URLTextSearcher
  Arguments:
    #https://cdn.graphpad.com/downloads/prism/10/InstallPrism10.msi
    #re_pattern: (https://www.python.org/.*python-(?P<version>%MAIN_VER%\.[0-9]+)-amd64\.exe?)
    re_pattern: (https://cdn.graphpad.com/downloads/prism/[0-9]+/InstallPrism[0-9]+.msi)
    url: '%URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-x64.msi'
    url: '%match%'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN="GraphPad Software, LLC", O="GraphPad Software, LLC", L=San Diego, S=California, C=US, SERIALNUMBER=7198672, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Delaware, OID.1.3.6.1.4.1.311.60.2.1.3=US
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase