Description: Alters latest SEH UTN Manager for Windows.
Identifier: com.github.NickETH.recipes.build.UTN_Manager-Win
ParentRecipe: com.github.NickETH.recipes.download.UTN_Manager-Win
MinimumVersion: 1.3.1

Input:
  NAME: UTN_Manager
  SEARCH_URL: https://www.seh-technology.com/de/service/downloads/download-dongleserver/dongleserver-pro.html
  VERSION_URL: (/fileadmin/user/downloads/deviceserver/tools/sehutnmanager-win-(?P<version>([0-9]+\.)*[0-9]+)\.zip)
  PLATFORM: x86
  PF_STRING: ''

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to store the package
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read
    org_ver: '%version%'
    pkg_dir: '%NAME%_%version%_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%_ML'
    rename_var: pkg_dir

- Processor: Copier
  Comment: Copy the UTN_Manager zip file to the sourcepkt dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%%PF_STRING%_%build_ver%_ML.zip'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%%PF_STRING%_%build_ver%_ML.zip'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\'
    extract_file: sehutnmanager-win-*.exe
    preserve_paths: 'false'
    recursive: 'true'

- Processor: FileFinder
  Arguments:
    pattern: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\sehutnmanager-win-*.exe'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: 'E=cert@seh.de, CN=S E H Computertechnik GmbH, O=S E H Computertechnik GmbH, STREET=Suedring 11, L=Bielefeld, S=Nordrhein-Westfalen, C=DE, OID.1.3.6.1.4.1.311.60.2.1.1=Bielefeld, OID.1.3.6.1.4.1.311.60.2.1.2=Nordrhein-Westfalen, OID.1.3.6.1.4.1.311.60.2.1.3=DE, SERIALNUMBER=HRB 33464, OID.2.5.4.15=Private Organization'
    input_path: '%found_filename%'

- Processor: Copier
  Comment: Copy the UTN_Manager install exe file to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.exe'
    overwrite: 'true'
    source_path: '%found_filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'
