Description: Downloads latest SEH UTN Manager Installer for Windows.
Identifier: com.github.NickETH.recipes.download.UTN_Manager-Win
MinimumVersion: 1.3.1

Input:
  NAME: UTN_Manager
  SEARCH_URL: https://www.seh-technology.com/de/service/downloads/download-dongleserver/dongleserver-pro.html
  VERSION_URL: (/fileadmin/user/downloads/deviceserver/tools/sehutnmanager-win-(?P<version>([0-9]+\.)*[0-9]+)\.zip)

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%VERSION_URL%'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.zip'
    url: https://www.seh-technology.com%match%

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
