Description: Imports Keepass release to BMS
Identifier: com.github.NickETH.recipes.BMS.Keepass-Win
ParentRecipe: com.github.NickETH.recipes.build.Keepass-Win
MinimumVersion: 1.3.1

Input:
  NAME: KeePass
  VENDOR: 'Dominik Reichl'
  PLATFORM: x86
  PF_STRING: ''
  LANG_STRING: _ML
  DIPNAME: Keepass
  DIP_SUBDIR: ML

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\Keepass_%build_ver%%LANG_STRING%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'

- Processor: com.github.homebysix-recipes.FindAndReplace/FindAndReplace
  Arguments:
    input_string: '%build_ver%'
    find: .
    replace: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%DIPNAME%\%output_string%\%DIP_SUBDIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1
    bms_app_integration:
    - appname: '%NAME%'
      bundles:
      - action: exchange
        name: 'nV_%NAME%'
      - action: add
        name: 'aV_%NAME% Uninstall'
        version: new
      - action: add
        name: 'oV_%NAME% Uninstall'
        version: previous
      currentversion:
        bundle: 'nV_%NAME%'
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML'
        type: bundles
      platform: ''
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
      copyfolders: 1
    bms_app_sharepoint:
    - SW-List-Name: '%NAME%'
      versionplatformtag: '%build_ver% ML'
    bms_job_kiosk:
    - jobname: '%NAME%'
      substring: 'Update'
      jobdescription: 'KeePass Password Safe ist ein beliebtes, freies Programm zur Kennwortverwaltung.'
      autoenableapp: '%NAME% - Enable AutoUpdate'
      autoreleasejob: '@_AU-Rel_%NAME%'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn
    bms_app_valid4os: '%BMS_OS4X86%,%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\Keepass_%build_ver%%LANG_STRING%\release\*.ms?|%BMS_IMPORT_PATH_TST%\%DIPNAME%\%output_string%\%DIP_SUBDIR%'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIPNAME%\bms_app_integration.json'
    icon_file_src: '%BUILD_DIR%\Keepass_%build_ver%%LANG_STRING%\icons\*.*'
    read_file_src_dest: '%BUILD_DIR%\Keepass_%build_ver%%LANG_STRING%\read\*-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt|%BMS_IMPORT_PATH_TST%\%DIPNAME%\%output_string%\DEV'

- Processor: EndOfCheckPhase
