Description: Download recipe for Dell Command Update.
Identifier: com.github.NickETH.recipes.download.CommandUpdate-Win64
MinimumVersion: 1.3.1

Input:
  NAME: 'Command Update'
  NAMESHORT: Command_Update
  VENDOR: DELL
  DOWNLOAD_URL: https://nxlog.co/products/nxlog-community-edition/download
  SEARCH_FIRSTURL: https://www.dell.com/support/kbdoc/en-us/000177325/dell-command-update?lwp=rt
  SEARCH_VER: '^(Dell.*?(?P<version>([0-9]+.)*[0-9]+).*?.exe)$'
  #SEARCH_VER: '(Dell.*?\.exe)'

  PLATFORM: x64
  PF_STRING: _64

  INTERNAL_URL: 'put your path here'


# The online search on Dell's website was abondoned, because of complexity and constant changing.
# 
Process:
# - Processor: URLTextSearcher
  # Arguments:
    # re_pattern: '%SEARCH_VER%'
    # re_flags:
    # - DOTALL
    # url: '%SEARCH_FIRSTURL%'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: get the filename from internal source
  Arguments:
    cmdline_args:
    - /C
    - dir
    - /b
    - '%INTERNAL_URL%'
    - '>'
    - DELL_CU_win.txt
    exe_file: 'cmd.exe'
    exe_folder: '%RECIPE_CACHE_DIR%'

- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_VER%'
    re_flags:
     - IGNORECASE
    url: file://%RECIPE_CACHE_DIR%/DELL_CU_win.txt

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: create a version.txt file, if it does not exist
  Arguments:
    cmdline_args:
    - /C
    - type
    - nul
    - '>>'
    - version.txt
    exe_file: 'cmd.exe'
    exe_folder: '%RECIPE_CACHE_DIR%'

- Processor: URLTextSearcher
  Arguments:
    re_pattern: '^(.*)$'
    url: file://D:/AutoPkg/Cache/com.github.NickETH.recipes.download.CommandUpdate-Win64/DELL_CU_win.txt
    NEW_FILENAME: '%match%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%version% == %match%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAMESHORT%_%PLATFORM%.exe'
    url: 'file:////d/sys/bms_tst/AutoPkg-in/Input/Dell_Command_Update/%NEW_FILENAME%'
    CHECK_FILESIZE_ONLY: True

- Processor: FileCreator
  Comment: Generate the version.txt in the release dir.
  Arguments:
    file_content: '%version%'
    file_path: '%RECIPE_CACHE_DIR%\version.txt'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False
