Description: Download recipe for Dell Command Update.
Identifier: com.github.NickETH.recipes.download.CommandUpdate-Win64
MinimumVersion: 1.3.1

Input:
  NAME: 'Command Update'
  NAMESHORT: Command_Update
  SEARCH_FIRSTURL: https://www.dell.com/support/kbdoc/en-us/000177325/dell-command-update?lwp=rt
  SEARCH_SECONDURL: href="(https://www.dell.com/support/home/en-us/drivers/DriversDetails.driverId=[0-9A-Z]*)" target=._blank..Dell Command
  SEARCH_THIRDURL: (https://dl.dell.com/[0-9A-Z]*/[0-9]/Dell-Command-Update-Windows-Universal-Application_[0-9A-Z]*_WIN_(?P<version>([0-9]+\.)*[0-9]+)_A[0-9_]*.EXE)
  USER_AGENT: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:81.0) Gecko/20100101 Firefox/81.0

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/Selenium
  Arguments:
    browser_binary_path: 'C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe'
    browser_used: Edge
    primary_url: '%SEARCH_FIRSTURL%'
    re_pattern: '%SEARCH_SECONDURL%'
    selenium_commands:
    - browser.get("%SEARCH_FIRSTURL%")
    selenium_options:
    - self.options.add_argument("--headless=new") # See: https://github.com/SeleniumHQ/selenium/issues/11634
    - self.options.add_argument("--disable-infobars")
    #- self.options.add_argument("--disable-extensions")
    #- self.options.add_argument("--remote-allow-origins=*")
    - |
        self.options.add_experimental_option("prefs", {
            "download.default_directory": '%RECIPE_CACHE_DIR%\\downloads',
            "download.prompt_for_download": False,
            "download.directory_upgrade": True,
            "safebrowsing.enabled": True
          })
    webdriver_binary_path: '%TOOLS_DIR%\msedgedriver.exe'

- Processor: com.github.NickETH.recipes.SharedProcessors/Selenium
  Arguments:
    browser_binary_path: 'C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe'
    browser_used: Edge
    primary_url: '%match%'
    re_pattern: '%SEARCH_THIRDURL%'
    selenium_commands:
    - '%match%'
    selenium_options:
    - self.options.add_argument("--headless=new")
    - self.options.add_argument("--disable-infobars")
    - |
        self.options.add_experimental_option("prefs", {
            "download.default_directory": "%RECIPE_CACHE_DIR%\\downloads",
            "download.prompt_for_download": False,
            "download.directory_upgrade": True,
            "safebrowsing.enabled": True
          })
    webdriver_binary_path: '%TOOLS_DIR%\msedgedriver.exe'

- Processor: URLDownloader
  Arguments:
    filename: 'dummy.txt'
    url: 'file://%AUTOPKG_DIR%\\dummy.txt'

- Processor: com.github.jazzace.processors/TextSearcher
  Arguments:
    download_changed: False
    url_downloader_summary_result: ''
    source_path: ''
    # https://dl.dell.com/FOLDER09268356M/1/Dell-Command-Update-Windows-Universal-Application_CJ0G9_WIN_4.7.1_A00.EXE
    # https://dl.dell.com/FOLDER10012409M/3/Dell-Command-Update-Windows-Universal-Application_J6PNP_WIN_4.9.0_A02_02.EXE
    re_pattern: (Dell-Command-Update-Windows-Universal-Application_[0-9A-Z]*_WIN_(?P<version>([0-9]+\.)*[0-9]+)_[0-9A-Z_]*.EXE)
    text_in: '%match%'
    result_output_var_name: downloaded_package

- Processor: Copier
  Comment: Generate an initial version.txt file for the first run.
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%\version.txt'
    overwrite: False
    source_path: '%AUTOPKG_DIR%\\dummy.txt'

- Processor: Copier
  Comment: Generate an initial download file for the first run.
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%\downloads\%NAMESHORT%.exe'
    overwrite: False
    source_path: '%RECIPE_CACHE_DIR%\downloads\dummy.txt'
   
- Processor: com.github.NickETH.recipes.SharedProcessors/TextFileSearcher
  Arguments:
    re_pattern: '[0-9A-Z.]*'
    result_output_var_name: previous_version
    file_to_open: '%RECIPE_CACHE_DIR%\version.txt'

- Processor: StopProcessingIf
  Arguments:
    predicate: previous_version == version

- Processor: FileCreator
  Comment: Generate the version.txt file in the cache dir.
  Arguments:
    file_content: |
      %version%
    file_path: '%RECIPE_CACHE_DIR%\version.txt'

- Processor: com.github.NickETH.recipes.SharedProcessors/Selenium
  Arguments:
    browser_binary_path: 'C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe'
    browser_used: Edge
    primary_url: '%match%'
    re_pattern: .*
    selenium_commands:
    - '%match%'
    selenium_options:
    - self.options.add_argument("--headless=new")
    - self.options.add_argument("--disable-infobars")
    - |
        self.options.add_experimental_option("prefs", {
            "download.default_directory": "%RECIPE_CACHE_DIR%\\downloads",
            "download.prompt_for_download": False,
            "download.directory_upgrade": True,
            "safebrowsing.enabled": True
          })
    webdriver_binary_path: '%TOOLS_DIR%\msedgedriver.exe'


- Processor: PathDeleter
  Comment: Delete the old installer file.
  Arguments:
    path_list: '%RECIPE_CACHE_DIR%\downloads\%NAMESHORT%.exe'

- Processor: FileMover
  Comment: Rename the downloaded file to the standard name.
  Arguments:
    source: '%RECIPE_CACHE_DIR%\downloads\%downloaded_package%'
    target: '%RECIPE_CACHE_DIR%\downloads\%NAMESHORT%.exe'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Dell Inc, OU=DUP Client Creation Service, O=Dell Inc, L=Round Rock, S=Texas, C=US
    input_path: '%RECIPE_CACHE_DIR%\downloads\%NAMESHORT%.exe'

- Processor: EndOfCheckPhase
