Description: Alters latest Putty MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.PuTTY-Win64
ParentRecipe: com.github.NickETH.recipes.download.PuTTY-Win64
MinimumVersion: 1.3.1

Input:
  NAME: PuTTY
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create the build environment
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: release:read:sourceunzipped:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_EN'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '2'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%_EN'
    rename_var: pkg_dir

- Processor: Copier
  Comment: Save a copy of the downloaded MSI to the release dir.
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_EN.msi'
    overwrite: 'true'
    source_path: '%pathname%'

# - Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  # Comment: Extract the InstantClient odbc zip archive
  # Arguments:
    # exe_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_EN.msi'
    # extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\'
    # extract_file: 'putty.cab'
    # ignore_pattern: ''
    # preserve_paths: 'False'

# - Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  # Comment: Extract the InstantClient odbc zip archive
  # Arguments:
    # exe_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\putty.cab'
    # extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\'
    # extract_file: 'PuTTY_File'
    # ignore_pattern: ''
    # preserve_paths: 'False'
    
- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\helpers\PuTTY_256.ico'
    # msi_icon_name: 'installericon.exe'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_EN.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_EN.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: EndOfCheckPhase
