Description: Downloads the latest PuTTY x64.
Identifier: com.github.NickETH.recipes.download.PuTTY-Win64
MinimumVersion: 1.3.1

Input:
  NAME: PuTTY
  SEARCH_URL: https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html
  SEARCH_PATTERN: (https.*\/putty-64bit-(?P<version>([0-9]+\.)*[0-9]+)-installer.msi)
  USER_AGENT: Mozilla/5.0 (Windows NT 6.3; Win64, x64; Trident/7.0; rv:11.0) like Gecko

Process:
- Processor: URLTextSearcher
  Comment: Get a link to a redirect page from the official download page
  Arguments:
    re_pattern: '%SEARCH_PATTERN%'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.msi'
    request_headers:
      user-agent: '%USER_AGENT%'
    url: '%match%'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Simon Tatham, O=Simon Tatham, S=Cambridgeshire, C=GB
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
