Description: Imports PuTTY to BMS
Identifier: com.github.NickETH.recipes.BMS.Putty-Win64
ParentRecipe: com.github.NickETH.recipes.build.PuTTY-Win64
MinimumVersion: 1.3.1

Input:
  NAME: PuTTY
  VENDOR: Simon Tatham
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _EN

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_EN.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%NAME%\%parsed_string%\EN\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1 TRANSFORMS="noDTSC.mst"
    bms_app_integration:
    - appname: '%NAME%'
      currentversion:
        job: '@_nV_%NAME% - Update (%PLATFORM%) (DYN)'
        search: '[d]+\.[d]+\.[d]+ EN (%PLATFORM%)'
        type: job
      jobs:
      - action: add
        name: '@_nV_%NAME% - Update (%PLATFORM%) (DYN)'
        version: new
      - action: changetype
        name: '@_nV_%NAME% - Update (%PLATFORM%) (DYN)'
        version: previous
      - action: add
        name: '@_iAuK_PuTTY'
        version: new
      - action: changetype
        name: '@_iAuK_PuTTY'
        version: previous
      - action: add
        name: '@_AU-Rel_PuTTY'
        version: new
      - action: changetype
        name: '@_AU-Rel_PuTTY'
        version: previous
      - action: add
        name: '@_uAuK_PuTTY - Uninstall'
        version: new
      - action: changetype
        name: '@_uAuK_PuTTY - Uninstall'
        version: new
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% EN'
      copyfolders: 1
    bms_app_sharepoint:
    - SW-List-Name: '%NAME%'
      versionplatformtag: '%build_ver% EN (%PLATFORM%)'
    bms_job_kiosk:
    - jobname: '%NAME%'
      substring: 'Taskkill'
      jobdescription: 'PuTTY ist eine freie Software für Verbindungen über Secure Shell (SSH), Telnet, Remote login oder serielle Schnittstellen.'
      autoenableapp: 'PuTTY - Enable AutoUpdate'
      autoreleasejob: '@_AU-Rel_PuTTY'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn /norestart
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% EN (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.*|%BMS_IMPORT_PATH_TST%\%NAME%\%parsed_string%\EN'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%NAME%\bms_app_integration.json'
    icon_file_src: '%BUILD_DIR%\%pkg_dir%\icons\*.*'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt|%BMS_IMPORT_PATH_TST%\%NAME%\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
