Description: Downloads latest Oxygen Web Author.
Identifier: com.github.NickETH.recipes.download.Oxygen-Editor-Win64
MinimumVersion: 1.3.1


Input:
  NAME: OxygenEditor
  VENDOR: Jabref.org
  PLATFORM: x64
  PF_STRING: '_64'
  LANG_STRING: _ML

Process:
# - Processor: GitHubReleasesInfoProvider
  # Arguments:
    # asset_regex: JabRef-[\S]+\.msi
    # github_repo: JabRef/jabref

# - Processor: URLDownloader
  # Arguments:
    # filename: '%NAME%.msi'
    # url: '%url%'

- Processor: OxygenURLProvider
  Arguments:
    platform_name: Windows64
    product_name: Editor

- Processor: URLDownloader
  Arguments:
    url: '%url%'
    
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
