Description: Download recipe for Fiji, which downloads a zip file containing the latest stable version of Fiji without JRE in it. Fiji is an image processing package and can be described as a distribution of ImageJ (and ImageJ2) together with Java, Java3D and a lot of plugins organized into a coherent menu structure.
Identifier: com.github.NickETH.recipes.download.Fiji-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Fiji
  DOWNLOAD_URL: https://downloads.imagej.net/fiji/latest/fiji-win64.zip

Process:
- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: true
    filename: '%NAME%.zip'
    url: '%DOWNLOAD_URL%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: URLTextSearcher
  Arguments:
    re_pattern: release>(.*)<\/release
    result_output_var_name: version
    url: https://maven.scijava.org/content/groups/public/sc/fiji/fiji/maven-metadata.xml

# - Processor: com.github.autopkg-win.SharedProcessors/SevenZipExtractor
  # Arguments:
    # exe_path: '%pathname%'
    # extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    # extract_file: ij-1.*.jar
    # preserve_paths: 'False'
    # recursive: 'True'

# - Processor: FileFinder
  # Arguments:
    # pattern: '%RECIPE_CACHE_DIR%\downloads\ij-1.*.jar'

# - Processor: com.github.autopkg-win.SharedProcessors/SevenZipExtractor
  # Arguments:
    # exe_path: '%found_filename%'
    # extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    # extract_file: MANIFEST.MF
    # preserve_paths: 'False'
    # recursive: 'True'

# - Processor: com.github.autopkg-win.SharedProcessors/TextFileSearcher
  # Comment: Searches the version string and put it into variables
  # Arguments:
    # file_to_open: '%RECIPE_CACHE_DIR%\downloads\MANIFEST.MF'
    # re_pattern: 'Implementation-Version: (?P<version>(?P<versionmajor>\d).(?P<versionminor>[\d]*)(?P<buildstring>.*))'

# - Processor: com.github.autopkg-win.SharedProcessors/CharToNum
  # Arguments:
    # input_var: '%buildstring%'
    # output_var: versionbuild

# - Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  # Arguments:
    # input_var: '%versionmajor%.%versionminor%.%versionbuild%'
    # rename_var: version_intern

# - Processor: PathDeleter
  # Comment: Delete the expanded files and folders in the cache
  # Arguments:
    # path_list:
    # - '%found_filename%'
    # - '%RECIPE_CACHE_DIR%\downloads\MANIFEST.MF'

- Processor: EndOfCheckPhase
