Description: Download recipe for Fiji, which downloads a zip file containing the latest stable version of Fiji without JRE in it. Fiji is an image processing package and can be described as a distribution of ImageJ (and ImageJ2) together with Java, Java3D and a lot of plugins organized into a coherent menu structure.
Identifier: com.github.NickETH.recipes.download.Fiji-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Fiji
  # DOWNLOAD_URL: https://downloads.imagej.net/fiji/latest/fiji-win64.zip
  DOWNLOAD_URL: https://downloads.imagej.net/fiji/latest/fiji-latest-win64-jdk.zip
  # We now use a new version string with a build tag, which reflects year and month of the build.
  # This was introduced, because there where often several different releases with the same version in the past.

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: release>(.*)<\/release
    result_output_var_name: basever
    url: https://maven.scijava.org/content/groups/public/sc/fiji/fiji/maven-metadata.xml

- Processor: URLTextSearcher
  Arguments:
    re_pattern: '<lastUpdated>[\d]{2}([\d]{4})[\d]*?</lastUpdated>'
    result_output_var_name: buildver
    url: https://maven.scijava.org/content/groups/public/sc/fiji/fiji/maven-metadata.xml

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: create a version.txt file, if it does not exist (like 'touch').
  Arguments:
    cmdline_args:
    - /C
    - type
    - nul
    - '>>'
    - version.txt
    exe_file: 'cmd.exe'
    exe_folder: '%RECIPE_CACHE_DIR%'

- Processor: URLTextSearcher
  Comment: read back the previous version from the version.txt file.
  Arguments:
    version: '%basever%.%buildver%'
    re_pattern: '^(.*)$'
    result_output_var_name: versionprev
    url: file://%RECIPE_CACHE_DIR%/version.txt

- Processor: StopProcessingIf
  Arguments:
    predicate: '%version% == %versionprev%'

- Processor: FileCreator
  Comment: Generate the version.txt in the release dir.
  Arguments:
    file_content: '%version%'
    file_path: '%RECIPE_CACHE_DIR%\version.txt'

- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: true
    filename: '%NAME%.zip'
    #filename: '%NAME%.txt'
    url: '%DOWNLOAD_URL%'
    #url: https://maven.scijava.org/content/groups/public/sc/fiji/fiji/maven-metadata.xml

# - Processor: com.github.autopkg-win.SharedProcessors/SevenZipExtractor
  # Arguments:
    # exe_path: '%pathname%'
    # extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    # extract_file: ij-1.*.jar
    # preserve_paths: 'False'
    # recursive: 'True'

# - Processor: FileFinder
  # Arguments:
    # pattern: '%RECIPE_CACHE_DIR%\downloads\ij-1.*.jar'

# - Processor: com.github.autopkg-win.SharedProcessors/SevenZipExtractor
  # Arguments:
    # exe_path: '%found_filename%'
    # extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    # extract_file: MANIFEST.MF
    # preserve_paths: 'False'
    # recursive: 'True'

# - Processor: com.github.autopkg-win.SharedProcessors/TextFileSearcher
  # Comment: Searches the version string and put it into variables
  # Arguments:
    # file_to_open: '%RECIPE_CACHE_DIR%\downloads\MANIFEST.MF'
    # re_pattern: 'Implementation-Version: (?P<version>(?P<versionmajor>\d).(?P<versionminor>[\d]*)(?P<buildstring>.*))'

# - Processor: com.github.autopkg-win.SharedProcessors/CharToNum
  # Arguments:
    # input_var: '%buildstring%'
    # output_var: versionbuild

# - Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  # Arguments:
    # input_var: '%versionmajor%.%versionminor%.%versionbuild%'
    # rename_var: version_intern

# - Processor: PathDeleter
  # Comment: Delete the expanded files and folders in the cache
  # Arguments:
    # path_list:
    # - '%found_filename%'
    # - '%RECIPE_CACHE_DIR%\downloads\MANIFEST.MF'

- Processor: EndOfCheckPhase
