Description: Package the current Fiji release to an MSI-package. It uses the latest stable version of Fiji with JRE in it. Fiji is an image processing package and can be described as a distribution of ImageJ (and ImageJ2) together with a lot of plugins organized into a coherent menu structure.
Identifier: com.github.NickETH.recipes.build.Fiji-Win64
ParentRecipe: com.github.NickETH.recipes.download.Fiji-Win64
MinimumVersion: 1.3.1


Input:
  NAME: Fiji
  VENDOR: 'ImageJ.net'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _EN

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to build the MSI with Wix
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers:wixproject
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_%version%%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: Copier
  Comment: Copy the Fiji zip file to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\downloads\%filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the autopkg zip archive
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\wixproject'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: FileMover
  Comment: Rename the Fiji folder to Fiji.app
  Arguments:
    overwrite: 'true'
    source: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%'
    target: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%.app'

# - Processor: PathDeleter
  # Comment: Delete the expanded files and folders in the cache
  # Arguments:
    # path_list:
    # - '%BUILD_DIR%\%pkg_dir%\wixproject\Fiji.app\java'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/WixDefaults
  Comment: Set the actual version strings to the version.wxi file
  Arguments:
    build_dir: '%BUILD_DIR%\%pkg_dir%'
    # build_ver: '%version_intern%'
    # org_ver: '%version_intern%'
    build_ver: '%version%'
    org_ver: '%version%'
  
- Processor: com.github.NickETH.recipes.SharedProcessors/MSBuildRun
  Comment: Run the MSBuild script to generate the Fiji MSI installer
  Arguments:
    build_file: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%.build'
    build_folder: '%BUILD_DIR%\%pkg_dir%\wixproject'
    build_property: BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;FijiDir=%BUILD_DIR%\%pkg_dir%\wixproject\Fiji.app;version=%version%
    # build_property: BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;FijiDir=%BUILD_DIR%\%pkg_dir%\wixproject\Fiji;version=%version%
    build_target: WIX
