Description: Download recipe for the JupyterLab-Desktop.
Identifier: com.github.NickETH.recipes.download.JupyterLab-Desktop-Win64
MinimumVersion: 1.3.1

Input:
  NAME: 'JupyterLab-Desktop'
  VENDOR: JupyterLab
  PLATFORM: x64
  PF_STRING: _64
  USER_AGENT: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:81.0) Gecko/20100101 Firefox/81.0

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    # https://github.com/jupyterlab/jupyterlab-desktop/releases/download/v3.1.18-1/JupyterLab-Setup-Windows.exe
    # asset_regex: arduino-ide_(?P<finalversion>([0-9]+\.)*[0-9]+)_Windows_64bit\.msi
    asset_regex: JupyterLab-Setup-Windows-x64\.exe
    github_repo: jupyterlab/jupyterlab-desktop
    include_prereleases: false

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%version%'
    pattern_replace:
    - pattern: '-'
      repl: '.'

- Processor: URLDownloader
  Arguments:
    version: '%parsed_string%'
    filename: '%NAME%.exe'
    request_headers:
      user-agent: '%USER_AGENT%'
    url: '%url%'

# - Processor: WindowsSignatureVerifier
  # Arguments:
    # expected_subject: CN=Arduino SA, O=Arduino SA, S=Ticino, C=CH
    # input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
