Description: Alters latest SafeExamBrowser MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.SafeExamBrowser-Win64
ParentRecipe: com.github.NickETH.recipes.download.SafeExamBrowser-Win
MinimumVersion: 1.3.1

Input:
  NAME: SafeExamBrowser
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create the build environment
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%%LANG_STRING%'
    rename_var: pkg_dir

- Processor: Copier
  Comment: Copy the SEB installer files to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%pathname%'

# - Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  # Comment: Extract the SafeExamBrowser setup exe
  # Arguments:
    # archive_type: '#'
    # exe_path: '%pathname%'
    # extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'
    # extract_file: 4.cab
    # ignore_pattern: ''
    # preserve_paths: 'False'

# - Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  # Comment: Extract the SafeExamBrowser setup exe
  # Arguments:
    # archive_type: '*'
    # exe_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\4.cab'
    # extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'
    # extract_file: a0
    # ignore_pattern: ''
    # preserve_paths: 'False'

# - Processor: FileMover
  # Comment: Move the SafeExamBrowser x64 MSI file to the release dir
  # Arguments:
    # overwrite: 'true'
    # source: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\a0'
    # target: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Applies the Settings-Transform to the SafeExamBrowser.msi to the release folder
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    mst_paths: '%BUILD_DIR%\%pkg_dir%\helpers\SEB_Uninst-log-Rem-Chng-Add-SC.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: EndOfCheckPhase
