Description: Downloads latest SafeExamBrowser MSI-file for Windows.
Identifier: com.github.NickETH.recipes.download.SafeExamBrowser-Win
MinimumVersion: 1.3.1

Input:
  NAME: SafeExamBrowser
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    # https://github.com/SafeExamBrowser/seb-win-refactoring/releases/download/v3.7.1/SEB_3.7.1.704_x64_Setup.msi
    # asset_regex: SEB_[0-9\.]+_SetupBundle\.exe
    asset_regex: SEB_[0-9\.]+_%PLATFORM%_Setup\.msi
    github_repo: SafeExamBrowser/seb-win-refactoring

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%PLATFORM%.msi'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: "CN=ETH Zürich, O=ETH Zürich, L=Zürich, C=CH"
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
