Description: Downloads the latest version of VLC for Windows.
Identifier: com.github.NickETH.recipes.download.VLC-Win
MinimumVersion: 1.3.1

Input:
  SEARCH_PATTERN: (get\.videolan\.org\/vlc\/(?P<version>[0-9.]+)\/win64\/vlc-[0-9.]+-win64\.%PKGFORMAT%)
  SEARCH_URL: https://www.videolan.org/vlc/download-windows.html
  MIRRORSRV: https://mirror.solnet.ch/videolan
  PKGFORMAT: msi
  # PKGFORMAT: exe
  # PKGFORMAT: zip
  VLCPLATFORM: win64
  # VLCPLATFORM: win32

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_PATTERN%'
    url: '%SEARCH_URL%'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: create a version.txt file, if it does not exist
  Arguments:
    cmdline_args:
    - /C
    - type
    - nul
    - '>>'
    - version.txt
    exe_file: 'cmd.exe'
    exe_folder: '%RECIPE_CACHE_DIR%'

- Processor: URLTextSearcher
  Arguments:
    re_pattern: '^(.*)$'
    url: file://%RECIPE_CACHE_DIR%/version.txt
    # NEW_FILENAME: '%match%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%version% == %match%'

- Processor: FileCreator
  Comment: Generate the version.txt in the release dir.
  Arguments:
    file_content: '%version%'
    file_path: '%RECIPE_CACHE_DIR%\version.txt'

- Processor: URLDownloader
  Arguments:
    filename: vlc-%VLCPLATFORM%.%PKGFORMAT%
    url: https://download.videolan.org/vlc/%version%/%VLCPLATFORM%/vlc-%version%-%VLCPLATFORM%.%PKGFORMAT%

- Processor: EndOfCheckPhase
