Description: Downloads the latest version of VLC for Windows.
Identifier: com.github.NickETH.recipes.download.VLC-Win
MinimumVersion: 1.3.1

Input:
  SEARCH_PATTERN: (get\.videolan\.org\/vlc\/(?P<version>[0-9.]+)\/win64\/vlc-[0-9.]+-win64\.%PKGFORMAT%)
  SEARCH_URL: https://www.videolan.org/vlc/download-windows.html
  MIRRORSRV: https://mirror.solnet.ch/videolan
  PKGFORMAT: msi
  # PKGFORMAT: exe
  # PKGFORMAT: zip
  VLCPLATFORM: win64
  # VLCPLATFORM: win32

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_PATTERN%'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    filename: vlc-%VLCPLATFORM%.%PKGFORMAT%
    url: https://download.videolan.org/vlc/%version%/%VLCPLATFORM%/vlc-%version%-%VLCPLATFORM%.%PKGFORMAT%

- Processor: EndOfCheckPhase
