Description: Imports latest Videolan Client x64 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.BMS.VLC-Win64
ParentRecipe: com.github.NickETH.recipes.build.VLC-Win64
MinimumVersion: 1.3.1

Input:
  NAME: VLC
  VENDOR: VideoLAN
  VLCPLATFORM: win64
  PLATFORM: x64
  PF_STRING: _64
  SEARCH_PATTERN: get\.videolan\.org\/vlc\/(?P<version>[0-9.]+)\/win64\/vlc-[0-9.]+-win64\.exe

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Comment: Get the ProductCode into the  msi_value variable for the BMS uninstall string
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Comment: Exchange "." for "_" on build_ver variable for BMS-DIP-path
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS) QSS
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,2,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\VLC_MediaPlayer\%parsed_string%\ML\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1
    bms_app_integration:
    - appname: VLC media player
      bundles:
      - action: exchange
        name: nV_VLC media player
      - action: add
        name: aV_VLC media player Uninstall
        version: new
      - action: add
        name: oV_VLC media player Uninstall
        version: previous
      currentversion:
        bundle: nV_VLC media player
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (x64)'
        type: bundles
      platform: (x64)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: VLC media player
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%version% ML (x64)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi|%BMS_IMPORT_PATH_TST%\VLC_MediaPlayer\%parsed_string%\ML'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-VLC*.txt|%BMS_IMPORT_PATH_TST%\VLC_MediaPlayer\%parsed_string%\DEV'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\VLC_MediaPlayer\bms_app_integration.json'

- Processor: EndOfCheckPhase
