Description: Alters latest Videolan Client x64 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.VLC-Win64
ParentRecipe: com.github.NickETH.recipes.download.VLC-Win
MinimumVersion: 1.3.1

Input:
  NAME: VLC
  VLCPLATFORM: win64
  PLATFORM: x64
  PF_STRING: _64
  SEARCH_PATTERN: (get\.videolan\.org\/vlc\/(?P<version>[0-9.]+)\/win64\/vlc-[0-9.]+-win64\.msi)

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    create_AS_ver: 'True'
    folder_list: adm:sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%_ML'
    rename_var: pkg_dir

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\vlc-%version%-%PLATFORM%.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIofflinePatcher
  Arguments:
    adm_msi_path: adm\vlc-%version%-%PLATFORM%.msi
    cab_dir: adm
    cab_file: product
    compact_msi: 'True'
    embed_cab: 'True'
    msi_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\vlc-%version%-%PLATFORM%.msi'
    new_msi_path: adm\%NAME%%PF_STRING%_%build_ver%_ML.msi
    new_packcode: 'False'
    pkg_dir_abs: '%BUILD_DIR%\%pkg_dir%'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\adm\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIDbWorker
  Comment: Merges the WixFirewallCA-merge.msi with the main MSI-file
  Arguments:
    mode: -m
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    workfile: '%BUILD_DIR%\%pkg_dir%\helpers\WixFirewallCA-merge.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Applies the Settings-Transform to the VLC.msi in the release folder
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    mst_paths: '%BUILD_DIR%\%pkg_dir%\helpers\VLC64-ETHZ-cfg.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Arguments:
    SQL_command:
    - UPDATE `Property` SET `Property`.`Value`='%version%' WHERE `Property`.`Property`='ProductVersion'
    - UPDATE `Property` SET `Property`.`Value`='VLC media player %version% (64-bit)' WHERE `Property`.`Property`='ProductName'
    - UPDATE `Registry` SET `Registry`.`Value`='%AS_ver%' WHERE `Registry`.`Registry`='regHKLM11'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: Videolan Client %PLATFORM% %version% ML
      /o: Slightely altered (AutoUpdate disabled). %us_date% by AutoPkg
      /t: Videolan Client %PLATFORM% %version% ML
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: EndOfCheckPhase
