Description: Alters latest DWG Trueview x64 for Windows.
Identifier: com.github.NickETH.recipes.build.DWGTrueview-Win64
ParentRecipe: com.github.NickETH.recipes.download.DWGTrueview-Win64
MinimumVersion: 1.3.1

Input:
  NAME: DWGTrueview
  NAMESHORT: 'Trueview'
  VENDOR: 'Autodesk'
  PF_STRING: _64
  LANG_STRING: _ML
  PLATFORM: x64
  DIP_NAME: DWGViewer
  MAJORREL: '2025'
  DOWNLOAD_URL: 'https://upload1.delivery.autodesk.com/PORTAL_DownloadPackage146620325107674.exe?response-content-disposition=attachment;filename="Create_Installer_PLC0000037_%MAJORREL%_English_WIN64.exe"'
  SEARCH_STR: '(https://efulfillment.autodesk.com/NetSWDLD/.+?/(?P<UPI2>[0-9a-fA-F\-]{36})/.+?sfx.exe)'
  #SEARCH_STR: https://efulfillment.autodesk.com/NetSWDLD

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    extract_file: collection.xml

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    extract_file: app.dwgviewr.en-US.xml
    recursive: true
    preserve_paths: false

- Processor: URLTextSearcher
  Arguments:
    re_pattern: '<BuildNumber>(?P<version>([0-9]+[\.|_])*[0-9]*)</BuildNumber>'
    url: file://%RECIPE_CACHE_DIR%\downloads\app.dwgviewr.en-US.xml

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: release:read
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%%LANG_STRING%'
    rename_var: pkg_dir

- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_STR%'
    url: file://%RECIPE_CACHE_DIR%\downloads\collection.xml

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%2.exe'
    url: '%match%'

- Processor: Copier
  Arguments:
    overwrite: 'true'
    source_path: '%pathname%'
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.exe'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    extract_file: 'DWGTrueView*.7z'
 
- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%\downloads\DWGTrueView*.7z'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    extract_file: 'DWGTrueView*.7z'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%found_filename%'
    extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    extract_file: dwgviewr.ico
    recursive: true
    preserve_paths: false

- Processor: com.github.haircut.processors/AppIconExtractor
  Comment: Generate Icon files for the Kiosk from Telegraf
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%RECIPE_CACHE_DIR%\downloads\dwgviewr.ico'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\Create-log-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: EndOfCheckPhase
