Description: Imports DWG Trueview x64 to BMS
Identifier: com.github.NickETH.recipes.BMS.DWGTrueview-Win64
ParentRecipe: com.github.NickETH.recipes.build.DWGTrueview-Win64
MinimumVersion: 1.3.1

Input:
  NAME: DWGTrueview
  NAMESHORT: 'Trueview'
  NAMELONG: 'DWG Trueview'
  VENDOR: 'Autodesk'
  PF_STRING: _64
  PLATFORM: x64
  LANG_STRING: _ML
  DIP_NAME: DWGViewer
  DIP_SUBDIR: ML
  PROC_CHAR: '%'

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%version%'
    pattern_replace:
    - pattern: \.
      repl: _


- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: |
      <?xml version="1.0" encoding="ISO-8859-1"?>
      <baramundiDeployScript Version="2420" LastChange="ddaatteettiimmee">
      <META>
      <INFO Vendor="" Name="" Version="" Author="Autopkg" Comment=""/>
      <STATICVARS LoadInstallIni="1">
      <BMSVars></BMSVars>
      </STATICVARS>
      </META>
      <ACTIONS>
      <ACTION type="SetX64Mode" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <MODE>1</MODE>
      </DATA>
      </ACTION>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="1" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>Copy the UnNamed.json file to each user profile</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="CopyFiles" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <SOURCE>{DIP}&#92;Apl&#92;SSuubbssttiittuuttee</SOURCE>
      <DESTINATION>{%AppData%}&#92;Roaming&#92;Autodesk&#92;ADPSDK&#92;UserConsent</DESTINATION>
      <FILES>UnNamed.json</FILES>
      <OPTIONS>43</OPTIONS>
      </DATA>
      </ACTION>
      </ACTIONS>
      </baramundiDeployScript>
    rename_var: bds_content

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%bds_content%'
    pattern_replace:
    - pattern: SSuubbssttiittuuttee
      repl: '%DIP_NAME%&#92;%parsed_string%&#92;%DIP_SUBDIR%'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%parsed_string%'
    pattern_replace:
    - pattern: ddaatteettiimmee
      repl: '%us_date% %time%'

- Processor: FileCreator
  Comment: Generate the install.bds in the release dir.
  Arguments:
    file_content: '%parsed_string%'
    file_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%_Usr.bds'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.exe'
    bms_app_installparm: '--silent'
    bms_app_integration:
    - appname: '%NAME%'
      bundles:
      - action: exchange
        name: nV_%NAME%
      - action: add
        name: aV_%NAME% Uninstall
        version: new
      - action: add
        name: oV_%NAME% Uninstall
        version: previous
      copyfolders: 1
      currentversion:
        bundle: nV_%NAME%
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
      SWDetectionRules:
      - Name: '%DISPLAYNAME%'
        Vendor: 'Autodesk, Inc.'
        Version: '%build_ver%'
        Language: "1033"
        PathType: "2"
        RegKey: '{%UPI2%}'
        ApplyMode: "0"
        Category: "baramundi Application"
        Comments: ''
    bms_app_sharepoint:
    - SW-List-Name: '%NAMELONG%'
      versionplatformtag: '%build_ver% ML (x64)'
    bms_job_kiosk:
    - jobname: '%NAME%'
      substring: 'Taskkill'
      jobdescription: 'DWG Trueview ist eine Software mit der AutoCAD DWG Dateien angezeigt werden können.'
      autoenableapp: '%NAME% - Enable AutoUpdate'
      autoreleasejob: '@_AU-Rel_%NAME%'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_iusr_script: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%_Usr.bds'
    bms_app_iusr_copyloc: true
    #bms_app_iusr_execevery: false
    bms_app_name: '%NAMELONG%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: '{%ProgramW6432%}\Autodesk\AdODIS\V1\Installer.exe'
    bms_app_uninstparm: '-i uninstall --trigger_point system -m {%PROC_CHAR%ProgramData%PROC_CHAR%}\Autodesk\ODIS\metadata\{%UPI2%}\bundleManifest.xml -x {%PROC_CHAR%ProgramData%PROC_CHAR%}\Autodesk\ODIS\metadata\{%UPI2%}\SetupRes\manifest.xsd --silent'
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.*|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    icon_file_src: '%BUILD_DIR%\%pkg_dir%\icons\*.*'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAMESHORT%%PF_STRING%_%build_ver%%LANG_STRING%.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
