Description: Package the current KiCad x64 release.
Identifier: com.github.NickETH.recipes.build.KiCad-Win64
ParentRecipe: com.github.NickETH.recipes.download.KiCad-Win64
MinimumVersion: 1.3.1

Input:
  NAME: KiCad
  VENDOR: 'kicad.org'
  DOWN_URL: 'https://www.kicad.org/download/windows/'
  SEARCH_URL: 'https://www.kicad.org/download/windows'
  PLATFORM: x64
  PF_STRING: _64
  # https://kicad-downloads.s3.cern.ch/windows/stable/kicad-9.0.7-x86_64.exe
  SEARCH_PATTERN: (https://kicad-downloads.s3.cern.ch/windows/stable/kicad-(?P<version>[\d.]+)-x86_64.exe)

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to store the package
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: release:read:sourceunzipped
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_%version%_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%_ML'
    rename_var: pkg_dir

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: Copier
  Comment: Copy the install exe file to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.exe'
    overwrite: 'true'
    source_path: '%pathname%'

# - Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  # Arguments:
    # exe_path: '%pathname%'
    # extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    # extract_file: KiCad-*.7z

# - Processor: FileFinder
  # Arguments:
    # pattern: '%RECIPE_CACHE_DIR%\downloads\KiCad*.7z'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the install executable
  Arguments:
    exe_path: '%pathname%'
    #exe_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.exe'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\'
    extract_file: 'bin\KiCad.exe'
    ignore_pattern: ''
    preserve_paths: 'False'

- Processor: com.github.haircut.processors/AppIconExtractor
  Comment: Extract the icon and create custom icons for the deployment.
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: bl
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\KiCad.exe'
    # msi_icon_name: 'ProductIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'
