Description: Download recipe for KiCad x64.
Identifier: com.github.NickETH.recipes.download.KiCad-Win64
MinimumVersion: 1.3.1

Input:
  NAME: KiCad
  VENDOR: 'kicad.org'
  DOWN_URL: 'https://www.kicad.org/download/windows/'
  SEARCH_URL: 'https://www.kicad.org/download/windows'
  PLATFORM: x64
  PF_STRING: _64
  # https://kicad-downloads.s3.cern.ch/windows/stable/kicad-9.0.7-x86_64.exe
  SEARCH_PATTERN: (https://kicad-downloads.s3.cern.ch/windows/stable/kicad-(?P<version>[\d.]+)-x86_64.exe)

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_PATTERN%'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-x64.exe'
    url: '%match%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: E=seth@kipro-pcb.com, CN=KICAD SERVICES CORPORATION, O=KICAD SERVICES CORPORATION, L=Long Beach, S=California, C=US, OID.1.3.6.1.4.1.311.60.2.1.2=California, OID.1.3.6.1.4.1.311.60.2.1.3=US, SERIALNUMBER=4276589, OID.2.5.4.15=Private Organization
    input_path: '%pathname%'

- Processor: EndOfCheckPhase