Description: Downloads the latest release of Ghostscript x64 from Github.
Identifier: com.github.NickETH.recipes.download.Ghostscript-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Ghostscript
  ASSET_REGEX: gs[0-9]+w64.exe
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: '%ASSET_REGEX%'
    # https://github.com/ArtifexSoftware/ghostpdl-downloads/releases/download/gs1000/gs1000w64.exe
    github_repo: ArtifexSoftware/ghostpdl-downloads
    include_prereleases: false

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.exe'

- Processor: GitHubReleasesInfoProvider
  Arguments:
    # asset_regex: 'ghostscript-(?P&lt;version&gt;([0-9]+\.)*[0-9]+)-linux-x86_64.tgz'
    asset_regex: 'ghostscript-(([0-9]+\.)*[0-9]+)-linux-x86_64.tgz'
    # https://github.com/ArtifexSoftware/ghostpdl-downloads/releases/download/gs1000/gs1000w64.exe
    github_repo: ArtifexSoftware/ghostpdl-downloads
    include_prereleases: false

- Processor: com.github.jazzace.processors/TextSearcher
  Arguments:
    text_in: '%url%'
    re_pattern: 'ghostscript-((?P<versionmajor>[0-9]+)\.(?P<versionminor>[0-9]+)\.(?P<versionbuild>[0-9]+))-linux'
    result_output_var_name: version

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN="Artifex Software, Inc.", O="Artifex Software, Inc.", L=Novato, S=California, C=US
    input_path: '%pathname%'

- Processor: EndOfCheckPhase
