Description: Downloads the latest Logitech Options+ x64 for Windows.
Identifier: com.github.NickETH.recipes.download.LogiOptionsPlus-Win64
MinimumVersion: 1.3.1

Input:
  NAME: LogiOptionsPlus
  NAMESHORT: 'Options+'
  DOWNLOAD_URL: https://download01.logi.com/web/ftp/pub/techsupport/optionsplus/logioptionsplus_installer_offline.exe
  VENDOR: 'Logitech'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML
  DIP_NAME: LogiOptionsPlus
  DIP_SUBDIR: ML

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.exe'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Logitech Inc, O=Logitech Inc, L=Newark, S=California, C=US, SERIALNUMBER=1067879, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=California, OID.1.3.6.1.4.1.311.60.2.1.3=US
    input_path: '%pathname%'
