Description: Downloads latest Adoptium OpenJDK MSI-file for Windows.
Identifier: com.github.NickETH.recipes.download.AdoptiumOpenJDKMSI-Win
MinimumVersion: 1.3.1

Input: {}

Process:
- Processor: URLTextSearcher
  Arguments:
    curl_opts:
    - -L
    - -I
    re_pattern: 'Location: (?P<msi_dl_link>https.+?msi)'
    url: '%SEARCH_URL%'

- Processor: URLTextSearcher
  Arguments:
    curl_opts:
    - -L
    re_pattern: '"semver": "(?P<orgversion>(?P<ver_major>[0-9]+)\.(?P<ver_majorminor>[0-9]+)\.(?P<ver_minor>[0-9]+)\+(?P<ver_build>\d+)(?!.*\d))'
    url: https://api.adoptium.net/v3/assets/latest/%FEATUREVER%/hotspot?vendor=adoptium

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%ver_major%.%ver_majorminor%.%ver_minor%.%ver_build%'
    rename_var: version

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%ver_major%%ver_majorminor%%ver_minor%%ver_build%'
    rename_var: version_string

- Processor: URLTextSearcher
  Arguments:
    re_pattern: '"(?P<zuludlfile>(?P<zuludldir>zulu.+-ca-fx-%PRODUCT%%ver_major%.%ver_majorminor%.%ver_minor%-win_%ZULUPLATFORM%).zip)"'
    url: https://cdn.azul.com/zulu/bin

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: https://cdn.azul.com/zulu/bin/%match%
    rename_var: zululink

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%ver_major%,%ver_majorminor%,%ver_minor%'
    rename_var: ASver

- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: 'False'
    filename: '%DOWNLOAD_FILE%_hotspot_%PLATFORM%.msi'
    url: '%msi_dl_link%'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: E=webmaster@eclipse.org, CN="Eclipse.org Foundation, Inc.", OU=IT, O="Eclipse.org Foundation, Inc.", L=Ottawa, S=Ontario, C=CA
    input_path: '%pathname%'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%pathname%'
    rename_var: path_msi

- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: 'False'
    filename: '%DOWNLOAD_FILE%_zulu_%PLATFORM%.zip'
    url: https://cdn.azul.com/zulu/bin/%zuludlfile%

- Processor: FileCreator
  Arguments:
    file_content: '%version%'
    file_path: '%RECIPE_CACHE_DIR%\version.txt'

- Processor: EndOfCheckPhase
