Description: Alters latest Adoptium OpenJDK 8 JRE Hotspot x86 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.AdoptiumOpenJRE8-Win
ParentRecipe: com.github.NickETH.recipes.download.AdoptiumOpenJDKMSI-Win
MinimumVersion: 1.3.1

Input:
  NAME: AdoptiumOpenJDK_JRE_Hotspot
  FILENAME: 'Adoptium_JRE'
  DOWNLOAD_FILE: OpenJDK8U-JRE
  FEATUREVER: '8'
  PLATFORM: x86
  ZULUPLATFORM: i686
  PRODUCT: jre
  SEARCH_URL: https://api.adoptium.net/v3/installer/latest/%FEATUREVER%/ga/windows/%PLATFORM%/%PRODUCT%/hotspot/normal/adoptium
  ADDON_NAME: JavaFX
  VENDOR: 'Eclipse'
  PF_STRING: ''
  LANG_STRING: _ML

Process:
# - Processor: StopProcessingIf
  # Comment: Uses the Python eval function, It is assumed, that the Adopt-files are supplied earlier, when a new release is ready. If this changes, the predication has to be altered
  # Arguments:
    # predicate: (download_changed == False) or not __import__('os').path.isfile(__import__('os').path.join("%RECIPE_CACHE_DIR%\downloads","%DOWNLOAD_FILE%_zulu_%PLATFORM%.zip")) or not __import__('os').path.isfile(__import__('os').path.join("%RECIPE_CACHE_DIR%\downloads", "%DOWNLOAD_FILE%_hotspot_%PLATFORM%.msi"))

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers:wixproject:wixproject\%ADDON_NAME%:wixproject\Resources:wixproject\Lang
    org_ver: '%version%'
    pkg_dir: Adoptium_JRE_Hotspot%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: Adoptium_JRE_Hotspot%PF_STRING%_%version%%LANG_STRING%
    rename_var: pkg_dir

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%FILENAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%FILENAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%DOWNLOAD_FILE%_hotspot_%PLATFORM%_%version%.msi'
    overwrite: 'true'
    source_path: '%path_msi%'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%FILENAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%path_msi%'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%zuludlfile%'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%zuludlfile%'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileMoverFromList
  Arguments:
    file_list: '%BUILD_DIR%\%pkg_dir%\helpers\Zulu-JFX-%PRODUCT%_%FEATUREVER%-%PLATFORM%.txt'
    source_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%zuludldir%'
    target_dir: '%BUILD_DIR%\%pkg_dir%\wixproject\%ADDON_NAME%'


- Processor: com.github.NickETH.recipes.SharedProcessors/WixSettings
  Comment: Define variables for the WIX build process to the version.wxi file
  Arguments:
    preproc_file: '%BUILD_DIR%\%pkg_dir%\wixproject\version.wxi'
    template_file: None
    new_settings:
    - define: 'version="%build_ver%"'
    - define: 'Packagecode="{NNEEWWGGUUIIDD}"'
    - define: 'ProductManufacturerLong="ETHZ ID-CD"'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSBuildRun
  Comment: Run the MSBuild script to generate the JFX MSM module addon.
  Arguments:
    build_file: '%BUILD_DIR%\%pkg_dir%\wixproject\%ADDON_NAME%%PF_STRING%.build'
    build_folder: '%BUILD_DIR%\%pkg_dir%\wixproject'
    build_property: BuildPlatform=%PLATFORM%;BuildName=%ADDON_NAME%;BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;SourceDir=%BUILD_DIR%\%pkg_dir%\wixproject\%ADDON_NAME%;version=%build_ver%;Platformstr=%PF_STRING%;LangStr=%LANG_STRING%
    build_target: WIX

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIimportMergeModule
  Arguments:
    log_file_abs: '%BUILD_DIR%\%pkg_dir%\wixproject\MSM-log.txt'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%FILENAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    msm_dir: INSTALLDIR
    msm_feature: FeatureJavaFX
    msm_path: '%BUILD_DIR%\%pkg_dir%\wixproject\JavaFX%PF_STRING%_%version%.msm'
    pkg_dir_abs: '%BUILD_DIR%\%pkg_dir%'
    temp_path: '%BUILD_DIR%\%pkg_dir%\wixproject'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Arguments:
    SQL_command:
    - INSERT INTO `Feature` (`Feature`.`Feature`,`Feature`.`Feature_Parent`,`Feature`.`Title`,`Feature`.`Description`, `Feature`.`Display`,`Feature`.`Level`,`Feature`.`Directory_`,`Feature`.`Attributes`) VALUES ('FeatureJavaFX','FeatureMain','JavaFX','Install JavaFX',%FEATUREVER%,2,'INSTALLDIR',8)
    - UPDATE `Property` SET `Property`.`Value`='Adoptium Java RE Hotspot x64 %version% ML' WHERE `Property`.`Property`='ProductName'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%FILENAME%%PF_STRING%_%version%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: Adoptium JRE Hotspot x64 %version% ML
      /o: Version %version% with JavaFX. %us_date% by AutoPkg
      /p: x64;1033
      /t: Adoptium JRE Hotspot x64 %version% ML
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%FILENAME%%PF_STRING%_%version%%LANG_STRING%.msi'

- Processor: EndOfCheckPhase
