Description: Imports the Affinity MSI installer to BMS.
Identifier: com.github.NickETH.recipes.BMS.Affinity-Win64
ParentRecipe: com.github.NickETH.recipes.build.Affinity-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Affinity
  VENDOR: 'Serif'
  VENDOR_LONG: ''
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML
  DIP_NAME: 'Affinity'
  DIP_SUBDIR: ML

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductVersion'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    BASEVERSION: '%msi_value%'
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductLanguage'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    MSILANG: '%msi_value%'
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductName'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    PRODUCTNAME: '%msi_value%'
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='Manufacturer'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    MSIAUTHOR: '%msi_value%'
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS) QSS
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1 NO_UPDATE_CHECK_PROPERTY=#1 NO_CRASH_REPORTS_PROPERTY=#1 NO_REGISTRATION_PROPERTY=#1 NO_ML_MODELS_CONFIG_PROPERTY=#1
    bms_app_integration:
    - appname: '%NAME%'
      bundles:
      - action: exchange
        name: nV_%NAME%
      - action: add
        name: aV_%NAME% Uninstall
        version: new
      - action: add
        name: oV_%NAME% Uninstall
        version: previous
      copyfolders: 1
      currentversion:
        bundle: nV_%NAME%
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
      SWDetectionRules:
      - Name: '%PRODUCTNAME%'
        Vendor: '%MSIAUTHOR%'
        Version: '%build_ver%'
        Language: '%MSILANG%'
        PathType: "2"
        RegKey: '%msi_value%'
        ApplyMode: "0"
        Category: "baramundi Application"
        Comments: ''
    bms_app_sharepoint:
    - SW-List-Name: '%NAME%'
      versionplatformtag: '%build_ver% ML'
    bms_job_kiosk:
    - jobname: '%NAME%'
      substring: 'Taskkill'
      jobdescription: 'Affinity V3 is a graphics editor. It is a simultaneously a vector graphics editor, a raster graphics editor and a desktop publishing application.'
      autoenableapp: '%NAME% - Enable AutoUpdate'
      autoreleasejob: '@_AU-Rel_%NAME%'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn /norestart
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.ms?|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\DEV'
    icon_file_src: '%BUILD_DIR%\%pkg_dir%\icons\*.*'

- Processor: EndOfCheckPhase
