Description: Imports Affinity Designer x64 to BMS
Identifier: com.github.NickETH.recipes.BMS.AffinityDesigner-Win64
ParentRecipe: com.github.NickETH.recipes.build.AffinityDesigner-Win64
MinimumVersion: 1.3.1

Input:
  NAME: AffinityDesigner
  LONG_NAME: 'Affinity Designer'
  VENDOR: 'Serif'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML
  DIP_NAME: Affinity
  DIP_SUBDIR: ML
  PRODUCT_KEY_PROP: ''
  EMAIL_PROP: ''

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%pkg_dir%.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%DIP_NAME%\%NAME%\%parsed_string%\%DIP_SUBDIR%\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1 PRODUCT_KEY_PROPERTY=%PRODUCT_KEY_PROP% EMAIL_PROPERTY=%EMAIL_PROP% NO_UPDATE_CHECK_PROPERTY=#1 NO_EULA_PROPERTY=#1 NO_REGISTRATION_PROPERTY=#1 INSTALL_DESKTOP_SHORTCUT_PROPERTY=#0
    bms_app_integration:
    - appname: '%NAME%'
      bundles:
      - action: exchange
        name: 'nV_%LONG_NAME%'
      - action: add
        name: 'aV_%LONG_NAME% Uninstall'
        version: new
      - action: add
        name: 'oV_%LONG_NAME% Uninstall'
        version: previous
      copyfolders: 1
      currentversion:
        bundle: 'nV_%LONG_NAME%'
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    bms_app_sharepoint:
    - SW-List-Name: '%LONG_NAME%'
      versionplatformtag: '%build_ver% ML'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.ms?|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%NAME%\%parsed_string%\%DIP_SUBDIR%'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%NAME%\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
