Description: Alters latest Zabbix Agent MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.ZabbixAgent2SSL-Win64
ParentRecipe: com.github.NickETH.recipes.download.ZabbixAgent2SSL-Win64
MinimumVersion: 1.3.1

Input:
  NAME: 'ZabbixAgent2SSL'
  NAMEWIDE: 'Zabbix Agent 2 SSL'
  VENDOR: 'Zabbix SIA'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _EN

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create the build environment
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%%LANG_STRING%'
    rename_var: pkg_dir

- Processor: Copier
  Comment: Save a copy of the downloaded MSI to the release dir.
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\helpers\Zabbix-256.png'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%/Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%/Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%/Icon-Install-%NAME%.png'

- Processor: EndOfCheckPhase
