Description: Downloads the latest Element Matrix Client for Windows x64.
Identifier: com.github.NickETH.recipes.download.Element-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Element
  DOWNLOAD_URL: https://element.io/download

Process:
- Processor: URLTextSearcher
  Arguments:
  # https://packages.element.io/desktop/install/win32/x64/Element%20Setup.exe
    re_pattern: '(?P<match>https://packages\.element\.io/desktop/install/win32/x64/Element.*?\.exe)'
    url: '%DOWNLOAD_URL%'

- Processor: URLDownloader
  Arguments:
    filename: Element.exe
    url: '%match%'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: OID.1.3.6.1.4.1.311.60.2.1.3=GB, OID.2.5.4.15=Private Organization, CN=NEW VECTOR LTD, SERIALNUMBER=10873661, O=NEW VECTOR LTD, L=London, C=GB
    input_path: '%pathname%'
