Description: Downloads the latest Oracle Instant Client x86 for Windows.
Identifier: com.github.NickETH.recipes.download.OracleInstantClient-Win
MinimumVersion: 1.3.1

Input:
  NAME: OracleInstantClient
  MAJOR_VERSION: '19'
  DOWNLOAD_URL: 'https:%match%'
  SEARCH_URL: https://www.oracle.com/database/technologies/instant-client/microsoft-windows-32-downloads.html
  SEARCH_PATTERN: '(//download.oracle.com/otn_software/nt/instantclient/[0-9]+/([\s]*?)instantclient-basic-nt-(?P<version>%MAJOR_VERSION%\.(?P<MINOR_VERSION>[0-9]+)\.([0-9]+\.)*[0-9]+)dbru.zip)'
  VENDOR: 'Oracle'
  PLATFORM: x86
  PF_STRING: ''

Process:
- Processor: URLTextSearcher
  Arguments:
  # href="//download.oracle.com/otn_software/nt/instantclient/1917000/instantclient-basic-nt-19.17.0.0.0dbru.zip">
    re_pattern: '%SEARCH_PATTERN%'
    url: '%SEARCH_URL%'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%match%'
    pattern_replace:
    - pattern: '\n'
      repl: ''

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.zip'
    url: 'https:%parsed_string%'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False
