Description: Package the current Oracle Instant Client x64 release to an MSI-package.
Identifier: com.github.NickETH.recipes.build.OracleInstantClient-Win64
ParentRecipe: com.github.NickETH.recipes.download.OracleInstantClient-Win
MinimumVersion: 1.3.1

Input:
  NAME: OracleInstantClient
  APPFOLDER: InstantClient
  MAJOR_VERSION: '19'
  DOWNLOAD_URL: "https:%match%"
  SEARCH_URL: https://www.oracle.com/database/technologies/instant-client/winx64-64-downloads.html
  # https://download.oracle.com/otn_software/nt/instantclient/1918000/instantclient-basic-windows.x64-19.18.0.0.0dbru.zip
  SEARCH_PATTERN: '(//download.oracle.com/otn_software/nt/instantclient/[0-9]+/instantclient-basic-windows.x64-(?P<version>%MAJOR_VERSION%\.(?P<MINOR_VERSION>[0-9]+)\.([0-9]+\.)*[0-9]+)dbru.zip)'
  VENDOR: 'Oracle'
  PLATFORM: x64
  PF_STRING: '_64'
  LANG_STRING: _ML
  DIP_NAME: OracleInstantClient
  DIP_SUBDIR: ML

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to build the MSI with Wix
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    create_AS_ver: 'True'
    folder_list: sourcepkt:sourceunzipped:release:icons:read:helpers:wixproject:wixproject\Includes:wixproject\Resources:wixproject\Lang
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: Copier
  Comment: Copy the Eclipse installer files to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%.zip'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the InstantClient main zip archive
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%filename%'
    extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: URLTextSearcher
  Arguments:
    # https://download.oracle.com/otn_software/nt/instantclient/1918000/instantclient-odbc-windows.x64-19.18.0.0.0dbru.zip
    re_pattern: '(//download.oracle.com/otn_software/nt/instantclient/[0-9]+/instantclient-odbc-windows.x64-%MAJOR_VERSION%\.([0-9]+\.)*[0-9]+dbru.zip)'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%-odbc.zip'
    url: 'https:%match%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the InstantClient odbc zip archive
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%-odbc.zip'
    extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: URLTextSearcher
  Arguments:
    # https://download.oracle.com/otn_software/nt/instantclient/1918000/instantclient-sqlplus-windows.x64-19.18.0.0.0dbru.zip
    re_pattern: '(//download.oracle.com/otn_software/nt/instantclient/[0-9]+/instantclient-sqlplus-windows.x64-%MAJOR_VERSION%\.([0-9]+\.)*[0-9]+dbru.zip)'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%-sqlplus.zip'
    url: 'https:%match%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the InstantClient sqlplus zip archive
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%-sqlplus.zip'
    extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: URLTextSearcher
  Arguments:
    # https://download.oracle.com/otn_software/nt/instantclient/1918000/instantclient-tools-windows.x64-19.18.0.0.0dbru.zip
    re_pattern: '(//download.oracle.com/otn_software/nt/instantclient/[0-9]+/instantclient-tools-windows.x64-%MAJOR_VERSION%\.([0-9]+\.)*[0-9]+dbru.zip)'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%-tools.zip'
    url: 'https:%match%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the InstantClient tools zip archive
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%-tools.zip'
    extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: FileMover
  Comment: Rename the installer folder to the final application dir
  Arguments:
    target: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%APPFOLDER%%PF_STRING%_%MAJOR_VERSION%\'
    source: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\instantclient_%MAJOR_VERSION%_%MINOR_VERSION%\'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the zip archive with the config files.
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\helpers\orafiles.zip'
    extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%APPFOLDER%%PF_STRING%_%MAJOR_VERSION%'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/WixDefaults
  Comment: Set the actual version strings to the version.wxi file
  Arguments:
    build_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML'
    build_ver: '%build_ver%'
    org_ver: '%build_ver%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSBuildRun
  Comment: Run the MSBuild script to generate the Eclipse MSI installer
  Arguments:
    build_file: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%NAME%.build'
    build_folder: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject'
    build_property: BuildPlatform=%PLATFORM%;BuildName=%NAME%;BuildDir=%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject;SourceDir=%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%APPFOLDER%%PF_STRING%_%MAJOR_VERSION%;version=%build_ver%;Platformstr=%PF_STRING%;LangStr=%LANG_STRING%;InstallFolder=%APPFOLDER%%PF_STRING%_%MAJOR_VERSION%
    build_target: WIX
