Description: Package the current Oracle Instant Client x86 release to an MSI-package.
Identifier: com.github.NickETH.recipes.build.OracleInstantClient-Win
ParentRecipe: com.github.NickETH.recipes.download.OracleInstantClient-Win
MinimumVersion: 1.3.1

Input:
  NAME: OracleInstantClient
  APPFOLDER: InstantClient
  MAJOR_VERSION: '19'
  DOWNLOAD_URL: "https:%match%"
  SEARCH_URL: https://www.oracle.com/database/technologies/instant-client/microsoft-windows-32-downloads.html 
  VENDOR: 'Oracle'
  PLATFORM: x86
  PF_STRING: ''
  LANG_STRING: _ML
  DIP_NAME: OracleInstantClient
  DIP_SUBDIR: ML

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to build the MSI with Wix
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    create_AS_ver: 'True'
    folder_list: sourcepkt:sourceunzipped:release:icons:read:helpers:wixproject:wixproject\Includes:wixproject\Resources:wixproject\Lang
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: Copier
  Comment: Copy the Eclipse installer files to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%.zip'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the autopkg zip archive
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%filename%'
    # extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%NAME%'
    extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: URLTextSearcher
  Arguments:
    # https://download.oracle.com/otn_software/nt/instantclient/1917000/instantclient-odbc-nt-19.17.0.0.0dbru.zip
    re_pattern: '(//download.oracle.com/otn_software/nt/instantclient/[0-9]+/instantclient-odbc-nt-%MAJOR_VERSION%\.([0-9]+\.)*[0-9]+dbru.zip)'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    #filename: '%NAME%-odbc.zip'
    filename: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%-odbc.zip'
    url: 'https:%match%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the autopkg zip archive
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%-odbc.zip'
    # extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%NAME%'
    extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: URLTextSearcher
  Arguments:
    # https://download.oracle.com/otn_software/nt/instantclient/1917000/instantclient-sqlplus-nt-19.17.0.0.0dbru.zip
    re_pattern: '(//download.oracle.com/otn_software/nt/instantclient/[0-9]+/instantclient-sqlplus-nt-%MAJOR_VERSION%\.([0-9]+\.)*[0-9]+dbru.zip)'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    #filename: '%NAME%-sqlplus.zip'
    filename: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%-sqlplus.zip'
    url: 'https:%match%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the autopkg zip archive
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%-sqlplus.zip'
    # extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%NAME%'
    extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: URLTextSearcher
  Arguments:
    # https://download.oracle.com/otn_software/nt/instantclient/1917000/instantclient-tools-nt-19.17.0.0.0dbru.zip
    re_pattern: '(//download.oracle.com/otn_software/nt/instantclient/[0-9]+/instantclient-tools-nt-%MAJOR_VERSION%\.([0-9]+\.)*[0-9]+dbru.zip)'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    #filename: '%NAME%-tools.zip'
    filename: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%-tools.zip'
    url: 'https:%match%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the autopkg zip archive
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\sourcepkt\%NAME%-tools.zip'
    # extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%NAME%'
    extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: FileMover
  Comment: Rename the installer folder to the final application dir
  Arguments:
    target: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%APPFOLDER%_%MAJOR_VERSION%\'
    source: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\instantclient_%MAJOR_VERSION%_%MINOR_VERSION%\'

# - Processor: Copier
  # Arguments:
    # destination_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%APPFOLDER%_%MAJOR_VERSION%\network\admin'
    # overwrite: 'true'
    # source_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\helpers\*.zip'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the autopkg zip archive
  Arguments:
    exe_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\helpers\orafiles.zip'
    extract_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%APPFOLDER%_%MAJOR_VERSION%'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

# - Processor: com.github.haircut.processors/AppIconExtractor
  # Arguments:
    # ICON_PATH: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\icons'
    # icon_file_number: 0
    # # composite_padding: 20
    # # composite_position: ul
    # # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # # composite_uninstall_template: /Users/haircut/Documents/delete.png
    # icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    # source_app: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\Eclipse-Java\eclipse.exe'
    # #msi_icon_name: 'MainExecutableIcon.ico'
    # composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    # composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    # composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/WixDefaults
  Comment: Set the actual version strings to the version.wxi file
  Arguments:
    build_dir: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML'
    build_ver: '%build_ver%'
    org_ver: '%build_ver%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSBuildRun
  Comment: Run the MSBuild script to generate the Eclipse MSI installer
  Arguments:
    build_file: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%NAME%.build'
    build_folder: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject'
    build_property: BuildPlatform=%PLATFORM%;BuildName=%NAME%;BuildDir=%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject;SourceDir=%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%APPFOLDER%_%MAJOR_VERSION%;version=%build_ver%;Platformstr=%PF_STRING%;LangStr=%LANG_STRING%;InstallFolder=%APPFOLDER%_%MAJOR_VERSION%
    #build_property: BuildPlatform=%PLATFORM%;BuildName=%NAME%;BuildDir=%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject;SourceDir=%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\wixproject\%NAME%;version=%build_ver%;Platformstr=%PF_STRING%;LangStr=%LANG_STRING%
    build_target: WIX
