Description: Alters latest Slack x64 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.Slack-Win64
ParentRecipe: com.github.NickETH.recipes.download.Slack-MSI-Win
bMinimumVersion: 1.3.1

Input:
  NAME: Slack
  VENDOR: 'Slack Technologies, Inc.'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourceunzipped:sourceunzipped\Icon:release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%%LANG_STRING%'
    rename_var: pkg_dir

- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: false
    filename: '%NAME%_%PLATFORM%.exe'
    # https://downloads.slack-edge.com/releases/windows/4.36.140/prod/x64/SlackSetup.exe
    url: https://downloads.slack-edge.com/releases/windows/%ver3digit%/prod/x64/SlackSetup.exe

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+(\.[0-9]+)?'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+(\.[0-9]+)?'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\downloads\%NAME%_%PLATFORM%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Comment: Create an option to disable the desktop shortcut in the Slack MSI-file
  Arguments:
    SQL_command:
    - INSERT INTO `Property` (`Property`.`Property`,`Property`.`Value`) VALUES ('DESKTOPSC','0')
    - INSERT INTO `Property` (`Property`.`Property`,`Property`.`Value`) VALUES ('ARPPRODUCTICON','SlackIcon.exe')
    - DELETE FROM `Property` WHERE `Property`.`Property`='ARPSYSTEMCOMPONENT'
    - UPDATE `Component` SET `Component`.`Condition`='DESKTOPSC=1' WHERE `Component`.`Component`='DesktopShortcut'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%RECIPE_CACHE_DIR%\downloads\%NAME%_%PLATFORM%.exe'
    # source_app: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/ResourceWorker
  Comment: Extract the Eclipse res file
  Arguments:
    exe_path: '%RECIPE_CACHE_DIR%\downloads\%NAME%_%PLATFORM%.exe'
    output_file: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Icon-%NAME%.res'
    reswork_action: 'extract'
    reswork_cmd: 'ICONGROUP,,'
    # ignore_errors: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/ResourceWorker
  Comment: Generate a new Icon.exe file for Eclipse-Java
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\helpers\Icon-Stub-1.exe'
    input_file: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Icon-%NAME%.res'
    output_file: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Main-Icon.exe'
    reswork_action: 'add'
    reswork_cmd: 'ICONGROUP,,'
    # ignore_errors: 'True'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Icon\SlackIcon.exe.ibd'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Main-Icon.exe'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIDbWorker
  Comment: Merges the Icon with the main MSI-file
  Arguments:
    mode: -i
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    workfile: 'Icon.idt'
    workfolder: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: '%NAME%'
      /o: Version %version%, %us_date% by AutoPkg
      /t: '%NAME% %version% ML'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'

- Processor: EndOfCheckPhase
