Description: Alters latest Slack x64 MSIX-file for Windows.
Identifier: com.github.NickETH.recipes.build.Slack-Win64
ParentRecipe: com.github.NickETH.recipes.download.Slack-MSIX-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Slack
  VENDOR: 'Slack Technologies, Inc.'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourceunzipped:sourceunzipped\Icon:release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%%LANG_STRING%'
    rename_var: pkg_dir

# - Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  # Comment: Extract the WhatsApp msix package to the release dir
  # Arguments:
    # exe_path: '%pathname%'
    # extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\'
    # # extract_file: automation_whatsapp_windows_uwp_store_hybrid_production_x64.msix
    # extract_file: automation_whatsapp_windows_uwp_store_hybrid_production_WithoutSharesheet_x64.msix

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the WhatsApp msix package to the release dir
  Arguments:
    # exe_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\automation_whatsapp_windows_uwp_store_hybrid_production_x64.msix'
    exe_path: '%pathname%'
    # exe_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\automation_whatsapp_windows_uwp_store_hybrid_production_WithoutSharesheet_x64.msix'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\'
    extract_file: 'SlackAppList.targetsize-256.png'
    recursive: true
    preserve_paths: false

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msix'
    overwrite: 'true'
    # source_path: '%RECIPE_CACHE_DIR%\downloads\%NAME%_%PLATFORM%.msi'
    source_path: '%pathname%'
    
# - Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  # Comment: Move all files to the release dir
  # Arguments:
    # cmdline_args:
    # - /C
    # - move
    # - /Y
    # - '%RECIPE_CACHE_DIR%\download_full\*.*'
    # - '%BUILD_DIR%\%pkg_dir%\release\'
    # exe_file: 'cmd.exe'
    # exe_folder: '%RECIPE_CACHE_DIR%'

# - Processor: PathDeleter
  # Comment: Remove the temporary download folder
  # Arguments:
    # path_list: '%RECIPE_CACHE_DIR%/download_full'

- Processor: com.github.haircut.processors/AppIconExtractor
  Comment: Generate Icon files for the Kiosk from WhatsAppDesktop
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\AppList.targetsize-256.png'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\Create-log-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: EndOfCheckPhase
