Description: Download recipe for Prusa Slicer Standalone.
Identifier: com.github.NickETH.recipes.download.PrusaSlicerStandalone-Win64
MinimumVersion: 1.3.1

Input:
  NAME: PrusaSlicerStandalone
  SEARCH_VER: (?P<SessionID>ASPSESSIONID[A-Z]+)\t(?P<CookieStr>[A-Z]+)
  DOWNLOAD_URL: (https://cdn.prusa3d.com/downloads/drivers/PrusaSlicer_Win_standalone_(?P<version>([0-9]+\.)*[0-9]+)\.exe)
  USER_AGENT: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:81.0) Gecko/20100101 Firefox/81.0

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    #asset_regex: PrusaSlicer-(?P<finalversion>([0-9]+\.)*[0-9]+)\+win64-[0-9]+_signed\.zip
    #asset_regex: PrusaSlicer-(?P<finalversion>([0-9]+\.)*[0-9]+)\+win64-[0-9]+\.zip
    #https://github.com/prusa3d/PrusaSlicer/releases/download/version_2.9.2/PrusaSlicer-2.9.2-win64.zip
    asset_regex: PrusaSlicer-(?P<finalversion>([0-9]+\.)*[0-9]+)-win64\.zip
    github_repo: prusa3d/PrusaSlicer
    include_prereleases: false

- Processor: com.github.jazzace.processors/TextSearcher
  Arguments:
    text_in: '%version%'
    re_pattern: '\d+\.\d+\.\d+'
    result_output_var_name: 'version'

- Processor: com.github.homebysix-recipes.FindAndReplace/FindAndReplace
  Arguments:
    input_string: '%version%'
    find: .
    replace: _

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.exe'
    request_headers:
      user-agent: '%USER_AGENT%'
    # url: https://cdn.prusa3d.com/downloads/drivers/PrusaSlicer_Win_standalone_%output_string%.exe
    url: https://cdn.prusa3d.com/downloads/drivers/prusa3d_win_%output_string%.exe

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Prusa Research a.s., OU=Prusa Research, O=Prusa Research a.s., L=Praha, C=CZ, SERIALNUMBER=06649114, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.3=CZ
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
