Description: Package the current FileMaker Pro (Claris) full installer for Windows x64.
Identifier: com.github.NickETH.recipes.build.FileMakerPro-Win64
ParentRecipe: com.github.NickETH.recipes.download.FileMakerPro-Win64
MinimumVersion: 1.3.1

Input:
  NAME: FileMakerPro
  ALTNAME: 'FileMaker Pro'
  PRODUCT_ID: PRO2064WIN
  MAJOR_VERSION: '20'
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to alter the MSI file
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    create_AS_ver: 'True'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%_ML'
    rename_var: pkg_dir

- Processor: com.github.jazzace.processors/TextSearcher
  Arguments:
    text_in: '%build_ver%'
    re_pattern: '^\d+\.\d+\.\d+'
    result_output_var_name: 'short_version'

# - Processor: com.github.jazzace.processors/TextSearcher
  # Arguments:
    # text_in: '%build_ver%'
    # re_pattern: '^\d+'
    # result_output_var_name: 'major_version'

- Processor: Copier
  Comment: Copy the FileMaker installer file to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\downloads\%filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the FileMaker exe installer wrapper
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: FileFinder
  Arguments:
    pattern: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%ALTNAME%*'

- Processor: Copier
  Comment: Copy the FileMaker installer files to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\'
    overwrite: 'true'
    #source_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%ALTNAME% %short_version%\Files\'
    source_path: '%found_filename%\Files\'

- Processor: Copier
  Comment: Make a copy from FileMaker MSI to the helpers folder to apply the language transform and additional properties
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\helpers\%NAME%%PF_STRING%_1031.msi'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\release\%ALTNAME% %MAJOR_VERSION%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Apply the language transform to the FileMaker MSI copy
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%pkg_dir%\helpers\%NAME%%PF_STRING%_1031.msi'
    mst_paths: '%BUILD_DIR%\%pkg_dir%\release\1031.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Comment: Change a few settings in the FileMaker MSI-file
  Arguments:
    SQL_command:
    - INSERT INTO `Property` (`Property`.`Property`,`Property`.`Value`) VALUES ('AI_DESKTOPSHORTCUT',0)
    - INSERT INTO `Property` (`Property`.`Property`,`Property`.`Value`) VALUES ('AI_QUICKLAUNCH',0)
    - UPDATE `Property` SET `Property`.`Value`='LicenseCertificate' WHERE `Property`.`Property`='AI_TRIALORLICENSEKEYORCERTIFICATE'
    - UPDATE `Property` SET `Property`.`Value`='Informatikdienste - ETH Zürich' WHERE `Property`.`Property`='AI_USERNAME'
    - UPDATE `Property` SET `Property`.`Value`=1 WHERE `Property`.`Property`='AI_LICENSE_ACCEPTED'
    - UPDATE `Property` SET `Property`.`Value`=0 WHERE `Property`.`Property`='AI_SHORTCUTS'
    - UPDATE `Property` SET `Property`.`Value`=1 WHERE `Property`.`Property`='AI_DISABLEUPDATENOTIFY'
    - UPDATE `Property` SET `Property`.`Value`=1 WHERE `Property`.`Property`='AI_DISABLEVERSIONNOTIFY'
    - UPDATE `Property` SET `Property`.`Value`='English German French Italian' WHERE `Property`.`Property`='AI_LANGUAGE'
    - UPDATE `Property` SET `Property`.`Value`=1 WHERE `Property`.`Property`='AI_SKIPDIALOG'
    - UPDATE `Property` SET `Property`.`Value`='1031' WHERE `Property`.`Property`='ProductLanguage'
    - DELETE FROM `LaunchCondition` WHERE `LaunchCondition`.`Condition`='ACTIONPROPERTY Or (LanguagePackInstaller=0) Or Installed'
    - INSERT INTO `Directory` (`Directory`.`Directory`,`Directory`.`Directory_Parent`,`Directory`.`DefaultDir`) VALUES ('SHORTCUTDIR','ProgramMenuFolder','Filemaker')
    - UPDATE `Shortcut` SET `Shortcut`.`Directory_`='SHORTCUTDIR', `Shortcut`.`Name`='FILEMA~4|FileMaker Pro %MAJOR_VERSION%' WHERE `Shortcut`.`Shortcut`='FileMakerDeveloper'
    msi_path: '%BUILD_DIR%\%pkg_dir%\helpers\%NAME%%PF_STRING%_1031.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Generate a new 1031 language transform from the FileMaker MSI-file and the copy
  Arguments:
    mode: -g
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%ALTNAME% %MAJOR_VERSION%.msi'
    msi_path_new: '%BUILD_DIR%\%pkg_dir%\helpers\%NAME%%PF_STRING%_1031.msi'
    mst_paths: '%BUILD_DIR%\%pkg_dir%\release\p%MAJOR_VERSION%_1031.mst'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    #source_app: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    source_app: '%BUILD_DIR%\%pkg_dir%\release\%ALTNAME% %MAJOR_VERSION%.msi'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'
