Description: Downloads the latest FileMaker Pro (Claris) full installer for Windows x64 given the supplied PRODUCT_ID.
# To use this recipe, go to https://www.filemaker.com/redirects/ss.txt and find the desired product in the list (ex. PRO19MAC). Enter this value for PRODUCT_ID."
# This recipe was derived from com.github.apizz.download.Claris
Identifier: com.github.NickETH.recipes.download.FileMakerPro-Win64
MinimumVersion: 1.3.1

Input:
  NAME: FileMakerPro
  PRODUCT_ID: PRO2064WIN
  SEARCH_PATTERN: ("%PRODUCT_ID%","url":"(?P<url>https://downloads.claris.com/esd/fmp_(?P<version>[\d.]+)_x64.exe)")

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_PATTERN%'
    url: https://www.filemaker.com/redirects/ss.txt

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-x64.exe'
    url: '%url%'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Claris International Inc., O=Claris International Inc., L=Santa Clara, S=California, C=US
    input_path: '%pathname%'