Description: Imports FileMaker Pro (Claris) release to BMS
Identifier: com.github.NickETH.recipes.BMS.FileMakerPro-Win64
ParentRecipe: com.github.NickETH.recipes.build.FileMakerPro-Win64
MinimumVersion: 1.3.1

Input:
  NAME: FileMakerPro
  ALTNAME: 'FileMaker Pro'
  VENDOR: Claris
  PRODUCT_ID: PRO2064WIN
  MAJOR_VERSION: '20'
  UNINST_BUND_VER: '19-20'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML
  DIP_NAME: FileMaker
  DIP_SUBDIR: ML
  LIC_URL: 'your license file path'

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: URLDownloader
  Comment: Get the FileMaker license file from inhouse path
  Arguments:
    url: 'file://%LIC_URL%/LicenseCert.fmcert'
    filename: 'LicenseCert.fmcert'

- Processor: Copier
  Comment: Copy the FileMaker license file to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\LicenseCert.fmcert'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\downloads\LicenseCert.fmcert'
    
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%ALTNAME% %MAJOR_VERSION%.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%version%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: FileCreator
  Comment: Generate the firewall install.bds in the release dir.
  Arguments:
    file_content: |
      <?xml version="1.0" encoding="ISO-8859-1"?>
      <baramundiDeployScript Version="2220" LastChange="%us_date% %time%">
      <META>
      <INFO Vendor="" Name="" Version="" Author="Autopkg" Comment=""/>
      <STATICVARS LoadInstallIni="1">
      <BMSVars></BMSVars>
      </STATICVARS>
      </META>
      <ACTIONS>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="1" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>set FW rule</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="RunEmbeddedCmd" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <SCRIPT>netsh advfirewall firewall add rule name=&quot;%ALTNAME% %MAJOR_VERSION%&quot; dir=in program=&quot;{&#37;ProgramW6432&#37;}&#92;Filemaker&#92;Filemaker Pro %MAJOR_VERSION%&#92;Filemaker Pro.exe&quot; enable=yes protocol=any profile=any action=allow remoteip=127.0.0.1
      </SCRIPT>
      <RETURNCODES>0</RETURNCODES>
      <VARNAME></VARNAME>
      <OPTIONS>1</OPTIONS>
      </DATA>
      </ACTION>
      </ACTIONS>
      </baramundiDeployScript>
    file_path: '%BUILD_DIR%\%pkg_dir%\release\i_FM%MAJOR_VERSION%FW.bds'

- Processor: FileCreator
  Comment: Generate the firewall uninstall.bds in the release dir.
  Arguments:
    file_content: |
      <?xml version="1.0" encoding="ISO-8859-1"?>
      <baramundiDeployScript Version="2220" LastChange="%us_date% %time%">
      <META>
      <INFO Vendor="" Name="" Version="" Author="Autopkg" Comment=""/>
      <STATICVARS LoadInstallIni="1">
      <BMSVars></BMSVars>
      </STATICVARS>
      </META>
      <ACTIONS>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="1" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>remove FW rule</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="RunEmbeddedCmd" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <SCRIPT>netsh advfirewall firewall delete rule name=&quot;%ALTNAME% %MAJOR_VERSION%&quot;
      </SCRIPT>
      <RETURNCODES>0</RETURNCODES>
      <VARNAME></VARNAME>
      <OPTIONS>1</OPTIONS>
      </DATA>
      </ACTION>
      </ACTIONS>
      </baramundiDeployScript>
    file_path: '%BUILD_DIR%\%pkg_dir%\release\u_FM%MAJOR_VERSION%FW.bds'
    
- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS) QSS
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\%ALTNAME% %MAJOR_VERSION%.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1 TRANSFORMS="p%MAJOR_VERSION%_1031.mst"
    bms_app_installbds: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\i_FM%MAJOR_VERSION%FW.bds'
    bms_app_integration:
    - appname: '%ALTNAME% %MAJOR_VERSION%'
      bundles:
      - action: exchange
        name: nV_%ALTNAME% %major_version%
      - action: add
        name: aV_%ALTNAME% %UNINST_BUND_VER% Uninstall
        version: new
      - action: add
        name: oV_%ALTNAME% %UNINST_BUND_VER% Uninstall
        version: previous
      copyfolders: 1
      currentversion:
        bundle: nV_%ALTNAME% %MAJOR_VERSION%
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML'
        type: bundles
      platform: ''
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    bms_app_sharepoint:
    - SW-List-Name: '%ALTNAME%'
      versionplatformtag: '%build_ver% ML'
    bms_job_kiosk:
    - jobname: '%NAME%'
      substring: 'Taskkill'
      jobdescription: 'FileMaker is a cross-platform relational database application with a GUI-interface.'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%ALTNAME% %MAJOR_VERSION%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn
    bms_app_uninstbds: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\u_FM%MAJOR_VERSION%FW.bds'
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.*|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    icon_file_src: '%BUILD_DIR%\%pkg_dir%\icons\*.*'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
