Description: Downloads the latest FileMaker Pro (Claris) full installer for Windows x64 given the supplied PRODUCT_ID.
# To use this recipe, go to https://www.filemaker.com/redirects/ss.txt and find the desired product in the list (ex. PRO19MAC). Enter this value for PRODUCT_ID."
# This recipe was derived from com.github.apizz.download.Claris
Identifier: com.github.NickETH.recipes.download.FileMakerPro-Win64
MinimumVersion: 1.3.1

Input:
  NAME: FileMakerPro
  MAJOR_VERSION: '20'
  PRODUCT_ID: PRO2064WIN
  SEARCH_PATTERN: ("%PRODUCT_ID%","url":"(?P<url>https://downloads.claris.com/esd/fmp_(?P<version>[\d.]+)_x64.exe)")

Process:
- Processor: URLTextSearcher
  Arguments:
    # re_pattern: '%SEARCH_PATTERN%'
    re_pattern: ("PRO%MAJOR_VERSION%64WIN","url":"(?P<url>https://downloads.claris.com/esd/fmp_(?P<version>[\d.]+)_x64.exe)")
    url: https://www.filemaker.com/redirects/ss.txt

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%%MAJOR_VERSION%-x64.exe'
    url: '%url%'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Claris International Inc., O=Claris International Inc., L=Cupertino, S=California, C=US, SERIALNUMBER=2107514, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Delaware,OID.1.3.6.1.4.1.311.60.2.1.3=US
    input_path: '%pathname%'