Description: Package the current Enpass release.
Identifier: com.github.NickETH.recipes.build.Enpass-Win
ParentRecipe: com.github.NickETH.recipes.download.Enpass-Win
MinimumVersion: 1.3.1

Input:
  NAME: Enpass
  URL: https://www.enpass.io/downloads/
  PLATFORM: x86
  PF_STRING: ''

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to store the package
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: release:read
    org_ver: '%version%'
    pkg_dir: '%NAME%_%version%_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%_ML'
    rename_var: pkg_dir

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: run the SafeExamBrowser setup to extract the MSI file to the unzipped dir
  Arguments:
    cmdline_args:
    - '%pathname%'
    - ''
    - -x
    - '%BUILD_DIR%\%pkg_dir%\sourceunzipped"'
    exe_file: '%DTF_PATH%\..\bin\dark.exe'
    exe_folder: '%BUILD_DIR%\%pkg_dir%\sourcepkt'

- Processor: FileFinder
  Comment: Get the full path to the extracted MSI file
  Arguments:
    pattern: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\*\*.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: Copier
  Comment: Copy the Enpass install msi file to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    overwrite: 'true'
    source_path: '%found_filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Comment: Set a condition to the desktop shortcut component in the Enpass MSI-file
  Arguments:
    SQL_command:
    - UPDATE `Component` SET `Component`.`Condition`='DESKTOPSC=1' WHERE `Component`.`Component`='EnpassDesktopShortcut'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%/Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%/Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%/Icon-Install-%NAME%.png'

- Processor: EndOfCheckPhase