Description: Downloads the latest version of LyX x64 for Windows.
Identifier: com.github.NickETH.recipes.download.LyX-Win64
MinimumVersion: 1.3.1

Input:
  NAME: LyX
  DOWNLOAD_URL: https://www.lyx.org/Download
  SEARCH_PATTERN: bin\/(?P<version>.*?)\/(?P<file>LyX-.*?-Installer.*?-x64\.exe)
  USER_AGENT: Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; AS; rv:11.0) like Gecko

Process:
- Processor: URLTextSearcher
  Comment: Get the headers to extract the version from the filename
  Arguments:
    re_pattern: '%SEARCH_PATTERN%'
    url: '%DOWNLOAD_URL%'

- Processor: URLDownloader
  Arguments:
    curl_opts:
    - --location
    filename: '%NAME%-x64.exe'
    request_headers:
      user-agent: '%USER_AGENT%'
    url: https://ftp.lip6.fr/pub/lyx/bin/%version%/%file%

- Processor: EndOfCheckPhase
