Description: Alters latest ZoomClient x64 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.ZoomClient-Win64
ParentRecipe: com.github.NickETH.recipes.download.ZoomClientMSI-Win
MinimumVersion: 1.3.1

Input:
  NAME: ZoomClient
  PLATFORM: x64
  DOWNLOAD_URL: https://www.zoom.us/client/latest/ZoomInstallerFull.msi?archType=%PLATFORM%
  PF_STRING: _64

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Comment: Check the signature on the MSI file
  Arguments:
    expected_subject: CN="Zoom Communications, Inc.", O="Zoom Communications, Inc.", L=San Jose, S=California, C=US, SERIALNUMBER=4969967, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Delaware, OID.1.3.6.1.4.1.311.60.2.1.3=US
    input_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Comment: Get the version from the MSI file
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductVersion'
    msi_path: '%pathname%'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%msi_value%'
    rename_var: version

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create the build environment
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: ZoomClient%PF_STRING%_%version%_ML
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: ZoomClient%PF_STRING%_%version%_ML
    rename_var: pkg_dir

- Processor: Copier
  Comment: Save a copy of the downloaded MSI file to the release dir.
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: Copier
  Comment: Save a copy of the downloaded MSI file to the build dir.
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%NAME%.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\helpers\ZoomClient_256.ico'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-ZoomClient%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-ZoomClient%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: EndOfCheckPhase
