Description: Downloads the latest version of the Zoom Client MSI.
Identifier: com.github.NickETH.recipes.download.ZoomClientMSI-Win
MinimumVersion: 1.3.1

Input:
  NAME: Zoom
  PLATFORM: x86
  DOWNLOAD_URL: https://www.zoom.us/client/latest/ZoomInstallerFull.msi?archType=%PLATFORM%
  USER_AGENT: Mozilla/5.0 (Windows NT 10.0; Win64; x64)

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%PLATFORM%.msi'
    request_headers:
      user-agent: '%USER_AGENT%'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase
