Description: Downloads latest NoMachine Enterprise Client Install-file for Windows.
Identifier: com.github.NickETH.recipes.download.NoMachineEnterpriseClient-Win64
MinimumVersion: 1.3.1

Input:
  NAME: NoMachineEnterpriseClient
  VENDOR: NoMachine
  DOWNLOAD_URL: 'https://downloads.nomachine.com/download/?id=6&platform=windows'
  SEARCH_FIRSTURL: 'https://downloads.nomachine.com/download'
  SEARCH_SECONDURL: 'https://downloads.nomachine.com/download/?id=6&platform=windows'
  #            https://web9001.nomachine.com/download/9.1/Windows/nomachine-enterprise-client_9.1.24_6_x64.exe
  RE_PATTERN: (https://web9001.nomachine.com/download/[0-9\.]*/Windows/nomachine-enterprise-client_(?P<version>([0-9]+[\.|_])*[0-9]*)_x64\.exe)
  PLATFORM: x64
  PF_STRING: _64

Process:
# - Processor: URLTextSearcher
  # Arguments:
    # re_pattern: 'www.nomachine.com'
    # url: 'https://www.nomachine.com'
    # curl_opts:
    # - -c
    # - '%RECIPE_CACHE_DIR%\cookie.txt'

# - Processor: URLTextSearcher
  # Arguments:
    # # https://download.nomachine.com/download/8.7/Windows/nomachine-enterprise-client_8.7.1_6_x64.exe"
    # re_pattern: (?P<match>https://download.nomachine.com/download/[0-9\.]*/Windows/nomachine-enterprise-client_(?P<version>([0-9]+[\.|_])*[0-9]*)_x64\.exe)
    # url: '%DOWNLOAD_URL%'
    # curl_opts:
    # - L
    # - -b
    # - '%RECIPE_CACHE_DIR%\cookie.txt'

# - Processor: com.github.NickETH.recipes.SharedProcessors/Selenium
  # Arguments:
    # browser_binary_path: 'C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\msedge.exe'
    # browser_used: Edge
    # primary_url: '%SEARCH_FIRSTURL%'
    # re_pattern: '%RE_PATTERN%'
    # #re_pattern: '.*'
    # user_data_dir: '%RECIPE_CACHE_DIR%\Selenium'
    # selenium_commands:
    # - browser.get("%SEARCH_FIRSTURL%")
    # - browser.get("%SEARCH_SECONDURL%")
    # selenium_options:
    # #- self.options.add_argument("--headless=new") # See: https://github.com/SeleniumHQ/selenium/issues/11634
    # - self.options.add_argument("--disable-infobars")
    # #- self.options.add_argument("--disable-extensions")
    # #- self.options.add_argument("--remote-allow-origins=*")
    # - |
        # self.options.add_experimental_option("prefs", {
            # "download.default_directory": '%RECIPE_CACHE_DIR%\\downloads',
            # "download.prompt_for_download": False,
            # "download.directory_upgrade": True,
            # "safebrowsing.enabled": True
          # })
    # webdriver_binary_path: '%TOOLS_DIR%\msedgedriver.exe'

- Processor: com.github.NickETH.recipes.SharedProcessors/RenderedURLTextSearcher
  Arguments:
    re_pattern: '%RE_PATTERN%'
    wait_until: networkidle
    # "Optional waitUntil option for Playwright (load, domcontentloaded, networkidle). Default: load"
    request_headers:
      user-agent: Mozilla/5.0 (Windows NT 6.3; Win64, x64; Trident/7.0; rv:11.0) like Gecko
    url: '%SEARCH_SECONDURL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.exe'
    # url: '%match%_x64.exe'
    url: '%match%'
    # curl_opts:
    # - -b
    # - '%RECIPE_CACHE_DIR%\cookie.txt'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=NoMachine S.a.r.l., O=NoMachine S.a.r.l., L=Luxembourg, C=LU, SERIALNUMBER=B171704, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.3=LU
    input_path: '%pathname%'