Description: Alters latest MobaXterm Install-file for Windows.
Identifier: com.github.NickETH.recipes.build.MobaXterm-Win
ParentRecipe: com.github.NickETH.recipes.download.MobaXterm-Win
MinimumVersion: 1.3.1

Input:
  NAME: MobaXterm
  VENDOR: Mobatek
  DOWNLOAD_URL: https://mobaxterm.mobatek.net/download-home-edition.html
  PLATFORM: x86
  PF_STRING: ''

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the MobaXterm installer
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: FileFinder
  Comment: Get the the name of the extracted MSI-File
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%\downloads\*.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Comment: Get the ProductCode into the  msi_value variable for the BMS uninstall string
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductVersion'
    msi_path: '%found_filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to store the package
  Arguments:
    version: '%msi_value%'
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: helpers:sourceunzipped:release:read
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%version%_ML'
    rename_var: pkg_dir

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the MobaXterm installer
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: FileMover
  Comment: Move the MobaXterm msi file to the release dir
  Arguments:
    target: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%_ML.MSI'
    source: '%found_filename%'

- Processor: FileFinder
  Comment: Get the the name of the extracted DAT-File
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%\downloads\*.dat'

- Processor: FileMover
  Comment: Move the MobaXterm dat file to the release dir
  Arguments:
    target: '%BUILD_DIR%\%pkg_dir%\release\%found_basename%'
    source: '%found_filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIDbWorker
  Comment: Merges the WixFirewallCA-merge.msi with the main MSI-file
  Arguments:
    mode: -m
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%_ML.MSI'
    workfile: '%BUILD_DIR%\%pkg_dir%\helpers\WixFirewallCA-merge.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Apply the per Computer transform to the Teams MSI
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%_ML.MSI'
    mst_paths: '%BUILD_DIR%\%pkg_dir%\helpers\MobaXtermFW.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: EndOfCheckPhase
