Description: Downloads latest MobaXterm Home Install-file for Windows.
Identifier: com.github.NickETH.recipes.download.MobaXterm-Win
MinimumVersion: 1.3.1

Input:
  NAME: MobaXterm
  VENDOR: Mobatek
  DOWNLOAD_URL: https://mobaxterm.mobatek.net/download-home-edition.html
  PLATFORM: x86
  PF_STRING: ''

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: (?P<match>https://download.mobatek.net/[\d]+/MobaXterm_Installer_v(?P<version>([0-9]+\.)*[0-9]+)\.zip)
    url: '%DOWNLOAD_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.zip'
    url: '%match%'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False
