Description: Downloads the latest release of Paint.Net x64 from Github.
Identifier: com.github.NickETH.recipes.download.PaintNet-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Paint.Net
  ASSET_REGEX: 'paint.net.*?winmsi\.x64\.zip'
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: '%ASSET_REGEX%'
    # https://github.com/paintdotnet/release/releases/download/v5.1.12/paint.net.5.1.12.winmsi.x64.zip
    github_repo: paintdotnet/release
    include_prereleases: false

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.zip'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

# - Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  # Comment: Generate the final version string.
  # Arguments:
    # input_string: '%version%'
    # pattern_replace:
    # - pattern: 'release-'
      # repl: ''

# - Processor: WindowsSignatureVerifier
  # Arguments:
    # expected_subject: CN=SignPath Foundation, O=SignPath Foundation, L=Lewes, S=Delaware, C=US
    # input_path: '%pathname%'
    
- Processor: EndOfCheckPhase
  # Arguments:
    # version: '%parsed_string%'
