Description: Downloads the latest SumatraPDF x64 installer package for Windows.
Identifier: com.github.NickETH.recipes.download.SumatraPDF-Win64
MinimumVersion: 1.3.1

Input:
  NAME: SumatraPDF
  URL: https://www.sumatrapdfreader.org/update-check-rel.txt
  SEARCH_REGEX: 'Latest.(?P<version>([0-9]+\.)*[0-9]+)'
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: URLTextSearcher
  Comment: Determine the latest version from the download site.
  Arguments:
    re_pattern: '%SEARCH_REGEX%'
    url: '%URL%'

- Processor: URLDownloader
  Comment: rewrite the version variable with the build string, download the installer file.
  Arguments:
    #version: '%version%%parsed_string%'
    filename: '%NAME%%PLATFORM%.exe'
    url: https://www.sumatrapdfreader.org/dl/rel/%version%/SumatraPDF-%version%-64-install.exe

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Krzysztof Kowalczyk, O=Krzysztof Kowalczyk, L=San Diego, S=California, C=US
    input_path: '%pathname%'

- Processor: EndOfCheckPhase
