Description: Download recipe for Fujitsu DeskUpdate.
Identifier: com.github.NickETH.recipes.download.FujitsuDeskUpdate-Win
MinimumVersion: 1.3.1

Input:
  NAME: FujitsuDeskUpdate
  SOFTWARE_GUID: '"updateSetupPackage":{"id":[\w]*,"softwareID":"(?P<SW_GUID>[\w]*-[\w]*-[\w]*-[\w]*-[\w]*)"}'
  USER_AGENT: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:81.0) Gecko/20100101 Firefox/81.0

Process:
- Processor: URLTextSearcher
  Arguments:
    curl_opts:
    - --request
    - GET
    re_pattern: '%SOFTWARE_GUID%'
    url: https://webdownloads.ts.fujitsu.com/deskupdate_5_1/data/api/v2/update/5.02.0075.0

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.exe'
    url: https://webdownloads.ts.fujitsu.com/download/FileDownload/fileDownload.aspx?SoftwareGUID=%SW_GUID%&FileFolder=Downloadfiles&FileTypeExtension=EXE
    #$url = 'https://webdownloads2.ts.fujitsu.com/download/FileDownload/fileDownload.aspx?SoftwareGUID=A63621A0-4BE1-476E-9B86-309ADB82E0A8&FileFolder=Downloadfiles&FileTypeExtension=EXE&FileNameClient=FTS_DeskUpdateSetup_5020064_1295759.EXE'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=FUJITSU CLIENT COMPUTING LIMITED, O=FUJITSU CLIENT COMPUTING LIMITED, S=Kanagawa, C=JP
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
