Description: Imports Fujitsu DeskUpdate to BMS
Identifier: com.github.NickETH.recipes.BMS.FujitsuDeskUpdate-Win
ParentRecipe: com.github.NickETH.recipes.build.FujitsuDeskUpdate-Win
MinimumVersion: 1.3.1

Input:
  NAME: FujitsuDeskUpdate
  PLATFORM: x86
  SHORT_NAME: 'DeskUpdate'
  VENDOR: 'Fujitsu'
  PF_STRING: ''
  LANG_STRING: _ML
  DIP_NAME: 'DeskUpdate'
  DIP_SUBDIR: ML

Process:
- Processor: com.github.homebysix-recipes.FindAndReplace/FindAndReplace
  Arguments:
    input_string: '%build_ver%'
    find: .
    replace: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%DIP_NAME%\%output_string%\%DIP_SUBDIR%\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.exe'
    bms_app_installparm: /VERYSILENT /LANG=en /TASKS="*!checkdesktopicon,*!checkquicklaunchicon,checkstartmenu"
    bms_app_integration:
    - appname: '%SHORT_NAME%'
      currentversion:
        job: '@_nV_Fujitsu DeskUpdate - Update (DYN)'
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML'
        type: job
      copyfolders: 1
      jobs:
      - action: add
        name: '@_nV_Fujitsu DeskUpdate - Update (DYN)'
        version: new
      - action: changetype
        name: '@_nV_Fujitsu DeskUpdate - Update (DYN)'
        version: previous
      platform: ''
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    bms_app_sharepoint:
    - SW-List-Name: '%SHORT_NAME%'
      versionplatformtag: '%build_ver% ML'
    bms_app_iopt_copylocal: 'false'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'true'
    bms_app_iopt_usebbt: true
    bms_app_name: '%SHORT_NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: '"C:\Program Files (x86)\Fujitsu\DeskUpdate\unins000.exe"'
    bms_app_uninstparm: /VERYSILENT
    bms_app_valid4os: '%BMS_OS4X86%,%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.exe|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%output_string%\%DIP_SUBDIR%'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%output_string%\DEV'

- Processor: EndOfCheckPhase
