Comment: For the ARCH_TYPE variable use "windows" for EXE or windowsZip for ZIP
Description: Downloads the current release version of PyCharm.
Identifier: com.github.NickETH.recipes.download.PyCharm-Win64
ParentRecipe: com.github.NickETH.recipes.download.JetBrains-Win64
MinimumVersion: 1.3.1

Input:
  NAME: PyCharm
  ARCH_TYPE: windows
  FILE_TYPE: exe
  PROD_CODE: PCP
