Description: Downloads the latest version of Scribus.
Identifier: com.github.NickETH.recipes.download.Scribus-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Scribus
  # https://sourceforge.net/projects/scribus/files/scribus-devel/
  # https://sourceforge.net/projects/scribus/files/scribus-devel/1.5.8/scribus-1.5.8-windows-x64.exe/download
  #SEARCH_URL: https://sourceforge.net/projects/scribus/rss?path=/scribus-devel
  SEARCH_URL: https://sourceforge.net/projects/scribus/rss?path=/scribus
  #SEARCH_PATTERN: (?P<url>https://sourceforge.net/projects/scribus/files/scribus-devel/(?P<version>.*?)/scribus-.*?-x64.exe/download)
  SEARCH_PATTERN: (?P<url>https://sourceforge.net/projects/scribus/files/scribus/(?P<version>.*?)/scribus-.*?-x64.exe/download)

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_PATTERN%'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.exe'
    url: '%url%'

- Processor: EndOfCheckPhase
