Description: Imports Scribus x64 to BMS
Identifier: com.github.NickETH.recipes.BMS.Scribus-Win64
ParentRecipe: com.github.NickETH.recipes.build.Scribus-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Scribus
  LONG_NAME: 'Scribus'
  VENDOR: 'The Scribus Team'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML
  DIP_NAME: Scribus
  DIP_SUBDIR: ML
  PROC_CHAR: '%'

Process:
- Processor: com.github.jazzace.processors/TextSearcher
  Arguments:
    text_in: '%versionminor%00'
    re_pattern: '[0-9]{2}'
    result_output_var_name: versionminunist

- Processor: com.github.homebysix-recipes.FindAndReplace/FindAndReplace
  Arguments:
    input_string: '%build_ver%'
    find: .
    replace: _

- Processor: FileCreator
  Comment: Generate the install.bds in the release dir.
  Arguments:
    file_content: |
      <?xml version="1.0" encoding="ISO-8859-1"?>
      <baramundiDeployScript Version="2220" LastChange="%us_date% %time%">
      <META>
      <INFO Vendor="" Name="" Version="" Author="Autopkg" Comment=""/>
      <STATICVARS LoadInstallIni="1">
      <BMSVars></BMSVars>
      </STATICVARS>
      </META>
      <ACTIONS>
      <ACTION type="SetX64Mode" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <MODE>1</MODE>
      </DATA>
      </ACTION>
      <ACTION type="LaunchProcess" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <COMMAND>{DIP}&#92;Apl&#92;%DIP_NAME%&#92;%output_string%&#92;%DIP_SUBDIR%&#92;%NAME%%PF_STRING%_%build_ver%_ML.exe</COMMAND>
      <PARAM>/S</PARAM>
      <RETURNCODES>0</RETURNCODES>
      <VARNAME></VARNAME>
      <PIDVARNAME></PIDVARNAME>
      <OPTIONS>1</OPTIONS>
      </DATA>
      </ACTION>
      <ACTION type="DeleteFiles" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <NAME>C:&#92;Users&#92;Public&#92;Desktop&#92;%NAME% %build_ver%.lnk</NAME>
      </DATA>
      </ACTION>
      <ACTION type="DeleteFiles" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <NAME>{&#37;ALLUSERSPROFILE&#37;}&#92;Microsoft&#92;Windows&#92;Start Menu&#92;Programs&#92;%NAME% %build_ver%&#92;Uninstall.lnk</NAME>
      </DATA>
      </ACTION>
      </ACTIONS>
      </baramundiDeployScript>
    file_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\release\i_%NAME%%PF_STRING%_%build_ver%.bds'

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,1641,3010\r\nDeinstall.CheckAppRC=0,1605,1641,3010"
    bms_app_installbds: '{DIP}\Apl\%DIP_NAME%\%output_string%\%DIP_SUBDIR%\i_%NAME%%PF_STRING%_%build_ver%.bds'
    bms_app_integration:
    - appname: '%NAME%'
      currentversion:
        job: '@_nV_%NAME% - Update (DYN)'
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: job
      jobs:
      - action: add
        name: '@_nV_%NAME% - Update (DYN)'
        version: new
      - action: changetype
        name: '@_nV_%NAME% - Update (DYN)'
        version: previous
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    bms_app_sharepoint:
    - SW-List-Name: '%NAME%'
      versionplatformtag: '%build_ver% ML (%PLATFORM%)'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_name: '%NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: '{%PROC_CHAR%ProgramW6432%PROC_CHAR%}\%NAME% %build_ver%\uninst.exe'
    #c:\Program Files\Scribus 1.5.8\uninst.exe
    bms_app_uninstparm: /S
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (x64)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\release\*.*|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%output_string%\%DIP_SUBDIR%'
    icon_file_src: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\icons\*.*'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    read_file_src_dest: '%BUILD_DIR%\%NAME%%PF_STRING%_%version%_ML\read\*-%NAME%%PF_STRING%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%output_string%\DEV'

- Processor: EndOfCheckPhase
