Description: Alters latest iTunes Client x64 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.iTunes-Win64
ParentRecipe: com.github.NickETH.recipes.download.iTunes-Win
MinimumVersion: 1.3.1

Input:
  NAME: iTunes
  PF_SHORT: '64'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    create_AS_ver: 'True'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%%LANG_STRING%'
    rename_var: pkg_dir

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-%version%-%PLATFORM%.exe'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-%version%-%PLATFORM%.exe'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'
    extract_file: '@%BUILD_DIR%\%pkg_dir%\helpers\iTunes%PF_SHORT%-files.txt'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Comment: Get the version from Bonjour%PF_SHORT%.msi into msi_value
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductVersion'
    msi_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Bonjour%PF_SHORT%.msi'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%msi_value%'
    rename_var: BJ_version

- Processor: Copier
  Comment: Copy the Bonjour64.msi to the release folder
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\Bonjour%PF_SHORT%_%BJ_version%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Bonjour%PF_SHORT%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Comment: Get the version from AppleMobileDeviceSupport%PF_SHORT%.msi into msi_value
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductVersion'
    msi_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\AppleMobileDeviceSupport%PF_SHORT%.msi'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%msi_value%'
    rename_var: AMDS_version

- Processor: Copier
  Comment: Copy the AppleMobileDeviceSupport64.msi to the release folder
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\AppleMobileDeviceSupport%PF_SHORT%_%AMDS_version%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\AppleMobileDeviceSupport%PF_SHORT%.msi'

- Processor: Copier
  Comment: Copy the iTunes.msi to the release folder
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%NAME%%PF_SHORT%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Comment: Get the version from iTunes64.msi into msi_value
  Arguments:
    SQL_command: SELECT `File`.`File` FROM `File`, `Component`, `Directory` WHERE `File`.`Component_` = `Component`.`Component` AND `Directory`.`Directory` = `Component`.`Directory_` AND `DefaultDir`='tajvqtga|de.lproj' AND `FileName`='License.rtf'
    msi_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\iTunes%PF_SHORT%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\iTunes%PF_SHORT%.msi'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\helpers'
    extract_file: '%msi_value%'

- Processor: com.github.NickETH.recipes.SharedProcessors/TextFileSearcher
  Comment: Searches the german License.rtf file in iTunes.msi for the EULA string
  Arguments:
    file_to_open: '%BUILD_DIR%\%pkg_dir%\helpers\%msi_value%'
    re_pattern: \\cf2.(?P<eulastring>[EA]{2}[0-9]{4})\\cf2

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Applies the Settings-Transform to the iTunes.msi to the release folder
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    mst_paths: '%BUILD_DIR%\%pkg_dir%\helpers\iTunes%PF_SHORT%-Settings.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Comment: Change a few settings in the iTunes MSI-file
  Arguments:
    SQL_command:
    - UPDATE `Property` SET `Property`.`Value`='iTunes %version% ML' WHERE `Property`.`Property`='ProductName'
    - UPDATE `Registry` SET `Registry`.`Value`='%AS_ver%' WHERE `Registry`.`Registry`='RegHKLM2'
    - UPDATE `Registry` SET `Registry`.`Value`='%matchstring%' WHERE `Registry`.`Registry`='RegHKLM7'
    - UPDATE `caPackage` SET `caPackage`.`FileName`='AppleMobileDeviceSupport%PF_SHORT%_%AMDS_version%%LANG_STRING%.msi' WHERE `caPackage`.`PackageKey`='AppleMobileDeviceSupport'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: iTunes x64 %version% ML
      /o: Version %version% for ETHZ ID. %us_date% by AutoPkg
      /p: x64;1033
      /t: iTunes x64 %version% ML
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIDbWorker
  Comment: Extract language transforms from the iTunes MSI-file
  Arguments:
    mode: -w
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    workfile: '1031'
    workfolder: '%BUILD_DIR%\%pkg_dir%\helpers'

- Processor: Copier
  Comment: Make a copy from iTunes.msi to the helpers folder to apply the language transform
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\helpers\%NAME%%PF_STRING%_1031.msi'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Apply the language transforms to the iTunes MSI copy
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%pkg_dir%\helpers\%NAME%%PF_STRING%_1031.msi'
    mst_paths: '%BUILD_DIR%\%pkg_dir%\helpers\1031'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Comment: Get the product GUID from iTunes64.msi into msi_value
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Comment: Put the original product GUID into the transformed iTunes MSI-file
  Arguments:
    SQL_command:
    - UPDATE `Property` SET `Property`.`Value`='%msi_value%' WHERE `Property`.`Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\helpers\%NAME%%PF_STRING%_1031.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Generate a new 1031 language transform from the iTunes MSI-file and the copy
  Arguments:
    mode: -g
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    msi_path_new: '%BUILD_DIR%\%pkg_dir%\helpers\%NAME%%PF_STRING%_1031.msi'
    mst_paths: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\1031'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIDbWorker
  Comment: Delete the existing 1031 language transforms from the iTunes MSI-file
  Arguments:
    mode: -j
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    workfile: '1031'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIDbWorker
  Comment: Embed the altered 1031 language transforms into the iTunes MSI-file
  Arguments:
    mode: -r
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    workfile: '1031'
    workfolder: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Comment: Change a few settings in the Bonjour64 MSI-file
  Arguments:
    SQL_command:
    - UPDATE `ServiceInstall` SET `ServiceInstall`.`StartType`=4 WHERE `ServiceInstall`.`ServiceInstall`='Bonjour_Service'
    - UPDATE `ServiceControl` SET `ServiceControl`.`Event`=162 WHERE `ServiceControl`.`ServiceControl`='Bonjour_Service'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\Bonjour%PF_SHORT%_%BJ_version%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: Bonjour x64 %BJ_version% ML
      /o: Version %BJ_version% for ETHZ ID. %us_date% by AutoPkg
      /p: x64;1033
      /t: Bonjour x64 %BJ_version% ML
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\Bonjour%PF_SHORT%_%BJ_version%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Comment: Change a few settings in the AppleMobileDeviceSupport64 MSI-file
  Arguments:
    SQL_command:
    - INSERT INTO `Property` (`Property`.`Property`,`Property`.`Value`) VALUES ('REBOOT','ReallySuppress')
    - UPDATE `InstallExecuteSequence` SET `InstallExecuteSequence`.`Sequence`='1450' WHERE `InstallExecuteSequence`.`Action`='RemoveExistingProducts'
    - DELETE FROM `LaunchCondition` WHERE `LaunchCondition`.`Condition`='NOT BNEWERPRODUCTISINSTALLED'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AppleMobileDeviceSupport%PF_SHORT%_%AMDS_version%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: Apple Mobile Device Support x64 %AMDS_version% ML
      /o: Version %AMDS_version% for ETHZ ID. %us_date% by AutoPkg
      /p: x64;1033
      /t: Apple Mobile Device Support x64 %AMDS_version% ML
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AppleMobileDeviceSupport%PF_SHORT%_%AMDS_version%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+(\.[0-9]+)?'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+(\.[0-9]+)?'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    # source_app: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    msi_icon_name: 'iTunes.ico'
    composite_uninstall_path: '%ICON_PATH%/Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%/Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%/Icon-Install-%NAME%.png'

- Processor: EndOfCheckPhase
