<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports SecureCRT to BMS (QSS/PRD)</string>
    <key>Identifier</key>
    <string>ch.ethz.gitlab.id-cd-win.BMS.SecureCRT-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SecureCRT</string>
        <key>PLATFORM</key>
        <string>x64</string>
        <key>LIC_TRANSFORM</key>
        <string>SecureCRT-Lic2305_IDNET.mst</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
    <string>ch.ethz.gitlab.id-cd-win.build.SecureCRT-Win64</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIRunSQLget</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\%NAME%_64_%build_ver%_EN.msi</string>
                <key>SQL_command</key>
                <string>SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.homebysix-recipes.FindAndReplace/FindAndReplace</string>
            <key>Arguments</key>
            <dict>
                <key>input_string</key>
                <string>%build_ver%</string>
                <key>find</key>
                <string>.</string>
                <key>replace</key>
                <string>_</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/BMSImporter</string>
            <key>Comment</key>
            <string>Import the Application into Baramundi (BMS) QSS</string>
            <key>Arguments</key>
            <dict>
                <key>bms_serverurl</key>
                <string>id-bms-qss-01.d.ethz.ch</string>
                <key>bms_serverport</key>
                <string>40443</string>
                <key>bms_CM_entry</key>
                <string>AutoPKG-BMSImporter</string>
                <key>bms_username</key>
                <string>D\winpkg</string>
                <key>bms_app_comment</key>
                <string>ID-NET: 40 Lizenzen
Imported by: AutoPkg, %us_date% %time%</string>
                <key>bms_app_name</key>
                <string>SecureCRT</string>
                <key>bms_app_vendor</key>
                <string>VanDyke Software</string>
                <key>bms_app_parentid</key>
                <string>4F1C2606-53ED-4968-80BC-E5CED0BEF3B3</string>
                <key>bms_app_version</key>
                <string>%build_ver% EN (x64) (ID-NET)</string>
                <key>bms_app_valid4os</key>
                <string>Windows7_x64,Windows8_x64,Windows10_x64,Windows11_x64,WindowsServer2008R2_x64,WindowsServer2012_x64,WindowsServer2016_x64,WindowsServer2019_x64,WindowsServer2022_x64</string>
                <key>bms_app_seccont</key>
                <string>LocalSystem</string>
                <key>bms_app_installcmd</key>
                <string>{DIP}\Apl\SecureCRT\%output_string%\EN\SecureCRT_64_%build_ver%_EN.msi</string>
                <key>bms_app_installparm</key>
                <string>/qn /norestart ALLUSERS=1 TRANSFORMS=%LIC_TRANSFORM%</string>
                <key>bms_app_conschecks</key>
                <string>CheckAppRC=0,3010
Deinstall.CheckAppRC=0,1605,3010</string>
                <key>bms_app_iopt_copylocal</key>
                <string>true</string>
                <key>bms_app_iopt_usebbt</key>
                <true/>
                <key>bms_app_iopt_reinstall</key>
                <string>false</string>
                <key>bms_app_iopt_rebootbhv</key>
                <string>NoReboot</string>
                <key>bms_app_category</key>
                <string>baramundi Application</string>
                <key>bms_app_uninstcmd</key>
                <string>msiexec.exe</string>
                <key>bms_app_uninstparm</key>
                <string>/x %msi_value% /qn</string>
                <key>inst_file_src_dest</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\*.ms?|\\d\sys\bms_tst\CUSTOMERS\ID-KW\Apl\SecureCRT\%output_string%\EN</string>
                <key>read_file_src_dest</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\*-SecureCRT_64_%build_ver%_EN.txt|\\d\sys\bms_tst\CUSTOMERS\ID-KW\Apl\SecureCRT\%output_string%\DEV</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/BMSImporter</string>
            <key>Comment</key>
            <string>Import the Application into Baramundi (BMS) PRD</string>
            <key>Arguments</key>
            <dict>
                <key>bms_serverurl</key>
                <string>id-bms-prd-01.d.ethz.ch</string>
                <key>bms_serverport</key>
                <string>40443</string>
                <key>bms_CM_entry</key>
                <string>AutoPKG-BMSImporter</string>
                <key>bms_username</key>
                <string>D\winpkg</string>
                <key>bms_app_comment</key>
                <string>ID-NET: 40 Lizenzen
Imported by: AutoPkg, %us_date% %time%</string>
                <key>bms_app_name</key>
                <string>SecureCRT</string>
                <key>bms_app_vendor</key>
                <string>VanDyke Software</string>
                <key>bms_app_parentid</key>
                <string>00F09F1C-ED96-4D43-A43B-1A0FB1E5C8FF</string>
                <key>bms_app_version</key>
                <string>%build_ver% EN (x64) (ID-NET)</string>
                <key>bms_app_valid4os</key>
                <string>Windows7_x64,Windows8_x64,Windows10_x64,Windows11_x64,WindowsServer2008R2_x64,WindowsServer2012_x64,WindowsServer2016_x64,WindowsServer2019_x64,WindowsServer2022_x64</string>
                <key>bms_app_seccont</key>
                <string>LocalSystem</string>
                <key>bms_app_installcmd</key>
                <string>{DIP}\Apl\SecureCRT\%output_string%\EN\SecureCRT_64_%build_ver%_EN.msi</string>
                <key>bms_app_installparm</key>
                <string>/qn /norestart ALLUSERS=1 TRANSFORMS=%LIC_TRANSFORM%</string>
                <key>bms_app_conschecks</key>
                <string>CheckAppRC=0,3010
Deinstall.CheckAppRC=0,1605,3010</string>
                <key>bms_app_iopt_copylocal</key>
                <string>true</string>
                <key>bms_app_iopt_usebbt</key>
                <true/>
                <key>bms_app_iopt_reinstall</key>
                <string>false</string>
                <key>bms_app_iopt_rebootbhv</key>
                <string>NoReboot</string>
                <key>bms_app_category</key>
                <string>baramundi Application</string>
                <key>bms_app_uninstcmd</key>
                <string>msiexec.exe</string>
                <key>bms_app_uninstparm</key>
                <string>/x %msi_value% /qn</string>
                <key>inst_file_src_dest</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\*.ms?|\\d\sys\bms_prd\CUSTOMERS\ID-KW\Apl\SecureCRT\%output_string%\EN</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
