Description: Alters latest PyMOL installer x64 for Windows.
Identifier: com.github.NickETH.recipes.build.PyMOL-Win64
ParentRecipe: com.github.NickETH.recipes.download.PyMOL-Win64
MinimumVersion: 1.3.1

Input:
  NAME: PyMOL
  VENDOR: 'Schrodinger, Inc.'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _EN

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/WinPEVersionExtractor
  Arguments:
    exe_path: '%pathname%'
    product_version: True

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: release:read
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%%LANG_STRING%'
    rename_var: pkg_dir

- Processor: Copier
  Arguments:
    overwrite: 'true'
    source_path: '%pathname%'
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.exe'
 
# - Processor: com.github.NickETH.recipes.SharedProcessors/NSISEditor
  # Comment: Extract the PyMOL installer
  # Arguments:
    # nsis_path: '%pathname%'
    # workfolder: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'
    # ignore_errors: False

# - Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  # Arguments:
    # input_string: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'
    # pattern_replace:
    # - pattern: \\
      # repl: /
 
# - Processor: URLTextSearcher
  # Arguments:
    # # WriteRegStr SHCTX "SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall\PyMOL 3.0.4 (Python 3.10.14 64-bit)" DisplayName "PyMOL 3.0.4 (Python 3.10.14 64-bit)"
    # re_pattern: 'WriteRegStr.*?SHCTX.*?SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Uninstall\\(?P<UNINSTKEY>PyMOL.*?)"\sDisplayName\s"(?P<DISPNAME>PyMOL.+?)"'
    # url: 'file://%parsed_string%/\[NSIS\].nsi'

# - Processor: URLTextSearcher
  # Arguments:

    # # WriteRegStr SHCTX "SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall\PyMOL 3.0.4 (Python 3.10.14 64-bit)" Publisher "Schrodinger, Inc."
    # re_pattern: 'WriteRegStr.*?SHCTX.*?SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Uninstall\\PyMOL.*?"\sPublisher\s"(?P<PUBLINAME>Sch.+?)"'
    # url: 'file://%parsed_string%/\[NSIS\].nsi'

# - Processor: URLTextSearcher
  # Arguments:

    # # WriteRegStr SHCTX "SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall\PyMOL 3.1.6.1 (Python 3.10.18 64-bit)" DisplayVersion 3.1.6.1
    # re_pattern: 'WriteRegStr.*?SHCTX.*?SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Uninstall\\PyMOL.*?"\sDisplayVersion (?P<APPVERSION>([0-9]+\.)*[0-9]+)'
    # url: 'file://%parsed_string%/\[NSIS\].nsi'
    
- Processor: com.github.haircut.processors/AppIconExtractor
  Comment: Generate Icon files for the Kiosk from Telegraf
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%pathname%'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\Create-log-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: EndOfCheckPhase
