Description: Download recipe for Tenable Nessus Agent x64.
Identifier: com.github.NickETH.recipes.download.Nessus-Agent-Win64
MinimumVersion: 1.3.1

Input:
  NAME: NessusAgent
  URL: https://www.tenable.com/downloads/nessus-agents?loginAttempted=true
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '"id":([\d]*)(?=,"file":"NessusAgent-[\d\.]*\-x64.msi)'
    result_output_var_name: download_id
    url: '%URL%'

- Processor: URLTextSearcher
  Arguments:
    re_pattern: NessusAgent-([\d\.]*)\-x64.msi
    result_output_var_name: version
    url: '%URL%'

- Processor: com.github.NickETH.recipes.SharedProcessors/TextFileSearcher
  Arguments:
    file_to_open: '%RECIPE_CACHE_DIR%\downloads\version.txt'
    re_pattern: '[\d\.]*'
    result_output_var_name: version_exists

- Processor: StopProcessingIf
  Arguments:
    predicate: version == version_exists

- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: true
    filename: '%NAME%-x64.msi'
    url: https://www.tenable.com/downloads/api/v1/public/pages/nessus-agents/downloads/%download_id%/download?i_agree_to_tenable_license_agreement=true

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: FileCreator
  Comment: Generate the version.txt in the release dir.
  Arguments:
    file_content: '%version%'
    file_path: '%RECIPE_CACHE_DIR%\downloads\version.txt'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN="TENABLE, INC.", O="TENABLE, INC.", L=Columbia, S=Maryland, C=US, SERIALNUMBER=3569085, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Delaware, OID.1.3.6.1.4.1.311.60.2.1.3=US
    input_path: '%pathname%'

- Processor: EndOfCheckPhase
