Description: Alters latest QGIS x64 Install-file for Windows.
Identifier: com.github.NickETH.recipes.build.QGIS-Win64
ParentRecipe: com.github.NickETH.recipes.download.QGIS-Win64
MinimumVersion: 1.3.1

Input:
  NAME: QGIS
  VENDOR: osgeo.org
  VENDOR_LONG: 'OpenSource Geospatial Foundation (OSGeo)'
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to store the package
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: helpers:sourceunzipped:release:read
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%version%_ML'
    rename_var: pkg_dir

# - Processor: Copier
  # Comment: Copy the MSI-file to the sourceunzipped dir
  # Arguments:
    # destination_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%NAME%%PF_STRING%_%version%_raw.msi'
    # overwrite: 'true'
    # source_path: '%pathname%'

- Processor: Copier
  Comment: Copy the MSI-file to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%_ML.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

# - Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  # Comment: Applies the transforms to the MSI-file in the release folder
  # Arguments:
    # mode: -a
    # msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%_ML.msi'
    # mst_paths:
    # - '%BUILD_DIR%\%pkg_dir%\helpers\KPXC-UserSettings-02.mst'

# - Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  # Arguments:
    # cmnds_sinfo:
      # /j: KeePassXC %version%
      # /o: Slightely altered (AutoUpdate disabled). %us_date% by AutoPkg
      # /t: KeePassXC %version%
    # msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%_ML.msi'
    
- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\helpers\qgis-icon-512x512.png'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: EndOfCheckPhase
