Description: Downloads the latest TeXstudio for Windows x64.
Identifier: com.github.NickETH.recipes.download.TexStudio-Win64
MinimumVersion: 1.3.1

Input:
  NAME: TeXstudio

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: texstudio-[0-9\.]+-win-qt6\.exe
    github_repo: texstudio-org/texstudio

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.exe'

- Processor: EndOfCheckPhase
