Description: Package the latest Telegraf x64 Install for Windows.
Identifier: com.github.NickETH.recipes.build.Telegraf-Win64
ParentRecipe: com.github.NickETH.recipes.download.Telegraf-Win64
MinimumVersion: 1.3.1

Input:
  NAME: 'Telegraf'
  VENDOR: InfluxData
  VENDOR_LONG: 'InfluxData Inc.'
  PLATFORM: x64
  PF_STRING: _64
  USER_AGENT: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:81.0) Gecko/20100101 Firefox/81.0
  SEARCH_URL: https://github.com/influxdata/telegraf/releases
  LANG_STRING: _ML

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to build the MSI with Wix
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    create_AS_ver: 'True'
    folder_list: sourcepkt:sourceunzipped:release:icons:read:helpers:wixproject:wixproject\Includes:wixproject\Resources:wixproject\Lang
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%_ML'
    rename_var: pkg_dir

- Processor: Copier
  Comment: Copy the Telegraf installer files to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the autopkg zip archive
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    # extract_dir: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'False'

- Processor: Copier
  Comment: Copy the Telegraf conf file to the wix project dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\wixproject\telegraf.conf'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\telegraf.conf'
 
- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN="InfluxData, Inc", O="InfluxData, Inc", L=San Francisco, S=California, C=US
    input_path: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\%NAME%.exe'

- Processor: com.github.haircut.processors/AppIconExtractor
  Comment: Generate Icon files for the Kiosk from Telegraf
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\%NAME%.exe'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/ResourceWorker
  Comment: Extract the Telegraf res file
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\%NAME%.exe'
    output_file: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Icon-%NAME%.res'
    reswork_action: 'extract'
    reswork_cmd: 'ICONGROUP,,'
    # ignore_errors: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/ResourceWorker
  Comment: Generate a new Icon.exe file for Telegraf
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\helpers\Icon-Stub-1.exe'
    input_file: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Icon-%NAME%.res'
    output_file: '%BUILD_DIR%\%pkg_dir%\wixproject\Resources\Main-Icon.exe'
    reswork_action: 'add'
    reswork_cmd: 'ICONGROUP,,'
    # ignore_errors: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/WixSettings
  Comment: Define variables for the WIX build process to the version.wxi file
  Arguments:
    preproc_file: '%BUILD_DIR%\%pkg_dir%\wixproject\version.wxi'
    # template_file: None
    new_settings:
    - define: 'version="%build_ver%"'
    - define: 'ProductVersion="%build_ver%"'
    - define: 'Packagecode="{NNEEWWGGUUIIDD}"'
    - define: 'Productcode="{NNEEWWGGUUIIDD}"'
    - define: 'ProductName="!(loc.ProductName)"'
    - define: 'ProductNameWithVersion="!(loc.ProductName) $(var.version) $(var.Arch)"'
    - define: 'ProductLanguage="!(loc.ProductLanguage)"'
    - define: 'AppName="%NAME%"'
    - define: 'AppFolder="$(var.APInstallFolder)"'
    - define: 'AppVendor="%VENDOR%"'
    - define: 'ProductManufacturerShort="%VENDOR%"'
    - define: 'ProductUpgradeCode="{EE9187FE-30AC-47CB-8A86-74718042FD52}"'
    - define: 'ProductManufacturerLong="%VENDOR_LONG%"'
    - define: 'RTMProductVersion="0.0.1"'
  
- Processor: com.github.NickETH.recipes.SharedProcessors/MSBuildRun
  Comment: Run the MSBuild script to generate the Telegraf MSI installer
  Arguments:
    build_file: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%.build'
    build_folder: '%BUILD_DIR%\%pkg_dir%\wixproject'
    build_property: BuildPlatform=%PLATFORM%;BuildName=%NAME%;BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;SourceDir=%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%;version=%build_ver%;Platformstr=%PF_STRING%;LangStr=%LANG_STRING%
    build_target: WIX

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Comment: Change a few settings in the AppleMobileDeviceSupport64 MSI-file
  Arguments:
    SQL_command:
    - DELETE FROM `MsiFileHash` WHERE `MsiFileHash`.`File_`='extern.telegraf.conf'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'