Description: Download recipe for the Telegraf Agent.
Identifier: com.github.NickETH.recipes.download.Telegraf-Win64
MinimumVersion: 1.3.1

Input:
  NAME: 'Telegraf'
  VENDOR: InfluxData
  PLATFORM: x64
  PF_STRING: _64
  USER_AGENT: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:81.0) Gecko/20100101 Firefox/81.0
  SEARCH_URL: https://github.com/influxdata/telegraf/releases

Process:
- Processor: URLTextSearcher
  Arguments:
    # curl_opts:
    # - -I
    re_pattern: (https://dl.influxdata.com/telegraf/releases/telegraf.(?P<version>([0-9]+\.)*[0-9]+).windows.amd64.zip)
    #re_pattern: https://dl.influxdata.com/telegraf/releases/telegraf.1.28.2.windows.amd64.zip
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    #version: '%parsed_string%'
    filename: '%NAME%%PLATFORM%.zip'
    request_headers:
      user-agent: '%USER_AGENT%'
    url: '%match%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
