Description: Download recipe for VMware VMRC
Identifier: com.github.NickETH.recipes.download.VMwareVMRC-Win
MinimumVersion: 1.3.1

Input:
  NAME: VMwareVMRC
  PLATFORM: x86

Process:
- Processor: VMwareVMRCURLProvider
  Arguments:
    product_name: vmrc-windows.xml

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.zip.tar'
    CHECK_FILESIZE_ONLY: True

- Processor: EndOfCheckPhase
