Description: Download recipe for WinSCP.
Identifier: com.github.NickETH.recipes.download.WinSCP-Win
MinimumVersion: 1.3.1

Input:
  NAME: WinSCP
  URL: https://winscp.net/eng/download.php
  SF_DL_SRV: netix
  PLATFORM: x86
  PF_STRING: ''

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: (?P<filetosearch>WinSCP-(?P<version>([0-9]+\.)*[0-9]+)-Setup\.exe?)
    url: '%URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.exe'
    url: https://%SF_DL_SRV%.dl.sourceforge.net/project/winscp/WinSCP/%version%/WinSCP-%version%-Setup.exe

- Processor: EndOfCheckPhase

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Martin Prikryl, O=Martin Prikryl, L=Prague, C=CZ, SERIALNUMBER=87331519, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.3=CZ
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False
