Description: Download recipe for the GLPI-Agent.
Identifier: com.github.NickETH.recipes.download.GLPI-Agent-Win64
MinimumVersion: 1.3.1

Input:
  NAME: 'GLPI-Agent'
  VENDOR: Teclib
  PLATFORM: x64
  PF_STRING: _64
  USER_AGENT: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:81.0) Gecko/20100101 Firefox/81.0

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    # https://github.com/glpi-project/glpi-agent/releases/download/1.5/GLPI-Agent-1.5-x64.msi
    # asset_regex: arduino-ide_(?P<finalversion>([0-9]+\.)*[0-9]+)_Windows_64bit\.msi
    asset_regex: GLPI-Agent-[0-9\.]+-x64\.msi
    github_repo: glpi-project/glpi-agent
    include_prereleases: false

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%version%'
    pattern_replace:
    - pattern: '-'
      repl: '.'

- Processor: URLDownloader
  Arguments:
    version: '%parsed_string%'
    filename: '%NAME%.msi'
    request_headers:
      user-agent: '%USER_AGENT%'
    url: '%url%'

# - Processor: WindowsSignatureVerifier
  # Arguments:
    # expected_subject: CN= S=Ticino, C=CH
    # input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
