Description: Download recipe for OBS-Studio x64.
Identifier: com.github.NickETH.recipes.download.OBS-Studio-Win64
MinimumVersion: 1.3.1

Input:
  NAME: OBS-Studio
  URL: https://obsproject.com
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: OBS-Studio-([0-9]+\.)*[0-9]+-Full-Installer-x64\.exe
    github_repo: obsproject/obs-studio

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-x64.exe'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Hugh Bailey, O=Hugh Bailey, L=Temecula, S=California, C=US
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False
