Description: Imports Lenovo System Update to BMS
Identifier: com.github.NickETH.recipes.BMS.ThinkpadSystemUpdate-Win
ParentRecipe: com.github.NickETH.recipes.build.ThinkpadSystemUpdate-Win
MinimumVersion: 1.3.1

Input:
  NAME: ThinkpadSystemUpdate
  NAMESHORT: 'System_update'
  NAMELONG: 'Thinkpad System Update'
  VENDOR: Lenovo
  PLATFORM: x86
  PF_STRING: ''
  LANG_STRING: _ML
  DIP_NAME: ThinkPad_SystemUpdate
  DIP_SUBDIR: ML

Process:
- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: /SP- /VERYSILENT /NORESTART /LOG="{TTEEMMPP}\i_sysupd_%build_ver%.log"
    rename_var: inst_param

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%inst_param%'
    pattern_replace:
    - pattern: TTEEMMPP
      repl: '%TEMP%'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%parsed_string%'
    rename_var: inst_param

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\%NAMESHORT%_%build_ver%%LANG_STRING%.exe'
    bms_app_installparm: '%inst_param%'
    bms_app_integration:
    - appname: '%NAME%'
      bundles:
      - action: exchange
        name: nV_ThinkPad System Update
      - action: add
        name: aV_ThinkPad System Update Uninstall
        version: new
      - action: add
        name: oV_ThinkPad System Update Uninstall
        version: previous
      currentversion:
        bundle: nV_ThinkPad System Update
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    bms_app_iopt_copylocal: 'false'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'true'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAMELONG%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: '"C:\Program Files (x86)\%VENDOR%\System Update\unins000.exe"'
    bms_app_uninstparm: /SILENT
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%,%BMS_OS4X86%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.*|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\DEV'    
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'

- Processor: EndOfCheckPhase
