Description: Download recipe for Lenovo Thinkpad-SystemUpdate.
Identifier: com.github.NickETH.recipes.download.ThinkpadSystemUpdate-Win
MinimumVersion: 1.3.1

Input:
  NAME: ThinkpadSystemUpdate
  # <SourcePath>UTS/SystemUpdate50802-2023-08-15.exe</SourcePath>
  # SEARCH_URL: <SourcePath>UTS/(?P<dl_exe>SystemUpdate.*.exe)</SourcePath>
  # <Version>5.08.02.25</Version>
  SEARCH_URL: <Version>(?P<version>([0-9]+\.)*[0-9]+)</Version>
  #"URL":"https://download.lenovo.com/pccbbs/thinkvantage_en/systemupdate_5.08.03.47.exe","
  
  
  #SEARCH_URL: '"URL":"(https://download.lenovo.com/pccbbs/thinkvantage_en/systemupdate_(?P<version>([0-9]+\.)*[0-9]+).exe)",'
  SEARCH_VER: <Version>(?P<major_minor>[0-9]+\.[0-9]+).*</Version>

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_URL%'
    url: https://download.lenovo.com/ibmdl/pub/pc/pccbbs/agent/SSClientCommon/UTS/executables.xml
    # url: https://datacentersupport.lenovo.com/us/en/downloads/ds012808

- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: false
    filename: '%NAME%.exe'
    # url: '%match%'
    url: 'https://download.lenovo.com/pccbbs/thinkvantage_en/system_update_%version%.exe'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Lenovo, O=Lenovo, L=Morrisville, S=North Carolina, C=US
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
