Description: Downloads latest Mindmanager x86/x64 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.download.MindManager-Win
MinimumVersion: 1.3.1

Input:
  NAME: MindManager
  DOWNLOAD_URL: https://www.mindmanager.com/mm-win-exe
  USER_AGENT: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:81.0) Gecko/20100101 Firefox/81.0
  PLATFORM: Win64
  PF_DIGIT: '32'

Process:
- Processor: URLDownloader
  Comment: Get the installer stub.
  Arguments:
    filename: MindManager_Stub.exe
    url: '%DOWNLOAD_URL%'

- Processor: StopProcessingIf
  Comment: Uses the Python eval function, looking at download_changed
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: 'Get the installparams.js file from the stub. It contains the path to the JS file, with actual download URL. '
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%RECIPE_CACHE_DIR%\downloads'
    extract_file: installparams.js
    preserve_paths: 'False'
    recursive: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/TextFileSearcher
  Comment: Searches the installparams.js file for the actual path to the installerlistMMDxxx.js
  Arguments:
    file_to_open: '%RECIPE_CACHE_DIR%\downloads\installparams.js'
    #"https://dkmivjis4azh9.cloudfront.net/Builds/MindManager231/installerlistMMD231.js"
    re_pattern: https:\/\/.*?\.cloudfront\.net\/Builds\/.*?\.js

- Processor: URLTextSearcher
  Comment: Searches the installerlistMMDxxx.js for the actual download URL of the MSI. We als extract the version
  Arguments:
    #"url": "https://dkmivjis4azh9.cloudfront.net/Builds/MindManager231/23_1_243/64Bit/MindManager 23.msi",
    re_pattern: '"url": "(?P<MSI_DL_LINK>https://.*?.cloudfront.net/Builds/MindManager.*?\/(?P<versionraw>[_\d]*)\/%PF_DIGIT%Bit\/.*?\.msi)'
    url: '%match%'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%MSI_DL_LINK%'
    pattern_replace:
    - pattern: ' '
      repl: '%20'

- Processor: URLDownloader
  Arguments:
    filename: MindManager_%PF_DIGIT%_raw.msi
    request_headers:
      user-agent: '%USER_AGENT%'
    url: '%parsed_string%'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Corel Corporation, O=Corel Corporation, L=Ottawa, S=Ontario, C=CA
    input_path: '%pathname%'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%versionraw%'
    pattern_replace:
    - pattern: _
      repl: .

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%parsed_string%'
    rename_var: version

- Processor: EndOfCheckPhase
