Description: Imports 7-Zip x64 to BMS
Identifier: com.github.NickETH.recipes.BMS.7-Zip-Win64
ParentRecipe: com.github.NickETH.recipes.build.7-Zip-Win64
MinimumVersion: 1.3.1

Input:
  NAME: 7-Zip
  VENDOR: Igor Pavlov
  PLATFORM: x64
  PF_STRING: _64
  SEARCH_URL_MSI: (?P<msi_dl_link>https://sourceforge\.net/projects/sevenzip/files/7-Zip/(?P<version>[0-9]+\.[0-9]+)/7z[0-9]+-x64\.msi/download)

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\7_Zip\%parsed_string%\ML\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1
    bms_app_integration:
    - appname: %NAME%
      bundles:
      - action: exchange
        name: nV_%NAME%
      - action: add
        name: aV_%NAME% Uninstall
        version: new
      - action: add
        name: oV_%NAME% Uninstall
        version: previous
      currentversion:
        bundle: nV_%NAME%
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML' 
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: %NAME%
    bms_app_parentid: 4F1C2606-53ED-4968-80BC-E5CED0BEF3B3
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn
    bms_app_valid4os: Windows7_x64,Windows8_x64,Windows10_x64,WindowsServer2008R2_x64,WindowsServer2012_x64,WindowsServer2016_x64,WindowsServer2019_x64
    bms_app_vendor: %VENDOR%
    bms_app_version: '%build_ver% ML (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.ms?|%BMS_IMPORT_PATH_TST%\7_Zip\%parsed_string%\ML%PF_STRING%'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\7_Zip\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
