Description: Downloads the latest XnView installer package for Windows.
Identifier: com.github.NickETH.recipes.download.XnView-Win
MinimumVersion: 1.3.1

Input:
  NAME: XnView
  PLATFORM: x86
  PF_STRING: ''
  USER_AGENT: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:81.0) Gecko/20100101 Firefox/81.0

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.exe'
    request_headers:
      user-agent: '%USER_AGENT%'
    url: https://download.xnview.com/XnView-win-full.exe

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=GOUGELET PIERRE-EMMANUEL, O=GOUGELET PIERRE-EMMANUEL, L=Betheny, C=FR
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
