Description: Imports XnViewMP x64 full to BMS
Identifier: com.github.NickETH.recipes.BMS.XnViewMP-Win64
ParentRecipe: com.github.NickETH.recipes.build.XnViewMP-Win64
MinimumVersion: 1.3.1

Input:
  NAME: XnViewMP
  VENDOR: 'Pierre Gougelet'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML
  DIP_NAME: XnViewMP
  DIP_SUBDIR: ML

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: AppName=(?P<DISPNAME>XnView.+)
    url: 'file://D:/AutoPkg/Build/%NAME%%PF_STRING%_%build_ver%%LANG_STRING%/sourceunzipped/install_script.iss'

- Processor: URLTextSearcher
  Arguments:
    re_pattern: AppPublisher=(?P<APPVENDOR>Pierre.+)
    url: 'file://D:/AutoPkg/Build/%NAME%%PF_STRING%_%build_ver%%LANG_STRING%/sourceunzipped/install_script.iss'

- Processor: URLTextSearcher
  Arguments:
    re_pattern: AppId=(?P<APPIDNAME>XnView.+)
    url: 'file://D:/AutoPkg/Build/%NAME%%PF_STRING%_%build_ver%%LANG_STRING%/sourceunzipped/install_script.iss'

- Processor: URLTextSearcher
  Arguments:
    re_pattern: AppVersion=(?P<APPVERSION>.+)
    url: 'file://D:/AutoPkg/Build/%NAME%%PF_STRING%_%build_ver%%LANG_STRING%/sourceunzipped/install_script.iss'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: |
      <?xml version="1.0" encoding="ISO-8859-1"?>
      <baramundiDeployScript Version="2420" LastChange="ddaatteettiimmee">
      <META>
      <INFO Vendor="" Name="" Version="" Author="Autopkg" Comment=""/>
      <STATICVARS LoadInstallIni="1">
      <BMSVars></BMSVars>
      </STATICVARS>
      </META>
      <ACTIONS>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="1" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>Install-/Uninstall-Script for %APPIDNAME% (Inno-Setup)</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="SetX64Mode" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <MODE>1</MODE>
      </DATA>
      </ACTION>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="1" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>###   INSTALL   ###</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="Conditional" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      </DATA>
      <CONDITION op1="{Mode}" op="MATCHES" op2="Install" options="0"/>
      </ACTION>
      <ACTION type="Comment" level="1" breakpoint="0" ignore_error="0" comment="1" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>Installs the software</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="LaunchProcess" level="2" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <COMMAND>{DIP}&#92;Apl&#92;XnViewMP&#92;SSuubbssttiittuuttee.exe</COMMAND>
      <PARAM>/ALLUSERS /NORESTART /TYPE=&quot;full&quot; /MERGETASKS=&quot;!desktopicon,!quicklaunchicon&quot; /LOG /SP- /SUPPRESSMSGBOXES /VERYSILENT</PARAM>
      <RETURNCODES>0</RETURNCODES>
      <VARNAME></VARNAME>
      <PIDVARNAME></PIDVARNAME>
      <OPTIONS>1</OPTIONS>
      </DATA>
      </ACTION>
      <ACTION type="CreateFile" level="2" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <FILENAME>{&#37;ProgramFiles&#37;}\XnViewMP\XnView.ini</FILENAME>
      <ENCODING>0</ENCODING>
      <CONTENT>[Start]
      CheckFreq=0</CONTENT>
      <OPTIONS>1</OPTIONS>
      </DATA>
      </ACTION>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="1" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>###   UNINSTALL   ###</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="Conditional" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      </DATA>
      <CONDITION op1="{Mode}" op="MATCHES" op2="Deinstall" options="0"/>
      </ACTION>
      <ACTION type="Comment" level="1" breakpoint="0" ignore_error="0" comment="1" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>Removes the software</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="SetVar" level="2" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VARNAME>AppUninstallString</VARNAME>
      <VALUE>0</VALUE>
      <OPTIONS>0</OPTIONS>
      </DATA>
      </ACTION>
      <ACTION type="EvalVar" level="2" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VARNAME>AppUninstallString</VARNAME>
      <SOURCE>Registry</SOURCE>
      <OPTIONS>0</OPTIONS>
      <Properties><PropertyEntry><Param>Key</Param><Value>SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall\%APPIDNAME%_is1</Value></PropertyEntry><PropertyEntry><Param>Registry</Param><Value>HKEY_LOCAL_MACHINE</Value></PropertyEntry><PropertyEntry><Param>Value</Param><Value>UninstallString</Value></PropertyEntry></Properties></DATA>
      </ACTION>
      <ACTION type="EvalVar" level="2" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VARNAME>AppUninstallLocation</VARNAME>
      <SOURCE>Registry</SOURCE>
      <OPTIONS>0</OPTIONS>
      <Properties><PropertyEntry><Param>Key</Param><Value>SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall\%APPIDNAME%_is1</Value></PropertyEntry><PropertyEntry><Param>Registry</Param><Value>HKEY_LOCAL_MACHINE</Value></PropertyEntry><PropertyEntry><Param>Value</Param><Value>Inno Setup: App Path</Value></PropertyEntry></Properties></DATA>
      </ACTION>
      <ACTION type="LaunchProcess" level="2" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <COMMAND>{AppUninstallString}</COMMAND>
      <PARAM>/VERYSILENT /NORESTART</PARAM>
      <RETURNCODES>0</RETURNCODES>
      <VARNAME></VARNAME>
      <PIDVARNAME></PIDVARNAME>
      <OPTIONS>3</OPTIONS>
      </DATA>
      <CONDITION op1="{AppUninstallString}" op="DOESNOTMATCH" op2="NOTFOUND" options="0"/>
      </ACTION>
      </ACTIONS>
      </baramundiDeployScript>
    rename_var: bds_content

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%bds_content%'
    pattern_replace:
    - pattern: SSuubbssttiittuuttee
      repl: '%parsed_string%&#92;ML&#92;%NAME%%PF_STRING%_%build_ver%%LANG_STRING%'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%parsed_string%'
    #input_string: '%bds_content%'
    pattern_replace:
    - pattern: ddaatteettiimmee
      repl: '%us_date% %time%'

- Processor: FileCreator
  Comment: Generate the install.bds in the release dir.
  Arguments:
    file_content: '%parsed_string%'
    file_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%.bds'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installbds: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\%NAME%%PF_STRING%_%build_ver%.bds'
    bms_app_localfilecopy:
    - '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\~~~FolderWithSubFolders'
    bms_app_integration:
    - appname: '%NAME%'
      bundles:
      - action: exchange
        name: nV_%NAME%
      - action: add
        name: aV_%NAME% Uninstall
        version: new
      - action: add
        name: oV_%NAME% Uninstall
        version: previous
      copyfolders: 1
      currentversion:
        bundle: nV_%NAME%
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML'
        type: bundles
      platform: '(%PLATFORM%)'
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
      SWDetectionRules:
      - Name: '%DISPNAME%'
        Vendor: "%APPVENDOR%"
        Version: '%APPVERSION%'
        Language: 'en'
        PathType: '2'
        RegKey: '%APPIDNAME%_is1'
        ApplyMode: '0'
        Category: 'baramundi Application'
        Comments: ''
    bms_app_sharepoint:
    - SW-List-Name: '%NAME%'
      versionplatformtag: '%build_ver% ML (%PLATFORM%)'
    bms_job_kiosk:
    - jobname: '%NAME%'
      # substring: 'Taskkill'
      # jobdescription: 'XnView is an image organizer and general-purpose file manager used for viewing, converting, organizing and editing raster images.'
      # autoenableapp: '%NAME% - Enable AutoUpdate'
      # autoreleasejob: '@_AU-Rel_%NAME%'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstbds: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\u_%NAME%%PF_STRING%_%build_ver%.bds'
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.*|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    icon_file_src: '%BUILD_DIR%\%pkg_dir%\icons\*.*'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
