Description: Downloads latest Firefox (x86/x64) offline installer for Windows.
Identifier: com.github.NickETH.recipes.download.Firefox-Win
MinimumVersion: 1.3.1

Input:
  NAME: Firefox
  VENDOR: Mozilla

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-Setup-%PLATFORM_STR%.exe'
    url: '%SEARCH_URL%'

- Processor: URLTextSearcher
  Arguments:
    curl_opts:
    - -I
    re_pattern: Firefox%20Setup%20(([0-9]+\.)*[0-9]+)
    url: '%SEARCH_URL%'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%match%'
    rename_var: version

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Mozilla Corporation, OU=Firefox Engineering Operations, O=Mozilla Corporation, L=Mountain View, S=California, C=US
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%\prev_version.txt'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\version.txt'

- Processor: FileCreator
  Arguments:
    file_content: '%version%'
    file_path: '%RECIPE_CACHE_DIR%\version.txt'

- Processor: EndOfCheckPhase
