Description: Builds latest Firefox ESR x64 for Windows.
Identifier: com.github.NickETH.recipes.build.FirefoxESR-Win64
ParentRecipe: com.github.NickETH.recipes.download.Firefox-Win
MinimumVersion: 1.3.1

Input:
  NAME: FirefoxESR
  PLATFORM: x64
  VENDOR: 'Mozilla'
  PF_STRING: _64
  LANG_STRING: _ML
  PLATFORM_STR: x64
  # SEARCH_URL: https://download.mozilla.org/?product=firefox-latest&amp;os=win64&amp;lang=en-US
  SEARCH_URL: https://download.mozilla.org/?product=firefox-esr-latest&os=win64&lang=en-US
  DOWNLOAD_URL: https://download.mozilla.org/?product=firefox-esr-latest&os=win64&lang=en-US

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_cache_dir: '%RECIPE_CACHE_DIR%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%%LANG_STRING%'
    rename_var: pkg_dir

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9][0-9]\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9][0-9]\.[0-9]+\.[0-9]+'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-Setup-%PLATFORM_STR%.exe'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.exe'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MozillaAddonIntegrator
  Comment: Integrate Addons into the install. Enable Sideloading in omni.ja
  Arguments:
    app_build_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'
    application_name: Mozilla Firefox
    config_file_path: modules\AppConstants.sys.mjs
    ext_install_path: '%BUILD_DIR%\%pkg_dir%\release'
    install_exe: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-Setup-%PLATFORM_STR%.exe'
    new_extensions:
    - de.xpi|||https://ftp.mozilla.org/pub/firefox/releases/%version%esr/win64/xpi/de.xpi
    - fr.xpi|||https://ftp.mozilla.org/pub/firefox/releases/%version%esr/win64/xpi/fr.xpi
    - it.xpi|||https://ftp.mozilla.org/pub/firefox/releases/%version%esr/win64/xpi/it.xpi
    - rm.xpi|||https://ftp.mozilla.org/pub/firefox/releases/%version%esr/win64/xpi/rm.xpi
    - dict-ch.xpi|||https://addons.mozilla.org/firefox/downloads/latest/german-dictionary-de_ch-for-sp/
    - dict-de.xpi|||https://addons.mozilla.org/firefox/downloads/latest/german-dictionary-de_de-for-sp/
    - dict-fr.xpi|||https://addons.mozilla.org/firefox/downloads/file/3581786/
    - dict-it.xpi|||https://addons.mozilla.org/firefox/downloads/latest/dizionario-italiano/
    - dict-us.xpi|||https://addons.mozilla.org/firefox/downloads/file/4175230/
    - dict-gb.xpi|||https://addons.mozilla.org/firefox/downloads/file/4568898/
    #- noscript.xpi|||https://addons.mozilla.org/firefox/downloads/latest/noscript/|||ExtNoscriptFiles
    #- adblock.xpi|||https://addons.mozilla.org/firefox/downloads/latest/adblock-plus/|||ExtAdblockFiles
    omni_path: omni.ja
    temp_path: '%BUILD_DIR%\%pkg_dir%\adm'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Mozilla Firefox\firefox.exe'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: EndOfCheckPhase
