Description: Builds latest Thunderbird x64 to an MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.Thunderbird-Win64
ParentRecipe: com.github.NickETH.recipes.download.Thunderbird-Win
MinimumVersion: 1.3.1

Input:
  NAME: Thunderbird_64
  SEARCH_URL: https://www.thunderbird.net/en-US/thunderbird/releases/
  DOWNLOAD_URL: https://download.mozilla.org/?product=thunderbird-91.13.0-SSL&os=win64&lang=en-US
  PLATFORM_STR: '64'
  MAJOR_REL: '115'

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    PrevVerFiles: PrevVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers:wixproject
    org_ver: '%version%'
    pkg_dir: Thunderbird_64_::VVeerrssiioonn::_ML
    recipe_cache_dir: '%RECIPE_CACHE_DIR%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: Thunderbird_64_%build_ver%_ML
    rename_var: pkg_dir

- Processor: com.github.NickETH.recipes.SharedProcessors/WixDefaults
  Arguments:
    build_dir: '%BUILD_DIR%\%pkg_dir%'
    build_ver: '%build_ver%'
    org_ver: '%version%'
    prop_file: wixproject\global.prop

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-Thunderbird_64_%build_ver%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9][0-9]\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-Thunderbird_64_%build_ver%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9][0-9]\.[0-9]+\.[0-9]+'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-Setup-%PLATFORM_STR%.exe'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MozillaAddonIntegrator
  Comment: Integrate Addons into the install. Enable Sideloading in omni.ja
  Arguments:
    app_build_path: '%BUILD_DIR%\%pkg_dir%\wixproject'
    application_name: Mozilla Thunderbird
    config_file_path: modules\AppConstants.sys.mjs
    ext_install_path: '%BUILD_DIR%\%pkg_dir%\wixproject\Mozilla Thunderbird\extensions'
    ext_install_xslt: '%BUILD_DIR%\%pkg_dir%\wixproject\GUID-Preserve-x64.xslt'
    install_exe: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-Setup-%PLATFORM_STR%.exe'
    new_extensions:
    - de.xpi|||https://releases.mozilla.org/pub/thunderbird/releases/%version%%ESR_STRING%/linux-x86_64/xpi/de.xpi|||ExtlpDEFiles
    - fr.xpi|||https://releases.mozilla.org/pub/thunderbird/releases/%version%%ESR_STRING%/linux-x86_64/xpi/fr.xpi|||ExtlpFRFiles
    - it.xpi|||https://releases.mozilla.org/pub/thunderbird/releases/%version%%ESR_STRING%/linux-x86_64/xpi/it.xpi|||ExtlpITFiles
    - rm.xpi|||https://releases.mozilla.org/pub/thunderbird/releases/%version%%ESR_STRING%/linux-x86_64/xpi/rm.xpi|||ExtlpRMFiles
    - dict-de.xpi|||https://addons.mozilla.org/firefox/downloads/latest/german-dictionary-de_ch-for-sp/|||ExtdicDEFiles
    - dict-fr.xpi|||https://addons.mozilla.org/firefox/downloads/file/3581786/|||ExtdicFRFiles
    - dict-it.xpi|||https://addons.mozilla.org/firefox/downloads/latest/dizionario-italiano/|||ExtdicITFiles
    - tbsync.xpi|||https://addons.thunderbird.net/thunderbird/downloads/latest/tbsync/addon-773590-latest.xpi|||ExtTBSyncFiles
    - dav-4-tbsync.xpi|||https://addons.thunderbird.net/thunderbird/downloads/latest/dav-4-tbsync/addon-986258-latest.xpi|||ExtDAV4TBSyncFiles
    - google-4-tbsync.xpi|||https://addons.thunderbird.net/thunderbird/downloads/latest/provider-for-google-calendar/addon-4631-latest.xpi|||ExtGoogle4TBSyncFiles
    - eas-4-tbsync.xpi|||https://addons.thunderbird.net/thunderbird/downloads/latest/eas-4-tbsync/addon-986338-latest.xpi|||ExtEAS4TBSyncFiles
    - CompactHeader.xpi|||https://addons.thunderbird.net/thunderbird/downloads/latest/compact-headers/addon-987783-latest.xpi|||ExtCompactHeaderFiles
    - LookOut.xpi|||https://addons.thunderbird.net/thunderbird/downloads/latest/lookout-fix-version/addon-711780-latest.xpi|||ExtLookOutFiles
    omni_path: omni.ja
    temp_path: '%BUILD_DIR%\%pkg_dir%\adm'
    #- sieve.xpi|||https://polybox.ethz.ch/index.php/s/G6e4OKrKqIBk3LR/download|||ExtSieveFiles

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\wixproject\Mozilla Thunderbird\thunderbird.exe'
    # source_app: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/NANTrun
  Arguments:
    run_folder: '%BUILD_DIR%\%pkg_dir%\wixproject'

- Processor: EndOfCheckPhase
