Description: Downloads the latest release of TeraTerm x64 from Github.
Identifier: com.github.NickETH.recipes.download.TeraTerm-Win64
MinimumVersion: 1.3.1

Input:
  NAME: TeraTerm
  ASSET_REGEX: 'teraterm-.*?-x64\.exe'
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: '%ASSET_REGEX%'
    # https://github.com/freeplane/freeplane/releases/download/release-1.13.2/Freeplane-Setup-1.13.2.exe
    # https://github.com/TeraTermProject/teraterm/releases/download/v5.6.0/teraterm-5.6.0-x64.exe
    github_repo: TeraTermProject/teraterm
    include_prereleases: false

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.exe'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

# - Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  # Comment: Generate the final version string.
  # Arguments:
    # input_string: '%version%'
    # pattern_replace:
    # - pattern: 'release-'
      # repl: ''

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=SignPath Foundation, O=SignPath Foundation, L=Lewes, S=Delaware, C=US
    input_path: '%pathname%'
    
- Processor: EndOfCheckPhase
  # Arguments:
    # version: '%parsed_string%'
