Description: Download recipe for Git.
Identifier: com.github.NickETH.recipes.download.Git-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Git

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: Git-[0-9\.]+-64-bit\.exe
    github_repo: git-for-windows/git

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-x64.exe'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Johannes Schindelin, O=Johannes Schindelin, S=Nordrhein-Westfalen, C=DE
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
