Description: Package the current Github Desktop x64 release to an MSI-package.
Identifier: com.github.NickETH.recipes.build.GithubDesktop-Win64
ParentRecipe: com.github.NickETH.recipes.download.GithubDesktop-Win64
MinimumVersion: 1.3.1

Input:
  NAME: GithubDesktop
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/WinPEVersionExtractor
  Arguments:
    exe_path: '%pathname%'
    product_version: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to build the MSI with Wix
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    create_AS_ver: 'True'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers:wixproject:wixproject\%NAME%:wixproject\Includes:wixproject\Resources:wixproject\Lang
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%_ML'
    rename_var: pkg_dir

- Processor: Copier
  Comment: Copy the GithubDesktop installer file to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\downloads\%filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourcepkt\'
    extract_file: GithubDesktop-*-full.nupkg

- Processor: FileFinder
  Arguments:
    pattern: '%BUILD_DIR%\%pkg_dir%\sourcepkt\GithubDesktop-*-full.nupkg'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the autopkg zip archive
  Arguments:
    exe_path: '%found_filename%'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: Copier
  Comment: Copy the GithubDesktop installer file to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\wixproject\GithubDesktop\'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\lib\net45\'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/WixDefaults
  Comment: Set the actual version strings to the version.wxi file
  Arguments:
    build_dir: '%BUILD_DIR%\%pkg_dir%'
    build_ver: '%build_ver%'
    org_ver: '%build_ver%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSBuildRun
  Comment: Run the MSBuild script to generate the GithubDesktop MSI installer
  Arguments:
    build_file: '%BUILD_DIR%\%pkg_dir%\wixproject\GithubDesktop.build'
    build_folder: '%BUILD_DIR%\%pkg_dir%\wixproject'
    build_property: BuildPlatform=%PLATFORM%;BuildName=%NAME%;BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;SourceDir=%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%;version=%build_ver%
    build_target: WIX
