Description: Downloads the latest Github Desktop Matrix Client for Windows x64.
Identifier: com.github.NickETH.recipes.download.GithubDesktop-Win64
MinimumVersion: 1.3.1

Input:
  NAME: GithubDesktop
  DOWNLOAD_URL: https://central.github.com/deployments/desktop/desktop/latest/win32

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.exe'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN="GitHub, Inc.", O="GitHub, Inc.", L=San Francisco, S=California, C=US
    input_path: '%pathname%'
