Description: Downloads the latest version of TortoiseGit x64 for Windows.
Identifier: com.github.NickETH.recipes.download.TortoiseGit-Win64
MinimumVersion: 1.3.1

Input:
  NAME: TortoiseGit
  VENDOR: 'tortoisegit.org'
  PLATFORM: x64
  PF_STRING: _64
  SEARCH_URL: https://tortoisegit.org/download/
  # href="//download.tortoisegit.org/tgit/2.15.0.0/TortoiseGit-2.15.0.0-64bit.msi
  # https://download.tortoisegit.org/tgit/2.15.0.0/TortoiseGit-LanguagePack-2.15.0.0-64bit-de.msi
  SEARCH_STR: (//download\.tortoisegit\.org/tgit/(?P<major_version>([0-9]+\.)*[0-9]+)/TortoiseGit-(?P<version>([0-9]+\.)*[0-9]+)-64bit.msi)
  USER_AGENT: Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; AS; rv:11.0) like Gecko

Process:
- Processor: URLTextSearcher
  Comment: Get the exact path from the download page.
  Arguments:
    re_pattern: '%SEARCH_STR%'
    # request_headers:
      # user-agent: '%USER_AGENT%'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.msi'
    #curl_opts:
    #- -H 'Referer: %match%'
    # request_headers:
      # user-agent: '%USER_AGENT%'
      # referer: '%match%'
    url: 'https:%match%'

- Processor: WindowsSignatureVerifier
  Comment: Check the signature on the downloaded file
  Arguments:
    MAIN_PATH: '%pathname%'
    expected_subject: CN="Open Source Developer, Sven Strickroth", O=Open Source Developer, S=Bayern, C=DE
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_de_%PLATFORM%.msi'
    url: 'https://download.tortoisegit.org/tgit/%major_version%/TortoiseGit-LanguagePack-%major_version%-64bit-de.msi'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_it_%PLATFORM%.msi'
    url: 'https://download.tortoisegit.org/tgit/%major_version%/TortoiseGit-LanguagePack-%major_version%-64bit-it.msi'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_fr_%PLATFORM%.msi'
    url: 'https://download.tortoisegit.org/tgit/%major_version%/TortoiseGit-LanguagePack-%major_version%-64bit-fr.msi'

- Processor: EndOfCheckPhase
