Description: Downloads the latest version of TortoiseGit x64 for Windows.
Identifier: com.github.NickETH.recipes.download.TortoiseGit-Win64
MinimumVersion: 1.3.1

Input:
  NAME: TortoiseGit
  VENDOR: 'tortoisegit.org'
  PLATFORM: x64
  PF_STRING: _64
  SEARCH_URL: https://tortoisegit.org/download/
  SEARCH_URL_PLUG: 'https://www.heise.de/download/product/irfanview-plugins-73737/download'
  # href="//download.tortoisegit.org/tgit/2.15.0.0/TortoiseGit-2.15.0.0-64bit.msi
  # https://download.tortoisegit.org/tgit/2.15.0.0/TortoiseGit-LanguagePack-2.15.0.0-64bit-de.msi
  # VERSION_URL: href="(//download\.tortoisegit\.org/tgit/([0-9]+\.)*[0-9]+/TortoiseGit-(?P<version>([0-9]+\.)*[0-9]+)-64bit\.msi)"
  VERSION_URL: (//download\.tortoisegit\.org/tgit/([0-9]+\.)*[0-9]+/TortoiseGit-(?P<version>([0-9]+\.)*[0-9]+)-64bit.msi)
  USER_AGENT: Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; AS; rv:11.0) like Gecko

Process:
- Processor: URLTextSearcher
  Comment: Get the exact path from the download page.
  Arguments:
    re_pattern: '%VERSION_URL%'
    # request_headers:
      # user-agent: '%USER_AGENT%'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.msi'
    #curl_opts:
    #- -H 'Referer: %match%'
    # request_headers:
      # user-agent: '%USER_AGENT%'
      # referer: '%match%'
    url: 'https:%match%'

- Processor: WindowsSignatureVerifier
  Comment: Check the signature on the downloaded file
  Arguments:
    MAIN_PATH: '%pathname%'
    expected_subject: E=mail@cs-ware.de, CN="Open Source Developer, Sven Strickroth", O=Open Source Developer, S=Bavaria, C=DE
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

# - Processor: com.github.NickETH.recipes.SharedProcessors/WinPEVersionExtractor
  # Arguments:
    # exe_file: '%filename%'
    # exe_path: '%pathname%'
    # product_version: 'True'

# - Processor: URLTextSearcher
  # Comment: Get the download page for the plugins.
  # Arguments:
    # # href="/download/product/irfanview-plugins-73737/download/danke?id=6af785c4-3ef1-4542-a9d2-10e1e25e4922" title="IrfanView PlugIns 4.67 64-Bit herunterladen
    # re_pattern: href="(?P<dlpart>/download/product/irfanview-plugins-73737/download/danke\?id=[-0-9a-f]*)" title="IrfanView PlugIns (?P<versionplug>[\.0-9]*) 64-Bit herunterladen
    # url: '%SEARCH_URL_PLUG%'

# - Processor: URLTextSearcher
  # Comment: Get the final download link for the plugins.
  # Arguments:
    # # url=https://download.heise.de/files/cwMkiNvLOEc_K2Brms0k7w/311233/iview467_plugins_x64_setup.exe?expires=1712789317">
    # re_pattern: url=(?P<dlfile>https://download.heise.de/files/[a-zA-Z0-9_]+?/[0-9]+?/iview[0-9]+?_plugins_x64_setup.exe\?expires=[0-9]+?)">
    # curl_opts:
    # - -L
    # url: 'https://www.heise.de/%dlpart%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_de_%PLATFORM%.msi'
    url: 'https://download.tortoisegit.org/tgit/%version%/TortoiseGit-LanguagePack-%version%-64bit-de.msi'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_it_%PLATFORM%.msi'
    url: 'https://download.tortoisegit.org/tgit/%version%/TortoiseGit-LanguagePack-%version%-64bit-it.msi'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_fr_%PLATFORM%.msi'
    url: 'https://download.tortoisegit.org/tgit/%version%/TortoiseGit-LanguagePack-%version%-64bit-fr.msi'

- Processor: EndOfCheckPhase
