Description: Imports Google Chrome x86 to BMS
Identifier: com.github.NickETH.recipes.BMS.GoogleChrome-Win
ParentRecipe: com.github.NickETH.recipes.build.GoogleChrome-Win
MinimumVersion: 1.3.1

Input:
  NAME: 'GoogleChrome'
  NAMESHORT: 'Chrome'
  NAMELONG: 'Google Chrome'
  VENDOR: Google
  PLATFORM: x86
  PF_STRING: ''
  LANG_STRING: _ML
  DIP_NAME: Chrome
  DIP_SUBDIR: ML_x86
  HOMEPAGE: 'https://your.homepage.com'

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%version%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1 ALLOWDOWNGRADE=1
    bms_app_integration:
    - appname: '%NAMESHORT%'
      bundles:
      - action: exchange
        name: nV_%NAMELONG%
      - action: add
        name: aV_%NAMELONG% Uninstall
        version: new
      - action: add
        name: oV_%NAMELONG% Uninstall
        version: previous
      copyfolders: 1
      currentversion:
        bundle: nV_%NAMELONG%
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    bms_app_sharepoint:
    - SW-List-Name: '%NAME%'
      versionplatformtag: '%build_ver% ML (x86 / x64)'
    bms_job_kiosk:
    - jobname: '%NAMELONG%'
      substring: 'Taskkill'
      jobdescription: 'Google Chrome ist ein Webbrowser von Google LLC. Er ist seit 2012 der weltweit am weitesten verbreitete Browser.'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAMESHORT%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn
    bms_app_valid4os: '%BMS_OS4X86%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.*|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    #icon_file_src: '%BUILD_DIR%\%pkg_dir%\icons\*.*'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
