Description: Downloads latest GoogleDrive File Stream for Windows.
Identifier: com.github.NickETH.recipes.download.GoogleDriveFS-Win
MinimumVersion: 1.3.1

Input:
  NAME: GoogleDriveFS
  DOWNLOAD_URL: https://dl.google.com/drive-file-stream/GoogleDriveFSSetup.exe

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.exe'
    url: '%DOWNLOAD_URL%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Google LLC, O=Google LLC, L=Mountain View, S=California, C=US
    input_path: '%pathname%'

- Processor: EndOfCheckPhase
