Description: Downloads the latest release of Greenshot x64 from Github.
Identifier: com.github.NickETH.recipes.download.Greenshot-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Greenshot
  ASSET_REGEX: 'Greenshot.*?\.exe'
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: '%ASSET_REGEX%'
    # https://github.com/greenshot/greenshot/releases/download/v1.3.277/Greenshot-INSTALLER-1.3.277-UNSTABLE.exe
    github_repo: greenshot/greenshot
    include_prereleases: false

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.exe'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
