Description: Package the current Python release.
Identifier: com.github.NickETH.recipes.build.Python-Win64
ParentRecipe: com.github.NickETH.recipes.download.Python-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Python
  URL: https://www.python.org/downloads/windows/
  PLATFORM: x64
  PF_STRING: _64
  LANG_STR: EN

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to store the package
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_%version%_%LANG_STR%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%_%LANG_STR%'
    rename_var: pkg_dir

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: Copier
  Comment: Copy the Python install exe file to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_%LANG_STR%.exe'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\helpers\python_256.ico'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_%LANG_STR%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_%LANG_STR%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'
