Description: Downloads the latest IBM Spectrum Protect installer package for Windows.
Identifier: com.github.NickETH.recipes.download.SpectrumProtect-Win64
MinimumVersion: 1.3.1

Input:
  NAME: SpectrumProtect
  VENDOR: IBM
  DOWNLOAD_URL: https://sp-repo.ethz.ch/win/
  SEARCH_FIRSTURL: https://nxlog.co/downloads/nxlog-ce#nxlog-community-edition
  SEARCH_REG: '(SP_CLIENT_(?P<version>([0-9.]+))_WIN_ML.exe)'

  PLATFORM: x64
  PF_STRING: _64
  
Process:
# - Processor: URLTextSearcher
  # Arguments:
    # re_pattern: (?s)((?P<partone>management/[patchesmin]+/client/v[0-9]r[0-9]/Windows/)[autodeployx64]+(?P<parttwo>/v[0-9]+/(?P<version>([0-9.]+))-TIV-TSMBAC-WinX64))\.exp(?!.*(v[0-9]r[0-9]/Windows/[autodeployx64]+/v[0-9]+/([0-9.]+)-TIV-TSMBAC-WinX64\.exp))
    # url: https://public.dhe.ibm.com/storage/tivoli-storage-management/catalog/client/catalog.json

- Processor: URLTextSearcher
  Arguments:
    #SP_CLIENT_8.1.21_WIN_ML.exe
    re_pattern: '%SEARCH_REG%'
    url: '%DOWNLOAD_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.exe'
    #url: https://public.dhe.ibm.com/storage/tivoli-storage-%partone%x64%parttwo%.exe
    url: '%DOWNLOAD_URL%%match%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
