Description: Package the current IrfanView x64 release to an MSI-package.
Identifier: com.github.NickETH.recipes.build.IrfanView-Win64
ParentRecipe: com.github.NickETH.recipes.download.IrfanView-Win64
MinimumVersion: 1.3.1

Input:
  NAME: IrfanView
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML
  EXE_NAME: 'i_view64.exe'

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/WinPEVersionExtractor
  Arguments:
    exe_path: '%pathname%'
    product_version: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to build the MSI with Wix
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    create_AS_ver: 'True'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers:wixproject:wixproject\%NAME%:wixproject\Includes:wixproject\Resources:wixproject\Lang:wixproject\Fragments
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%_ML'
    rename_var: pkg_dir

- Processor: Copier
  Comment: Copy the IrfanView installer file to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%exe_file%'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\downloads\%exe_file%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the IrfanView installer to the wixproject dir
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%exe_file%'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: Copier
  Comment: Copy the IrfanView plugins installer file to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\downloads\%filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the IrfanView plugins installer to the wixproject dir
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\Plugins'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_French_Lng.zip'
    url: 'https://www.irfanview.net/lang/irfanview_lang_french.zip'

- Processor: Copier
  Comment: Copy the IrfanView plugins installer file to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%_French_Lng.zip'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\downloads\%NAME%_French_Lng.zip'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the IrfanView plugins installer to the wixproject dir
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%_French_Lng.zip'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\Languages'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_Italian_Lng.zip'
    url: 'https://www.irfanview.net/lang/irfanview_lang_italian.zip'

- Processor: Copier
  Comment: Copy the IrfanView plugins installer file to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%_Italian_Lng.zip'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\downloads\%NAME%_Italian_Lng.zip'

- Processor: EndOfCheckPhase

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the IrfanView plugins installer to the wixproject dir
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%_Italian_Lng.zip'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\Languages'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

# - Processor: FileFinder
  # Arguments:
    # pattern: '%BUILD_DIR%\%pkg_dir%\sourcepkt\GithubDesktop-*-full.nupkg'

# - Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  # Comment: Extract the autopkg zip archive
  # Arguments:
    # exe_path: '%found_filename%'
    # extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'
    # extract_file: '*'
    # ignore_pattern: ''
    # preserve_paths: 'True'

# - Processor: Copier
  # Comment: Copy the IrfanView installer file to the build dir
  # Arguments:
    # destination_path: '%BUILD_DIR%\%pkg_dir%\wixproject\GithubDesktop\'
    # overwrite: 'true'
    # source_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\lib\net45\'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.haircut.processors/AppIconExtractor
  Comment: Generate the IrfanView icons for BMS Kiosk.
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\%EXE_NAME%'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/ResourceWorker
  Comment: Extract the IrfanView res file
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\%EXE_NAME%'
    output_file: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Icon-%NAME%.res'
    reswork_action: 'extract'
    reswork_cmd: 'ICONGROUP,,'
    # ignore_errors: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/ResourceWorker
  Comment: Generate a new Icon.exe file for IrfanView
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\helpers\Icon-Stub-1.exe'
    input_file: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Icon-%NAME%.res'
    output_file: '%BUILD_DIR%\%pkg_dir%\wixproject\Resources\Main-Icon.exe'
    reswork_action: 'add'
    reswork_cmd: 'ICONGROUP,,'
    # ignore_errors: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: create a version.txt file, if it does not exist
  Arguments:
    cmdline_args:
    - /C
    - type
    - nul
    - '>>'
    - user_view64.ini
    exe_file: 'cmd.exe'
    exe_folder: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%'

- Processor: com.github.NickETH.recipes.SharedProcessors/WixSettings
  Comment: Define variables for the WIX build process to the version.wxi file
  Arguments:
    preproc_file: '%BUILD_DIR%\%pkg_dir%\wixproject\version.wxi'
    # template_file: None
    new_settings:
    - define: 'version="%build_ver%"'
    - define: 'ProductVersion="%build_ver%"'
    - define: 'Packagecode="{NNEEWWGGUUIIDD}"'
    - define: 'Productcode="{NNEEWWGGUUIIDD}"'
    - define: 'ProductName="!(loc.ProductName)"'
    - define: 'ProductNameWithVersion="!(loc.ProductName) $(var.version) $(var.Arch)"'
    - define: 'ProductLanguage="!(loc.ProductLanguage)"'
    - define: 'AppName="%NAME%"'
    - define: 'ExeName="%EXE_NAME%"'
    - define: 'ExeGUID="{04BE9B2F-6143-412F-B058-4046F2C7A527}"'
    - define: 'AppFolder="$(var.APInstallFolder)"'
    - define: 'AppVendor="%VENDOR%"'
    - define: 'ProductManufacturerShort="%VENDOR%"'
    - define: 'ProductUpgradeCode="{DCD3A9FF-3B74-4737-B4FB-E4B2553AEE37}"'
    - define: 'ProductManufacturerLong="%VENDOR%"'
    - define: 'RTMProductVersion="0.0.1"'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSBuildRun
  Comment: Run the MSBuild script to generate the IrfanView MSI installer
  Arguments:
    build_file: '%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%.build'
    build_folder: '%BUILD_DIR%\%pkg_dir%\wixproject'
    build_property: BuildPlatform=%PLATFORM%;BuildName=%NAME%;BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;SourceDir=%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%;version=%build_ver%;Platformstr=%PF_STRING%;LangStr=%LANG_STRING%
    build_target: WIX
