Description: Downloads the latest version of IrfanView x64 for Windows.
Identifier: com.github.NickETH.recipes.download.IrfanView-Win64
MinimumVersion: 1.3.1

Input:
  NAME: IrfanView
  VENDOR: 'Irfan Skiljan'
  PLATFORM: x64
  PF_STRING: _64
  SEARCH_URL: https://www.irfanview.com/64bit.htm
  #SEARCH_URL_PLUG: 'https://www.heise.de/download/product/irfanview-plugins-73737/download'
  SEARCH_URL_PLUG: 'https://www.techspot.com/downloads/472-irfanview-plugins.html'
  # <a href="https://www.irfanview.info/files/iview466g_x64.zip" class="alt-download">Download von IrfanView-64</a> iview466_x64_setup.exe
  VERSION_URL: (https://www.irfanview.info/files/iview(?P<versionraw>[0-9]+)g_x64_setup\.exe)
  #Mozilla/5.0 (Windows NT x.y; Win64; x64; rv:10.0) Gecko/20100101 Firefox/10.0
  USER_AGENT: Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:11.0) like Gecko

Process:
- Processor: URLTextSearcher
  Comment: Get the exact path from the download page.
  Arguments:
    re_pattern: '%VERSION_URL%'
    request_headers:
      user-agent: '%USER_AGENT%'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.exe'
    #curl_opts:
    #- -H 'Referer: %match%'
    request_headers:
      user-agent: '%USER_AGENT%'
      referer: '%match%'
    url: '%match%'

- Processor: WindowsSignatureVerifier
  Comment: Check the signature on the downloaded file
  Arguments:
    MAIN_PATH: '%pathname%'
    expected_subject: CN=Irfan Skiljan, O=Irfan Skiljan, S=Lower Austria, C=AT
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/WinPEVersionExtractor
  Arguments:
    exe_file: '%filename%'
    exe_path: '%pathname%'
    product_version: 'True'

- Processor: URLTextSearcher
  Comment: Get the download page for the plugins.
  Arguments:
    #re_pattern: href="(?P<dlpart>/download/product/irfanview-plugins-73737/download/danke\?id=[-0-9a-f]*)" title="IrfanView PlugIns (?P<versionplug>[\.0-9]*) 64-Bit herunterladen
    re_pattern: <a href="(?P<dlpart>/downloads/downloadnow/472/\?evp=[0-9a-f]+&file=[0-9]*).*?\s.+?Installer.64.+?</a>
    url: '%SEARCH_URL_PLUG%'
    curl_opts:
    - -L
    #re_flags: DOTALL

- Processor: URLTextSearcher
  Comment: Get the final download link for the plugins.
  Arguments:
    # url=https://download.heise.de/files/cwMkiNvLOEc_K2Brms0k7w/311233/iview467_plugins_x64_setup.exe?expires=1712789317">
    #re_pattern: url=(?P<dlfile>https://download.heise.de/files/[a-zA-Z0-9_]+?/[0-9]+?/iview[0-9]+?_plugins_x64_setup.exe\?expires=[0-9]+?)">
    re_pattern: '<a href="(?P<dlfile>/downloads/downloadnowfile/472/\?evp=[-0-9a-f]*?&file=[0-9]*?)".*?Click here.*?</a>'
    curl_opts:
    - -L
    #url: 'https://www.heise.de/%dlpart%'
    url: 'https://www.techspot.com%dlpart%'

- Processor: URLDownloader
  Arguments:
    # version: '%versionbuild%'
    filename: '%NAME%_Plugins_%PLATFORM%.exe'
    #url: '%dlfile%'
    url: 'https://www.techspot.com%dlfile%'
    curl_opts:
    - -L

- Processor: EndOfCheckPhase
