Description: Downloads the latest FileZilla installer for Windows.
Identifier: com.github.NickETH.recipes.download.FileZilla-Win64
MinimumVersion: 1.3.1

Input:
  NAME: FileZilla
  USER_AGENT: Mozilla/5.0 (Windows NT 6.3; Win64, x64; Trident/7.0; rv:11.0) like Gecko
  # SEARCH_URL: https://filezilla-project.org/download.php?show_all=1
  SEARCH_URL: https://filezilla-project.org/download.php?type=client
  # https://download.filezilla-project.org/client/FileZilla_3.69.1_win64_sponsored2-setup.exe
  # SEARCH_PATTERN: (https.*client/FileZilla_(?P<version>([0-9]+\.)*[0-9]+)_win64-setup.exe.*)"\srel="nofollow"
  SEARCH_PATTERN: (https.*client/FileZilla_(?P<version>([0-9]+\.)*[0-9]+)_win64_sponsored2-setup.exe.*)"\srel="nofollow"

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_PATTERN%'
    result_output_var_name: match
    url: '%SEARCH_URL%'
    request_headers:
      user-agent: '%USER_AGENT%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.exe'
    url: '%match%'
    request_headers:
      user-agent: '%USER_AGENT%'

- Processor: EndOfCheckPhase
