Description: Imports WhatsApp Desktop for Windows x64 MSIX to BMS
Identifier: com.github.NickETH.recipes.BMS.WhatsAppDesktop-Win64
ParentRecipe: com.github.NickETH.recipes.build.WhatsAppDesktop-Win64
MinimumVersion: 1.3.1

Input:
  NAME: WhatsAppDesktop
  NAMESHORT: WhatsApp
  VENDOR: 'WhatsApp Inc.'
  PF_STRING: _64
  LANG_STRING: _ML
  PLATFORM: x64
  DIP_NAME: WhatsApp
  DIP_SUBDIR: ML

Process:
- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BDSGenerator
  Comment: Create a new baramundi deploy script (BDS) file.
  Arguments:
    BDS_file: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%.bds'
    new_actions:
    - ACTION: 'type: Comment |||comment: 1'
      DATA:
        VALUE: 'Define path to BMAcmd.exe'
    - ACTION: 'type: SetVar ||| level: 0'
      DATA:
        VARNAME: $var_Path2BMAcmd
        VALUE: '{BMAPath}\BMACmd.exe'
        OPTIONS: 0
    - ACTION: 'type: SetVar ||| level: 0'
      DATA:
        VARNAME: InstallFilesFilter
        VALUE: '*.???x'
        OPTIONS: 0
    - ACTION: 'type: SetX64Mode'
      DATA:
        MODE: 1      
    - ACTION: 'type: Comment'
      DATA:
        VALUE: '###   INSTALL   ###'
    - ACTION: 'type: Conditional'
      DATA: ''
      CONDITION:
        op1: "{Mode}"
        op: "MATCHES"
        op2: "Install"
        options: "0"
    - ACTION: 'type: Comment ||| level: 1 ||| comment: 1'
      DATA:
        VALUE: 'Install the Appx/Msix Files'      
    - ACTION: 'type: RunEmbeddedScript ||| level: 1'
      DATA:
        SCRIPTLANGUAGE: PowerShell
        RETURNCODES: "0"
        VARNAME: ""
        SCRIPT:  |
          [String]$ScriptPath = &quot;{Script}&quot;

          $ScriptName = Split-Path -Path $ScriptPath -Leaf
          $InstallDir = Split-Path -Path $ScriptPath -Parent

          &amp; &quot;{$var_Path2BMAcmd}&quot; /Cmd:Log /Type:/1 /Text:&quot;###  BEGIN bDS Script [$ScriptName]   ###&quot;

          $Files2Install = Get-ChildItem $InstallDir -Name -Filter {InstallFilesFilter}

          foreach ($f2i in $Files2Install) {
             Add-AppProvisionedPackage -online -packagepath (Join-Path -Path $InstallDir -ChildPath $f2i) -skiplicense
             &amp; &quot;{$var_Path2BMAcmd}&quot; /Cmd:Log /Type:/1 /Text:&quot;Installed [$f2i]&quot;
          }
          &amp; &quot;{$var_Path2BMAcmd}&quot; /Cmd:Log /Type:/1 /Text:&quot;###  END bDS Script [$ScriptName]   ###&quot;
        HIDDENEXECUTION: "1"      
    - ACTION: 'type: Comment |||comment: 1'
      DATA:
        VALUE: '###   UNINSTALL   ###'
    - ACTION: 'type: Conditional'
      DATA: ''
      CONDITION:
        op1: "{Mode}"
        op: "MATCHES"
        op2: "Deinstall"
        options: "0"
    - ACTION: 'type: Comment ||| level: 1 |||comment: 1'
      DATA:
        VALUE: 'Remove the Appx/Msix Files'
    - ACTION: 'type: RunEmbeddedScript ||| level: 1'
      DATA:
        SCRIPTLANGUAGE: PowerShell
        RETURNCODES: "0"
        VARNAME: ""
        SCRIPT:  |
          [String]$ScriptPath = &quot;{Script}&quot;
          $ScriptName = Split-Path -Path $ScriptPath -Leaf

          &amp; &quot;{$var_Path2BMAcmd}&quot; /Cmd:Log /Type:/1 /Text:&quot;###  BEGIN bDS Script [$ScriptName]   ###&quot;

          get-appxpackage -allusers 5319275A.WhatsAppDesktop | Remove-AppPackage -AllUsers
          &amp; &quot;{$var_Path2BMAcmd}&quot; /Cmd:Log /Type:/1 /Text:&quot;WhatsAppDesktop Removed [WhatsAppDesktop]&quot;

          &amp; &quot;{$var_Path2BMAcmd}&quot; /Cmd:Log /Type:/1 /Text:&quot;###  END bDS Script [$ScriptName]   ###&quot;
        HIDDENEXECUTION: "1" 

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installbds: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\%NAME%%PF_STRING%_%build_ver%.bds'
    bms_app_localfilecopy:
    - '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\~~~FolderWithSubFolders'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstbds: '{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\%NAME%%PF_STRING%_%build_ver%.bds'
    bms_app_uopt_rebootbhv: NoReboot
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    bms_app_integration:
    - appname: '%NAME%'
      bundles:
      - action: exchange
        name: 'nV_%NAME%'
      - action: add
        name: aV_%NAME% Uninstall
        version: new
      - action: add
        name: oV_%NAME% Uninstall
        version: previous
      currentversion:
        bundle: 'nV_%NAME%'
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    bms_app_sharepoint:
    - SW-List-Name: '%NAME%'
      versionplatformtag: '%build_ver% ML (%PLATFORM%)'   
    bms_job_kiosk:
    - jobname: '%NAME%'
      substring: 'Taskkill'
      jobdescription: 'Mit WhatsApp Desktop können alle Funktionen von WhatsApp (Textnachrichten, Bild-, Video- und Ton-Dateien, Dokumente und Kontaktdaten und Video-Telefonie) auf Windows verwendet werden.'
      autoenableapp: '%NAME% - Enable AutoUpdate'
      autoreleasejob: '@_AU-Rel_%NAME%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.*|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%'
    icon_file_src: '%BUILD_DIR%\%pkg_dir%\icons\*.*'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
