Description: Download recipe for TreeSize Free.
Identifier: com.github.NickETH.recipes.download.TreeSizeFree-Win64
MinimumVersion: 1.3.1

Input:
  NAME: TreeSizeFree
  DOWNLOAD_URL: https://downloads.jam-software.de/treesize_free/TreeSizeFreeSetup.exe
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%%PF_STRING%.exe'
    url: '%DOWNLOAD_URL%'
    # CHECK_FILESIZE_ONLY: True

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: WindowsSignatureVerifier
  Comment: Check the signature on the MSI file
  Arguments:
    expected_subject: CN=JAM Software GmbH, O=JAM Software GmbH, STREET=Am Wissenschaftspark 26, L=Trier, S=Rheinland-Pfalz, C=DE, OID.1.3.6.1.4.1.311.60.2.1.1=Wittlich, OID.1.3.6.1.4.1.311.60.2.1.2=Rheinland-Pfalz, OID.1.3.6.1.4.1.311.60.2.1.3=DE, SERIALNUMBER=HRB 4920, OID.2.5.4.15=Private Organization
    input_path: '%pathname%'

- Processor: EndOfCheckPhase
