Description: Imports Acrobat Reader DC update for Windows (MSP) x64 release to BMS
Identifier: com.github.NickETH.recipes.BMS.AcrobatReaderDC-Win64
ParentRecipe: com.github.NickETH.recipes.build.AcrobatReaderDC-Win64
MinimumVersion: 1.3.1

Input:
  NAME: 'AcrobatReaderDC'
  NAMESHORT: 'AcrobatReader'
  NAMELONG: 'Acrobat Reader DC'
  VENDOR: Adobe
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _deu
  LANG_VERSION: DE-EN
  DIP_NAME: Adobe_Reader_DC
  DIP_SUBDIR: ML_x64

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductVersion'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AcroPro.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    BASEVERSION: '%msi_value%'
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductName'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AcroPro.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    PRODUCTNAME: '%msi_value%'
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AcroPro.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%BASEVERSION%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    BASEVER_US: '%parsed_string%'
    input_string: '%version%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/MSISumInfo
  Comment: get the summary info from the MSI
  Arguments:
    cmnds_sinfo: ''
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AcroPro.msi'

- Processor: com.github.jazzace.processors/TextSearcher
  Arguments:
    text_in: '%SumInfo_Dump%'
    re_pattern: '\[/a\]\s[A-Za-z]+ = (.+)\r'
    result_output_var_name: 'MSIAUTHOR'

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the basic MSI Application into Baramundi (BMS) QSS
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%DIP_NAME%\%BASEVER_US%\%DIP_SUBDIR%\AcroPro.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1 DISABLEDESKTOPSHORTCUT=1
    #INSTALLUWPAPP=NO
    # bms_app_integration:
    # - appname: '%NAMELONG%'
      # bundles:
      # - action: exchange
        # name: nV_%NAMELONG%
      # - action: add
        # name: aV_%NAMELONG% Uninstall
        # version: new
      # - action: add
        # name: oV_%NAMELONG% Uninstall
        # version: previous
      # copyfolders: 1
      # currentversion:
        # bundle: nV_%NAMELONG%
        # search: '[d]+\.[d]+\.[d]+\.[d]+ %LANG_VERSION% (%PLATFORM%)'
        # type: bundles
      # platform: (%PLATFORM%)
      # subspec: ''
      # vendor: '%VENDOR%'
      # version: '%build_ver% %LANG_VERSION%'
      # SWDetectionRules:
      # - Name: '%PRODUCTNAME%'
        # Vendor: '%MSIAUTHOR%'
        # Version: '%build_ver%'
        # Language: "1031"
        # PathType: "1"
        # RegKey: '%msi_value%'
        # ApplyMode: "0"
        # Category: "baramundi Application"
        # Comments: ''
    # bms_app_sharepoint:
    # - SW-List-Name: '%NAMELONG%'
      # versionplatformtag: '%build_ver% DE-EN (x64/x86)'
    # bms_job_kiosk:
    # - jobname: '%NAMELONG%'
      # substring: 'Taskkill'
      # jobdescription: 'Adobe Acrobat Reader DC ist ein Programm von Adobe zum Anzeigen von PDF-Dokumenten, also ein Dateibetrachter. Es ist Teil der Adobe-Acrobat-Produktfamilie.'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAMELONG%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%BASEVERSION% %LANG_VERSION% (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.*|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%BASEVER_US%\%DIP_SUBDIR%'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    icon_file_src: '%BUILD_DIR%\%pkg_dir%\icons\*.*'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%BASEVERSION%%LANG_STRING%.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%BASEVER_US%\DEV'
    
- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the MSP application update into Baramundi (BMS) QSS
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_dependencies:
    - '%NAMELONG%~~~%BASEVERSION% %LANG_VERSION% (%PLATFORM%)'
    bms_app_installcmd: 'msiexec.exe'
    bms_app_installparm: '/update "{DIP}\Apl\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%\AcroRdrDCx64Upd%version_string%.msp" /qn /norestart'
    bms_app_integration:
    - appname: '%NAMELONG%'
      bundles:
      - action: exchange
        name: nV_%NAMELONG%
      - action: add
        name: aV_%NAMELONG% Uninstall
        version: new
      - action: add
        name: oV_%NAMELONG% Uninstall
        version: previous
      copyfolders: 1
      currentversion:
        bundle: nV_%NAMELONG%
        search: '[d]+\.[d]+\.[d]+\.[d]+ %LANG_VERSION% (%PLATFORM%)'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% %LANG_VERSION%'
      SWDetectionRules:
      - Name: 'Adobe Acrobat (64-bit)'
        Vendor: '%MSIAUTHOR%'
        Version: '%build_ver%'
        Language: "1031"
        PathType: "1"
        RegKey: '%msi_value%'
        ApplyMode: "0"
        Category: "baramundi Application"
        Comments: ''
    bms_app_sharepoint:
    - SW-List-Name: '%NAMELONG%'
      versionplatformtag: '%build_ver% DE-EN (x64/x86)'
    bms_job_kiosk:
    - jobname: '%NAMELONG%'
      substring: 'Taskkill'
      jobdescription: 'Adobe Acrobat Reader DC ist ein Programm von Adobe zum Anzeigen von PDF-Dokumenten, also ein Dateibetrachter. Es ist Teil der Adobe-Acrobat-Produktfamilie.'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAMELONG%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% %LANG_VERSION% (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.msp|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\%DIP_SUBDIR%'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    icon_file_src: '%BUILD_DIR%\%pkg_dir%\icons\*.*'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
