Description: Downloads latest Adobe Acrobat Pro DC Update MSP-file for Windows.
Identifier: com.github.NickETH.recipes.download.AcrobatProDC-Win
MinimumVersion: 1.3.1

Input:
  NAME: AdobeAcrobatDC
  SEARCH_URL: https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/index.html
  SEARCH_PATTERN: /AcrobatDCUpd(?P<version_string>(?P<ver_major>[0-9]{2})(?P<ver_majorminor>[0-9]{3})(?P<ver_minor>[0-9]{5}))\.msp
  DOWNLOAD_FILE: AcrobatDCUpd.msp

Process:
- Processor: URLTextSearcher
  Comment: Get the most recent release notes page
  Arguments:
    re_pattern: continuous/.*\.html
    url: '%SEARCH_URL%'

- Processor: URLTextSearcher
  Comment: Read out link and version from the release notes page
  Arguments:
    re_pattern: /AcrobatDCUpd(?P<version_string>(?P<ver_major>[0-9]{2})(?P<ver_majorminor>[0-9]{3})(?P<ver_minor>[0-9]{5}))\.msp
    url: https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/%match%

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%ver_major%.%ver_majorminor%.%ver_minor%'
    rename_var: version

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%ver_major%,%ver_majorminor%,%ver_minor%'
    rename_var: ASver

- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: 'False'
    filename: '%DOWNLOAD_FILE%'
    url: https://ardownload2.adobe.com/pub/adobe/acrobat/win/AcrobatDC/%version_string%/AcrobatDCUpd%version_string%.msp

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Adobe Inc., OU=Acrobat DC, O=Adobe Inc., L=San Jose, S=ca, C=US, SERIALNUMBER=2748129, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Delaware, OID.1.3.6.1.4.1.311.60.2.1.3=US
    input_path: '%pathname%'

- Processor: EndOfCheckPhase
