Description: Patches Adobe Acrobat Pro DC for Windows (MSI) with the latest Update MSP-file and builds it.
Identifier: com.github.NickETH.recipes.build.AcrobatProDC-Win
ParentRecipe: com.github.NickETH.recipes.download.AcrobatProDC-Win
MinimumVersion: 1.3.1

Input:
  NAME: AcrobatDC
  NAME1: AcroProDC
  NAME2: AcrobatProDC
  NAME3: AdobeAcrobatDC
  VENDOR: Adobe
  PLATFORM: x86
  PF_STRING: ''
  LANG_STRING: _ML
  SEARCH_URL: https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/index.html
  SEARCH_PATTERN: /AcrobatDCUpd(?P<version_string>(?P<ver_major>[0-9]{2})(?P<ver_majorminor>[0-9]{3})(?P<ver_minor>[0-9]{5}))\.msp
  DOWNLOAD_FILE: AcrobatDCUpd.msp
ACRO_SOURCE: '"your local AcrobatDC source"'

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME2%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'
 
- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME2%%PF_STRING%_%build_ver%%LANG_STRING%'
    rename_var: pkg_dir

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: get the directories from ITShop-win
  Arguments:
    cmdline_args:
    - /C
    - copy
    - /Y
    - '"%ACRO_SOURCE%\AcroPro.msi"'
    - '%BUILD_DIR%\%pkg_dir%\sourceunzipped\AcroPro.msi'
    exe_file: 'cmd.exe'
    exe_folder: '%RECIPE_CACHE_DIR%'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: get the directories from ITShop-win
  Arguments:
    cmdline_args:
    - /C
    - copy
    - /Y
    - '"%ACRO_SOURCE%\*.cab"'
    - '%BUILD_DIR%\%pkg_dir%\sourceunzipped\'
    exe_file: 'cmd.exe'
    exe_folder: '%RECIPE_CACHE_DIR%'

# - Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  # Comment: get the directories from ITShop-win
  # Arguments:
    # cmdline_args:
    # - /C
    # - copy
    # - /Y
    # - '"%ACRO_SOURCE%\1031.mst"'
    # - '%BUILD_DIR%\%pkg_dir%\release\AcroDC-AutoPkg_1031.mst'
    # exe_file: 'cmd.exe'
    # exe_folder: '%RECIPE_CACHE_DIR%'
- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-AcrobatProDC_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[1][9]\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-AcrobatProDC_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[1][9]\.[0-9]+\.[0-9]+'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\AdobeAcrobatDCUpd%version_string%.msp'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIofflinePatcher
  Arguments:
    adm_msi_path: adm\AcroPro.msi
    cab_dir: adm
    cab_file: Data
    embed_cab: 'False'
    max_files_per_cab: '3000'
    msi_path: sourceunzipped\AcroPro.msi
    msp_path: sourceunzipped\AdobeAcrobatDCUpd%version_string%.msp
    new_msi_path: adm\AcroProDC_%version_string%_ML.msi
    new_packcode: 'True'
    pkg_dir_abs: '%BUILD_DIR%\%pkg_dir%'

- Processor: com.github.NickETH.recipes.SharedProcessors/AcrobatGUIDPatcher
  Arguments:
    base_GUID: '{AC76BA86-1033-FFFF-7760-0C0F074E4100}'
    new_ver: '%version%'
    old_hex_ver: 0F074E41

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Arguments:
    SQL_command:
    - UPDATE `Property` SET `Property`.`Value`='%newGUID%' WHERE `Property`.`Property`='ProductCode'
    - UPDATE `Directory` SET `Directory`.`DefaultDir`='PAC76B~1|%newGUID%' WHERE `Directory`.`Directory`='CACHE_DIR'
    msi_path: '%BUILD_DIR%\%pkg_dir%\adm\AcroProDC_%version_string%_ML.msi'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\AcroProDC_%version_string%_ML.msi'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\adm\AcroProDC_%version_string%_ML.msi'

# - Processor: Copier
  # Arguments:
    # destination_path: '%BUILD_DIR%\%pkg_dir%\release\Data1.cab'
    # overwrite: 'true'
    # source_path: '%BUILD_DIR%\%pkg_dir%\adm\Data1.cab'

# - Processor: Copier
  # Arguments:
    # destination_path: '%BUILD_DIR%\%pkg_dir%\release\Data2.cab'
    # overwrite: 'true'
    # source_path: '%BUILD_DIR%\%pkg_dir%\adm\Data2.cab'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: get the CAB-files
  Arguments:
    cmdline_args:
    - /C
    - dir
    - /b
    - '%BUILD_DIR%\%pkg_dir%\adm\Data*.cab'
    - '>'
    - cabfiles.txt
    exe_file: 'cmd.exe'
    exe_folder: '%RECIPE_CACHE_DIR%'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileMoverFromList
  Arguments:
    file_list: '%RECIPE_CACHE_DIR%\cabfiles.txt'
    source_dir: '%BUILD_DIR%\%pkg_dir%\adm'
    target_dir: '%BUILD_DIR%\%pkg_dir%\release'

# - Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplyTransform
  # Arguments:
    # msi_path: '%BUILD_DIR%\%pkg_dir%\release\AcroProDC_%version_string%_ML.msi'
    # mst_paths:
    # - '%BUILD_DIR%\%pkg_dir%\helpers\AcroProDC-ethz-22030x.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Applies the transforms to the AcroProDC_xx.msi in the release folder
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AcroProDC_%version_string%_ML.msi'
    mst_paths:
    - '%BUILD_DIR%\%pkg_dir%\helpers\Enterprise_Lockdown_byAutoPkg.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Arguments:
    SQL_command:
    - UPDATE `MoveFile` SET `MoveFile`.`SourceName`='AcroProDC-ethz-19x_1031.mst', `MoveFile`.`DestName`='AcroProDC-ethz-19x_1031.mst' , `MoveFile`.`SourceFolder`='SourceDirCustom' , `MoveFile`.`DestFolder`='CACHE_DIR' WHERE `MoveFile`.`FileKey`='CacheSetupFiles_1031.mst'
    - DELETE FROM `MoveFile` WHERE `MoveFile`.`DestFolder`='CACHE_DIR_TRANSFORM'
    - DELETE FROM `MoveFile` WHERE `MoveFile`.`FileKey`='CacheSetupFiles_ABCPY.INI'
    - DELETE FROM `MoveFile` WHERE `MoveFile`.`FileKey`='CacheSetupFiles_WindowsInstaller_KB893803_v2_x86.exe'
    - DELETE FROM `MoveFile` WHERE `MoveFile`.`FileKey`='CacheSetupFiles_setup.ini'
    - UPDATE `MoveFile` SET `MoveFile`.`SourceName`='Data2.cab', `MoveFile`.`DestName`='Data2.cab' WHERE `MoveFile`.`FileKey`='CacheSetupFiles_Setup.exe'
    - UPDATE `MoveFile` SET `MoveFile`.`SourceName`='AcroProDC_%version_string%_ML.msi', `MoveFile`.`DestName`='AcroProDC_%version_string%_ML.msi' WHERE `MoveFile`.`FileKey`='CacheSetupFiles_AcroPro.msi'
    - DELETE FROM `DeleteFiles` WHERE `DeleteFiles`.`DeleteFiles`='drvDX8_x3d'
    - UPDATE `Component` SET `Component`.`Condition`='CHROMEPLUGIN' WHERE `Component`.`Component`='WCChromeNativeMessagingHost'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AcroProDC_%version_string%_ML.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: Adobe Acrobat Pro DC %version%
      /o: Altered and hardened version for corporate use. %us_date% by AutoPkg
      /t: Adobe Acrobat Pro DC %version%
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AcroProDC_%version_string%_ML.msi'

- Processor: EndOfCheckPhase
