Description: Patches Adobe Acrobat Pro DC x64 for Windows (MSI) with the latest Update MSP-file and builds it.
Identifier: com.github.NickETH.recipes.build.AcrobatProDC-Win64
ParentRecipe: com.github.NickETH.recipes.download.AcrobatProDC-Win64

MinimumVersion: 1.3.1

Input:
  NAME: AcrobatDC
  VENDOR: Adobe
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML
  SEARCH_URL: https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/index.html
  SEARCH_PATTERN: /AcrobatDCx64Upd(?P<version_string>(?P<ver_major>[0-9]{2})(?P<ver_majorminor>[0-9]{3})(?P<ver_minor>[0-9]{5}))\.msp
  DOWNLOAD_FILE: AcrobatDCx64Upd.msp
  ACRO_SOURCE: '"your local AcrobatDC source"'

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'
 
- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%%LANG_STRING%'
    rename_var: pkg_dir

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: get the directories from ITShop-win
  Arguments:
    cmdline_args:
    - /C
    - copy
    - /Y
    - '"%ACRO_SOURCE%\AcroPro.msi"'
    - '%BUILD_DIR%\%pkg_dir%\sourceunzipped\AcroPro.msi'
    exe_file: 'cmd.exe'
    exe_folder: '%RECIPE_CACHE_DIR%'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: get the directories from ITShop-win
  Arguments:
    cmdline_args:
    - /C
    - copy
    - /Y
    - '"%ACRO_SOURCE%\*.cab"'
    - '%BUILD_DIR%\%pkg_dir%\sourceunzipped\'
    exe_file: 'cmd.exe'
    exe_folder: '%RECIPE_CACHE_DIR%'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: get the directories from ITShop-win
  Arguments:
    cmdline_args:
    - /C
    - copy
    - /Y
    - '"%ACRO_SOURCE%\1031.mst"'
    - '%BUILD_DIR%\%pkg_dir%\release\AcroDC-AutoPkg_1031.mst'
    exe_file: 'cmd.exe'
    exe_folder: '%RECIPE_CACHE_DIR%'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9][0-9]\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9][0-9]\.[0-9]+\.[0-9]+'
    
- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%DOWNLOAD_FILE%'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIofflinePatcher
  Arguments:
    adm_msi_path: adm\AcroPro.msi
    cab_dir: adm
    cab_file: Data
    embed_cab: 'False'
    max_files_per_cab: '3000'
    msi_path: sourceunzipped\AcroPro.msi
    msp_path: sourceunzipped\%DOWNLOAD_FILE%
    new_msi_path: adm\AcroProDC_%version_string%_ML.msi
    new_packcode: 'True'
    pkg_dir_abs: '%BUILD_DIR%\%pkg_dir%'

- Processor: com.github.NickETH.recipes.SharedProcessors/AcrobatGUIDPatcher
  Arguments:
    base_GUID: '{AC76BA86-1033-FFFF-7760-BC15014EA700}'
    new_ver: '%version%'
    old_hex_ver: 15014EA7

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Arguments:
    SQL_command:
    - UPDATE `Property` SET `Property`.`Value`='%newGUID%' WHERE `Property`.`Property`='ProductCode'
    - UPDATE `Directory` SET `Directory`.`DefaultDir`='PAC76B~1|%newGUID%' WHERE `Directory`.`Directory`='CACHE_DIR'
    - DELETE FROM `Media` WHERE `Media`.`Cabinet`='Extras.cab'
    - DELETE FROM `Media` WHERE `Media`.`Cabinet`='Optional.cab'
    - DELETE FROM `Media` WHERE `Media`.`Cabinet`='AlfSdPack.cab'
    - DELETE FROM `Media` WHERE `Media`.`Cabinet`='Languages.cab'
    msi_path: '%BUILD_DIR%\%pkg_dir%\adm\AcroProDC_%version_string%_ML.msi'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\adm\AcroProDC_%version_string%_ML.msi'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\Data1.cab'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\adm\Data1.cab'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\Data2.cab'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\adm\Data2.cab'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Applies the transforms to the AcroProDC_xx.msi in the release folder
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    mst_paths:
    - '%BUILD_DIR%\%pkg_dir%\helpers\Enterprise_Lockdown_byAutoPkg.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Arguments:
    SQL_command:
    - UPDATE `MoveFile` SET `MoveFile`.`SourceName`='AcroProDC-ethz-19x_1031.mst', `MoveFile`.`DestName`='AcroProDC-ethz-19x_1031.mst' , `MoveFile`.`SourceFolder`='SourceDirCustom' , `MoveFile`.`DestFolder`='CACHE_DIR' WHERE `MoveFile`.`FileKey`='CacheSetupFiles_1031.mst'
    - DELETE FROM `MoveFile` WHERE `MoveFile`.`DestFolder`='CACHE_DIR_TRANSFORM'
    - DELETE FROM `MoveFile` WHERE `MoveFile`.`FileKey`='CacheSetupFiles_ABCPY.INI'
    - DELETE FROM `MoveFile` WHERE `MoveFile`.`FileKey`='CacheSetupFiles_WindowsInstaller_KB893803_v2_x86.exe'
    - DELETE FROM `MoveFile` WHERE `MoveFile`.`FileKey`='CacheSetupFiles_setup.ini'
    - UPDATE `MoveFile` SET `MoveFile`.`SourceName`='Data2.cab', `MoveFile`.`DestName`='Data2.cab' WHERE `MoveFile`.`FileKey`='CacheSetupFiles_Setup.exe'
    - UPDATE `MoveFile` SET `MoveFile`.`SourceName`='%NAME%%PF_STRING%_%version%%LANG_STRING%.msi', `MoveFile`.`DestName`='%NAME%%PF_STRING%_%version%%LANG_STRING%.msi' WHERE `MoveFile`.`FileKey`='CacheSetupFiles_AcroPro.msi'
    - DELETE FROM `DeleteFiles` WHERE `DeleteFiles`.`DeleteFiles`='drvDX8_x3d'
    - UPDATE `Component` SET `Component`.`Condition`='CHROMEPLUGIN' WHERE `Component`.`Component`='WCChromeNativeMessagingHost'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: Adobe Acrobat Pro DC %version%
      /o: Altered and hardened version for corporate use. %us_date% by AutoPkg
      /t: Adobe Acrobat Pro DC %version%
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
- Processor: EndOfCheckPhase
