Description: Creates an update installer for Acrobat Reader DC x64 for Windows (MSI) by applying only patching.
Identifier: com.github.NickETH.recipes.build.AcrobatReaderDC-Win64
ParentRecipe: com.github.NickETH.recipes.download.AdobeReaderDCMSI-Win64
MinimumVersion: 1.3.1

Input:
  NAME: AcrobatReaderDC
  NAME2: AcrobatReaderDC
  NAMELONG: 'Acrobat Reader DC'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _deu
  SEARCH_URL: https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/index.html
  SEARCH_PATTERN: /AcroRdrDCUpd(?P<version_string>(?P<ver_major>[0-9]{2})(?P<ver_majorminor>[0-9]{3})(?P<ver_minor>[0-9]{5}))\.msp
  DOWNLOAD_FILE: AcrobatReaderDCUpd.msp

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%%LANG_STRING%'
    rename_var: pkg_dir

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9][0-9]\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9][0-9]\.[0-9]+\.[0-9]+'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-x64.exe'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the AcrobatReaderDC-Win64 installer
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-x64.exe'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%NAME%'
    extract_file: '*'
    ignore_pattern: ''
    preserve_paths: 'True'

# - Processor: com.github.NickETH.recipes.SharedProcessors/MSIofflinePatcher
  # Arguments:
    # adm_msi_path: adm\AcroPro.msi
    # cab_dir: adm
    # cab_file: Data1
    # embed_cab: 'True'
    # msi_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%NAME%\AcroPro.msi'
    # msp_path: sourceunzipped\%NAME%\AcroRdrDCx64Upd%version_string%.msp
    # new_msi_path: adm\AcroRdrDCx64Upd%version_string%.msi
    # new_packcode: 'True'
    # pkg_dir_abs: '%BUILD_DIR%\%pkg_dir%'

# - Processor: com.github.NickETH.recipes.SharedProcessors/AcrobatGUIDPatcher
  # Arguments:
    # base_GUID: '{AC76BA86-1031-1033-7760-BC15014EA700}'
    # new_ver: '%version%'
    # old_hex_ver: 15014EA7

# - Processor: Copier
  # Arguments:
    # destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msp'
    # overwrite: 'true'
    # source_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%NAME%\AcroRdrDCx64Upd%version_string%.msp'


# - Processor: Copier
  # Arguments:
    # destination_path: '%BUILD_DIR%\%pkg_dir%\release\AcroPro.msi'
    # overwrite: 'true'
    # source_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%NAME%\AcroPro.msi'

# - Processor: Copier
  # Arguments:
    # destination_path: '%BUILD_DIR%\%pkg_dir%\release\'
    # overwrite: 'true'
    # source_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%NAME%\*.cab'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileMoverFromList
  Arguments:
    file_list: '%BUILD_DIR%\%pkg_dir%\helpers\Files2Move.txt'
    source_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%NAME%'
    target_dir: '%BUILD_DIR%\%pkg_dir%\release'
 
# - Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  # Arguments:
    # SQL_command:
    # - DELETE FROM `Media` WHERE `Media`.`Cabinet`='Languages.cab'
    # - UPDATE `Property` SET `Property`.`Value`='%newGUID%' WHERE `Property`.`Property`='ProductCode'
    # - UPDATE `Property` SET `Property`.`Value`='Adobe Acrobat Reader DC DE-EN' WHERE `Property`.`Property`='ProductName'
    # - UPDATE `Component` SET `Component`.`Condition`='CHROMEPLUGIN' WHERE `Component`.`Component`='WCChromeNativeMessagingHost'
    # - UPDATE `MoveFile` SET `MoveFile`.`SourceName`='%NAME%%PF_STRING%_%version%%LANG_STRING%.msi', `MoveFile`.`DestName`='%NAME%%PF_STRING%_%version%%LANG_STRING%.msi' WHERE `MoveFile`.`FileKey`='CacheSetupFiles_AcroPro.msi'
    # msi_path: '%BUILD_DIR%\%pkg_dir%\adm\AcroRdrDCx64Upd%version_string%.msi'


- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Applies the transforms to the AcroPro.msi in the release folder
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AcroPro.msi'
    mst_paths:
    - '%BUILD_DIR%\%pkg_dir%\helpers\Enterprise_Lockdown_byAutoPkg.mst'
    - '%BUILD_DIR%\%pkg_dir%\helpers\JavaScript_Disable_byAutoPkg.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Arguments:
    SQL_command:
    - UPDATE `Registry` SET `Registry`.`Value`='%ASver%' WHERE `Registry`.`Registry`='RegHKLM2'
    - UPDATE `Registry` SET `Registry`.`Value`='%ASver%' WHERE `Registry`.`Registry`='Reg64HKLM2'
    # - UPDATE `MoveFile` SET `MoveFile`.`SourceName`='%NAME%%PF_STRING%_%version%%LANG_STRING%.msi', `MoveFile`.`DestName`='%NAME%%PF_STRING%_%version%%LANG_STRING%.msi' WHERE `MoveFile`.`FileKey`='CacheSetupFiles_AcroPro.msi'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AcroPro.msi'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAMELONG%.png'
    #source_app: '%BUILD_DIR%\%pkg_dir%\adm\Program Files 64\Adobe\Acrobat DC\Acrobat\Acrobat.exe'
    #source_app: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    source_app: '%BUILD_DIR%\%pkg_dir%\release\AcroPro.msi'
    msi_icon_name: '_SC_Acrobat.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAMELONG%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAMELONG%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAMELONG%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: Acrobat Reader DC
      /o: Altered and hardened version for corporate use. %us_date% by AutoPkg
      /t: Acrobat Reader DC
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AcroPro.msi'

- Processor: EndOfCheckPhase
