Description: Packages the latest Adobe AIR client for Windows.
Identifier: com.github.NickETH.recipes.build.AdobeAIR-Win
ParentRecipe: com.github.NickETH.recipes.download.AdobeAIR-Win
MinimumVersion: 1.3.1

Input:
  NAME: AdobeAIR
  NAMELONG: 'Adobe AIR'
  NAMEL2: Adobe_AIR
  VENDOR: Harman
  PLATFORM: x86
  PF_STRING: ''
  LANG_STRING: _ENU

  DOWNLOAD_URL: https://airsdk.harman.com/

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/WinPEVersionExtractor
  Arguments:
    exe_path: '%pathname%'
    product_version: 'False'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAMEL2%_%version%%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\AdobeAIR_%version%.exe'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'
    extract_file: '*'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIofflinePatcher
  Arguments:
    adm_msi_path: adm\setup.msi
    cab_dir: adm
    cab_file: Data1
    embed_cab: 'True'
    msi_path: sourceunzipped\setup.msi
    new_msi_path: adm\%NAMEL2%_%version%%LANG_STRING%.msi
    pkg_dir_abs: '%BUILD_DIR%\%pkg_dir%'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAMEL2%_%version%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\adm\%NAMEL2%_%version%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Applies the Settings-Transform to the AIR.msi in the release folder
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAMEL2%_%version%%LANG_STRING%.msi'
    mst_paths: '%BUILD_DIR%\%pkg_dir%\helpers\AIR-Corp-config.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: Adobe AIR Runtime %version%
      /o: Slightely altered version for ETHZ ID. %us_date% by AutoPkg
      /t: Adobe AIR Runtime %version%
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAMEL2%_%version%%LANG_STRING%.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAMEL2%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAMEL2%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: EndOfCheckPhase
