Description: Patches Adobe Reader DC for Windows (MSI) with the latest Update MSP-file and builds it.
Identifier: com.github.NickETH.recipes.build.AdobeReaderDC-Win
ParentRecipe: com.github.NickETH.recipes.download.AdobeReaderDCMSI-Win
MinimumVersion: 1.3.1

Input:
  NAME: AdobeReaderDC
  NAMELONG: 'Adobe Reader DC'
  SEARCH_URL: https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/index.html
  SEARCH_PATTERN: /AcroRdrDCUpd(?P<version_string>(?P<ver_major>[0-9]{2})(?P<ver_majorminor>[0-9]{3})(?P<ver_minor>[0-9]{5}))\.msp
  DOWNLOAD_FILE: AdobeReaderDCUpd.msp

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: AdobeReaderDC_%version%_deu
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-AdobeReaderDC_%version%_deu.txt'
    new_ver: '%version%'
    re_pattern: '[0-9][0-9]\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-AdobeReaderDC_%version%_deu.txt'
    new_ver: '%version%'
    re_pattern: '[0-9][0-9]\.[0-9]+\.[0-9]+'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\AdobeReaderDCUpd%version_string%.msp'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIofflinePatcher
  Arguments:
    adm_msi_path: adm\AcroRdrDC1500720033_de_DE.msi
    cab_dir: adm
    cab_file: Data1
    embed_cab: 'True'
    msi_path: sourceunzipped\AcroRdrDC1500720033_de_DE.msi
    msp_path: sourceunzipped\AdobeReaderDCUpd%version_string%.msp
    new_msi_path: adm\AcroRdrDC%version_string%_de_DE.msi
    new_packcode: 'True'
    pkg_dir_abs: '%BUILD_DIR%\%pkg_dir%'

- Processor: com.github.NickETH.recipes.SharedProcessors/AcrobatGUIDPatcher
  Arguments:
    base_GUID: '{AC76BA86-7AD7-1031-7B44-AC0F074E4100}'
    new_ver: '%version%'
    old_hex_ver: 0F074E41

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Arguments:
    SQL_command:
    - UPDATE `Property` SET `Property`.`Value`='%newGUID%' WHERE `Property`.`Property`='ProductCode'
    - UPDATE `Property` SET `Property`.`Value`='Adobe Acrobat Reader DC DE-EN' WHERE `Property`.`Property`='ProductName'
    - UPDATE `Component` SET `Component`.`Condition`='CHROMEPLUGIN' WHERE `Component`.`Component`='WCChromeNativeMessagingHost'
    - UPDATE `MoveFile` SET `MoveFile`.`SourceName`='AdobeReaderDC_%version%_Deu.msi', `MoveFile`.`DestName`='AdobeReaderDC_%version%_Deu.msi' WHERE `MoveFile`.`FileKey`='CacheSetupFiles_AcroRdrDC1501720050_de_DE.msi'
    msi_path: '%BUILD_DIR%\%pkg_dir%\adm\AcroRdrDC%version_string%_de_DE.msi'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\AdobeReaderDC_%version%_Deu.msi'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\adm\AcroRdrDC%version_string%_de_DE.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Applies the transforms to the AdobeReaderDC.msi in the release folder
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AdobeReaderDC_%version%_Deu.msi'
    mst_paths:
    - '%BUILD_DIR%\%pkg_dir%\helpers\CurrentUser1.mst'
    - '%BUILD_DIR%\%pkg_dir%\helpers\ActiveSetup1.mst'
    - '%BUILD_DIR%\%pkg_dir%\helpers\ActiveSetup64.mst'
    - '%BUILD_DIR%\%pkg_dir%\helpers\DisJavaScript.mst'
    - '%BUILD_DIR%\%pkg_dir%\helpers\EnableSysCert.mst'
    - '%BUILD_DIR%\%pkg_dir%\helpers\DisExeLaunch.mst'
    - '%BUILD_DIR%\%pkg_dir%\helpers\MUI.mst'
    - '%BUILD_DIR%\%pkg_dir%\helpers\AcroRdrDC15UI1.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Arguments:
    SQL_command:
    - UPDATE `InstallExecuteSequence` SET `InstallExecuteSequence`.`Condition`='Not Installed And (UT_FRB Or UT_FRS)' WHERE `InstallExecuteSequence`.`Action`='OlderOverNewerAbort'
    - UPDATE `Registry` SET `Registry`.`Value`='%ASver%' WHERE `Registry`.`Registry`='RegHKLM2'
    - UPDATE `Registry` SET `Registry`.`Value`='%ASver%' WHERE `Registry`.`Registry`='Reg64HKLM2'
    - UPDATE `MoveFile` SET `MoveFile`.`SourceName`='AdobeReaderDC_%version%_Deu.msi', `MoveFile`.`DestName`='AdobeReaderDC_%version%_Deu.msi' WHERE `MoveFile`.`FileKey`='CacheSetupFiles_AcroRdrDC1501720050_de_DE.msi'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AdobeReaderDC_%version%_Deu.msi'

- Processor: com.github.haircut.processors/AppIconExtractor
  Comment: Generate the Adobe Reader icons for BMS Kiosk.
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAMELONG%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\release\AdobeReaderDC_%version%_Deu.msi'
    msi_icon_name: 'SC_Reader.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAMELONG%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAMELONG%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAMELONG%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: 'Acrobat Reader DC'
      /o: Altered and hardened version for corporate use. %us_date% by AutoPkg
      /t: 'Acrobat Reader DC'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\AdobeReaderDC_%version%_Deu.msi'

- Processor: EndOfCheckPhase
