Description: Downloads the latest release of SQLiteStudio x64 from Github.
Identifier: com.github.NickETH.recipes.download.SQLiteStudio-Win64
MinimumVersion: 1.3.1

Input:
  NAME: SQLiteStudio
  PLATFORM: x64
  PF_STRING: _64
  ASSET_REGEX: 'SQLiteStudio.*?windows-%PLATFORM%-installer\.exe'

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: '%ASSET_REGEX%'
    # https://github.com/pawelsalawa/sqlitestudio/releases/download/3.4.17/SQLiteStudio-3.4.17-windows-x64-installer.exe
    github_repo: pawelsalawa/sqlitestudio
    include_prereleases: false

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.exe'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
