Description: Downloads the latest SolsticeClient installer for Windows.
Identifier: com.github.NickETH.recipes.download.SolsticeClient-Win64
MinimumVersion: 1.3.1

Input:
  NAME: SolsticeClient
  USER_AGENT: Mozilla/5.0 (Windows NT 6.3; Win64, x64; Trident/7.0; rv:11.0) like Gecko
  SEARCH_URL: https://www.mersive.com/download-admin/
  SEARCH_PATTERN: href="(/files/[0-9]+/)".*Windows MSI

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_PATTERN%'
    re_flags:
    - DOTALL
    result_output_var_name: match
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.msi'
    request_headers:
      user-agent: '%USER_AGENT%'
    url: https://www.mersive.com%match%

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN="Mersive Technologies, Inc.", OU="Mersive Technologies, Inc.", O="Mersive Technologies, Inc.", L=Denver, S=Colorado, C=US, SERIALNUMBER=4183763, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Delaware, OID.1.3.6.1.4.1.311.60.2.1.3=US
    input_path: '%pathname%'

- Processor: EndOfCheckPhase
