Description: Imports Microsoft EdgeChromium x64 to BMS
Identifier: com.github.NickETH.recipes.BMS.MicrosoftEdge-Win64
ParentRecipe: com.github.NickETH.recipes.build.MicrosoftEdge-Win64
MinimumVersion: 1.3.1

Input:
  NAME: MicrosoftEdge
  VENDOR: Microsoft
  PLATFORM: x64
  PF_STRING: _64
  PRODUCTID: '2093437'

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%msi_value%_ML.msi'

- Processor: com.github.homebysix-recipes.FindAndReplace/FindAndReplace
  Arguments:
    input_string: '%msi_value%'
    find: .
    replace: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\EdgeChromium\%output_string%\ML_x64\%NAME%%PF_STRING%_%msi_value%_ML.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1
    bms_app_integration:
    - appname: EdgeChromium
      bundles:
      - action: exchange
        name: nV_Edge Chromium
      - action: add
        name: aV_Edge Chromium Uninstall
        version: new
      - action: add
        name: oV_Edge Chromium Uninstall
        version: previous
      currentversion:
        bundle: nV_Edge Chromium
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (x64)'
        type: bundles
      platform: (x64)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\EdgeChromium\bms_app_integration.json'
    bms_app_iopt_copylocal: true
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: false
    bms_app_iopt_usebbt: true
    bms_app_name: EdgeChromium
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn
    bms_app_uopt_rebootbhv: NoReboot
    bms_app_valid4os: Windows7_x64,Windows8_x64,Windows10_x64,WindowsServer2012_x64,WindowsServer2016_x64,WindowsServer2019_x64
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%msi_value% ML (x64)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%msi_value%_ML.msi|%BMS_IMPORT_PATH_TST%\EdgeChromium\%output_string%\ML_x64'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%msi_value%_ML.txt|%BMS_IMPORT_PATH_TST%\EdgeChromium\%output_string%\DEV'

- Processor: EndOfCheckPhase
