Description: Downloads the latest version of Microsoft's Edge Webdriver.
Identifier: com.github.NickETH.recipes.download.MicrosoftEdgeWebDriver-Win64
MinimumVersion: 1.3.1

Input:
  NAME: EdgeWebDriver
  
  SEARCH_UPDATE_URL: https://developer.microsoft.com/en-us/microsoft-edge/tools/webdriver/?form=MA13LH
  # SEARCH_UPDATE_URL: https://www.microsoft.com/download/details.aspx?id=100809
  VENDOR: 'Microsoft'
  PLATFORM: x64
  PF_STRING: '_64'
  LANG_STRING: _EN
  DIP_NAME: Endnote
  DIP_SUBDIR: ML

Process:
- Processor: URLTextSearcher
  Arguments:
    # stable Channel.*?https://msedgedriver.azureedge.net/(?P<version>([0-9]+\.)*[0-9]+)/edgedriver_win64.zip
    # re_pattern: Stable Channel.*?(https://msedgedriver.azureedge.net/(?P<version>([0-9]+\.)*[0-9]+)/edgedriver_win64.zip)
    re_pattern: Stable Channel.*?(https://msedgedriver.microsoft.com/(?P<version>([0-9]+\.)*[0-9]+)/edgedriver_win64.zip)
    url: '%SEARCH_UPDATE_URL%'
    re_flags:
    - DOTALL

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%PLATFORM%.zip'
    url: '%match%'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

# - Processor: com.github.NickETH.recipes.SharedProcessors/WinPEVersionExtractor
  # Arguments:
    # exe_path: '%pathname%'
    # product_version: 'True'

