Description: Imports Microsoft PowerToys to BMS
Identifier: com.github.NickETH.recipes.BMS.MicrosoftPowerToys-Win64
ParentRecipe: com.github.NickETH.recipes.build.MicrosoftPowerToys-Win64
MinimumVersion: 1.3.1

Input:
  NAME: PowerToys
  VENDOR: Microsoft
  GITHUB_REPO: microsoft/PowerToys
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%version%_ML\release\%VENDOR%_%NAME%%PF_STRING%_%version%_ML.msi'

- Processor: com.github.homebysix-recipes.FindAndReplace/FindAndReplace
  Arguments:
    input_string: '%build_ver%'
    find: .
    replace: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\%NAME%\%output_string%\ML_x64\%VENDOR%_%NAME%%PF_STRING%_%version%_ML.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1 CREATESCHEDULEDTASK=0
    bms_app_integration:
    - appname: '%NAME%'
      currentversion:
        job: '@_nV_Microsoft PowerToys - Update'
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: job
      jobs:
      - action: add
        name: '@_nV_Microsoft PowerToys - Update'
        version: new
      - action: changetype
        name: '@_nV_Microsoft PowerToys - Update'
        version: previous
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    bms_app_iopt_copylocal: 'false'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: false
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn
    bms_app_valid4os: Windows10_x64,Windows11_x64
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (x64)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME%'
    inst_file_src_dest: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%version%_ML\release\*|%BMS_IMPORT_PATH_TST%\%NAME%\%output_string%\ML_x64'
    read_file_src_dest: '%BUILD_DIR%\%VENDOR%_%NAME%%PF_STRING%_%version%_ML\read\*-%VENDOR%_%NAME%%PF_STRING%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\%NAME%\%output_string%\DEV'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%NAME%\bms_app_integration.json'

- Processor: EndOfCheckPhase
