Description: Alters latest Microsoft Microsoft's Edge Webdriver for Windows.
Identifier: com.github.NickETH.recipes.build.MicrosoftEdgeWebDriver-Win64
ParentRecipe: com.github.NickETH.recipes.download.MicrosoftEdgeWebDriver-Win64
MinimumVersion: 1.3.1

Input:
  NAME: EdgeWebDriver
  VENDOR: Microsoft
  PLATFORM: x64
  PF_STRING: _64

Process:
# - Processor: com.github.NickETH.recipes.SharedProcessors/WinPEVersionExtractor
  # Arguments:
    # exe_path: '%pathname%'
    # product_version: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:release:read
    org_ver: '%version%'
    pkg_dir: '%VENDOR%_%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%VENDOR%_%NAME%%PF_STRING%_%version%_ML'
    rename_var: pkg_dir

- Processor: Copier
  Comment: Copy the Edge Webdriver zip file to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the Edge Webdriver exe to the release dir
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\release\'
    extract_file: 'msedgedriver.exe'
    ignore_pattern: ''
    preserve_paths: 'False'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Microsoft Corporation, O=Microsoft Corporation, L=Redmond, S=Washington, C=US
    input_path: '%BUILD_DIR%\%pkg_dir%\release\msedgedriver.exe'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%VENDOR%_%NAME%%PF_STRING%_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%VENDOR%_%NAME%%PF_STRING%_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

# - Processor: Copier
  # Arguments:
    # destination_path: '%BUILD_DIR%\%pkg_dir%\release\%VENDOR%_%NAME%%PF_STRING%_%version%_ML.exe'
    # overwrite: 'true'
    # source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: EndOfCheckPhase
