Description: Alters latest Microsoft Edge Chromium x64 MSI-file for Windows.
Identifier: com.github.NickETH.recipes.build.MicrosoftEdge-Win64
ParentRecipe: com.github.NickETH.recipes.download.MicrosoftEdgeMSI-Win
MinimumVersion: 1.3.1

Input:
  NAME: MicrosoftEdge
  PLATFORM: Win64
  PRODUCTID: '2093437'
  DOWNLOADURL: https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Comment: Get the version from the MSI file
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductVersion'
    msi_path: '%pathname%'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%msi_value%'
    rename_var: version

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourceunzipped:release:read:helpers
    org_ver: '%version%'
    pkg_dir: MicrosoftEdge_64_%version%_ML
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-MicrosoftEdge_64_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-MicrosoftEdge_64_%version%_ML.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\MicrosoftEdgeEnterprise-x64.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\MicrosoftEdge_64_%version%_ML.msi'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\MicrosoftEdge_64_%version%_ML.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/ChromiumSettings
  Arguments:
    new_settings:
      bookmark_bar:
        show_on_all_tabs: true
      browser:
        check_default_browser: false
        show_home_button: true
      distribution:
        allow_downgrade: false
        create_all_shortcuts: false
        do_not_create_desktop_shortcut: true
        do_not_create_quick_launch_shortcut: true
        do_not_create_taskbar_shortcut: true
        do_not_launch_chrome: true
        do_not_register_for_update_launch: true
        import_bookmarks: false
        import_history: false
        import_home_page: false
        import_search_engine: false
        make_chrome_default: false
        make_chrome_default_for_user: false
        msi: true
        require_eula: false
        show_welcome_page: false
        skip_first_run_ui: true
        suppress_first_run_bubble: true
        suppress_first_run_default_browser_prompt: true
        system_level: true
        verbose_logging: true
      first_run_tabs:
      - chrome://newtab
      homepage: http://www.ethz.ch
      homepage_is_newtabpage: false
      session.restore_on_startup: 1
      sync_promo:
        show_on_first_run_allowed: false
    product_GUID: '%msi_value%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSITransformer
  Comment: Applies the Settings-Transform to the MicrosoftEdge.msi in the release folder
  Arguments:
    mode: -a
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\MicrosoftEdge_64_%version%_ML.msi'
    mst_paths: '%BUILD_DIR%\%pkg_dir%\helpers\MsEdge64_ETHZchanges.mst'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQL
  Arguments:
    SQL_command:
    - UPDATE `Property` SET `Property`.`Value`='%chrm_settings_url%' WHERE `Property`.`Property`='MASTER_PREFERENCES'
    - UPDATE `InstallExecuteSequence` SET `InstallExecuteSequence`.`Condition`='((?ProductClientState=3) AND ($ProductClientState=2) AND NOT UPGRADINGPRODUCTCODE) AND UNINSTALLCMDLINE AND UNINSTALLCMDARGS' WHERE `InstallExecuteSequence`.`Action`='CallUninstaller'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\MicrosoftEdge_64_%version%_ML.msi'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIApplySumInfo
  Arguments:
    cmnds_sinfo:
      /j: Edge Chromium x64 %version% ML
      /o: 'Altered version for enterprise. %us_date% by AutoPkg'
      /t: Edge Chromium x64 %version% ML
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\MicrosoftEdge_64_%version%_ML.msi'

- Processor: EndOfCheckPhase
