Description: Alters latest Microsoft PowerToys Install-file for Windows.
Identifier: com.github.NickETH.recipes.build.MicrosoftPowerToys-Win64
ParentRecipe: com.github.NickETH.recipes.download.MicrosoftPowerToys-Win64
MinimumVersion: 1.3.1

Input:
  NAME: PowerToys
  VENDOR: Microsoft
  GITHUB_REPO: microsoft/PowerToys
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to store the package
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read
    org_ver: '%version%'
    pkg_dir: '%VENDOR%_%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%VENDOR%_%NAME%%PF_STRING%_%version%%LANG_STRING%'
    rename_var: pkg_dir

- Processor: Copier
  Comment: Copy the Git install exe file to the sourcepkt dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%VENDOR%_%NAME%%PF_STRING%_%version%%LANG_STRING%.exe'
    overwrite: 'true'
    source_path: '%pathname%'

- Processor: com.github.NickETH.recipes.SharedProcessors/WixExtractor
  Comment: Extract the MSI-file from install exe file to the sourceunzipped dir, using Wix6.
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%VENDOR%_%NAME%%PF_STRING%_%version%%LANG_STRING%.exe'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'

- Processor: FileFinder
  Comment: Find the exact path to extracted MSI-file
  Arguments:
    pattern: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\**\*.msi'

- Processor: Copier
  Comment: Copy the extracted MSI-file to the release dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%VENDOR%_%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    overwrite: 'true'
    source_path: '%found_filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%VENDOR%_%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%VENDOR%_%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: EndOfCheckPhase
