Description: Imports Microsoft EdgeChromium x86 to BMS
Identifier: com.github.NickETH.recipes.BMS.MicrosoftEdge-Win
ParentRecipe: com.github.NickETH.recipes.build.MicrosoftEdge-Win
MinimumVersion: 1.3.1

Input:
  NAME: MicrosoftEdge
  VENDOR: Microsoft
  PLATFORM: x86
  PF_STRING: ''
  PRODUCTID: '2093505'
  BMS_VALID4OS: '%BMS_OS4X86%'

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%_ML.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%version%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\EdgeChromium\%parsed_string%\ML\%NAME%%PF_STRING%_%version%_ML.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1
    bms_app_integration:
    - appname: EdgeChromium
      bundles:
      - action: exchange
        name: nV_Edge Chromium
      - action: add
        name: aV_Edge Chromium Uninstall
        version: new
      - action: add
        name: oV_Edge Chromium Uninstall
        version: previous
      currentversion:
        bundle: nV_Edge Chromium
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (x86)'
        type: bundles
      platform: (x86)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\EdgeChromium\bms_app_integration.json'
    bms_app_iopt_copylocal: true
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: false
    bms_app_iopt_usebbt: true
    bms_app_name: EdgeChromium
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn
    bms_app_uopt_rebootbhv: NoReboot
    bms_app_valid4os: '%BMS_VALID4OS%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%version% ML (x86)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%_ML.msi|%BMS_IMPORT_PATH_TST%\EdgeChromium\%parsed_string%\ML'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%version%_ML.txt|%BMS_IMPORT_PATH_TST%\EdgeChromium\%parsed_string%\DEV'

- Processor: EndOfCheckPhase
