Description: Buld the latest Office 2024 LTSC x64 installer for Windows.
Identifier: com.github.NickETH.recipes.build.Office2024LTSC-Win64
ParentRecipe: com.github.NickETH.recipes.download.Office2024LTSC-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Office2024LTSC
  NAME_LONG: 'Office 2024 LTSC'
  VENDOR: 'Microsoft'
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to build the package
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    create_AS_ver: 'True'
    folder_list: sourcepkt:sourceunzipped:release:icons:read:helpers
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAME%%PF_STRING%_%build_ver%_ML'
    rename_var: pkg_dir

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the setup.exe file from the deployment tool package
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Office'
    extract_file: 'setup.exe'
    ignore_pattern: ''
    recursive: 'True'
    preserve_paths: 'False'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: Download the Office source
  Arguments:
    cmdline_args:
    - /Download
    - '%BUILD_DIR%\%pkg_dir%\helpers\CONFIG_2024LTSC_ML_x64.xml'
    exe_file: 'setup.exe'
    exe_folder: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Office'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: get the directories from the Office download
  Arguments:
    cmdline_args:
    - /C
    - dir
    - /b
    - '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Office\Office\Data'
    - '>'
    - Office-dir.txt
    exe_file: 'cmd.exe'
    exe_folder: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'

# - Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  # Comment: get the directories from the Office download
  # Arguments:
    # cmdline_args:
    # - /C
    # - dir
    # - /b
    # - '%RECIPE_CACHE_DIR%\Office\Office\Data'
    # - '>'
    # - Office-dir.txt
    # exe_file: 'cmd.exe'
    # exe_folder: '%RECIPE_CACHE_DIR%'

- Processor: URLTextSearcher
  Arguments:
    # v64_16.0.17932.20428.cab
    re_pattern: '(v64_(?P<versionint>([0-9]+\.)*[0-9]+)\.cab)'
    url: file://%BUILD_DIR%/%pkg_dir%/sourceunzipped/Office-dir.txt


- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the IntegratedOffice.exe file from the Office package to extract icons later.
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Office\Office\Data\%versionint%\i640.cab'
    extract_dir: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'
    extract_file: 'IntegratedOffice.exe'
    ignore_pattern: ''
    recursive: 'True'
    preserve_paths: 'False'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: create archive in the release dir
  Arguments:
    cmdline_args:
    - a
    - '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%.zip'
    - '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Office\*'
    exe_file: '"%SZIP_PATH%"'
    exe_folder: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'

# - Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  # Comment: move the Office files to the release dir. Robocopy does not work, because it returns different non zero return codes on success. Processor needs a way to accept this.
  # Arguments:
    # cmdline_args:
    # - '%RECIPE_CACHE_DIR%\Office'
    # - '%BUILD_DIR%\%pkg_dir%\release'
    # - /MOVE
    # - /E
    # - /IS
    # - /IT
    # - /IM
    # exe_file: 'robocopy.exe'
    # exe_folder: '%RECIPE_CACHE_DIR%'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\IntegratedOffice.exe'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

