Description: Imports Office 2021 LTSC x86 to BMS
Identifier: com.github.NickETH.recipes.BMS.Office2021LTSC-Win
ParentRecipe: com.github.NickETH.recipes.build.Office2021LTSC-Win
MinimumVersion: 1.3.1

Input:
  NAME: Office2021LTSC
  NAME_LONG: 'Office 2021 LTSC'
  VENDOR: 'Microsoft'
  PLATFORM: x86
  PF_STRING: ''
  LANG_STRING: _ML
  DIP_NAME: Office_on_Prem
  DIP_SUBDIR: 2021LTSC_32

Process:
- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%versionint%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%parsed_string%%LANG_STRING%'
    rename_var: ver_int_dir

- Processor: FileCreator
  Comment: Generate the install.bds in the release dir.
  Arguments:
    file_content: |
      <?xml version="1.0" encoding="ISO-8859-1"?>
      <baramundiDeployScript Version="2420" LastChange="%us_date% %time%">
      <META>
      <INFO Vendor="" Name="" Version="" Author="Autopkg" Comment=""/>  
      <STATICVARS LoadInstallIni="1">
      <BMSVars></BMSVars>
      </STATICVARS>
      </META>
      <RUNOPTIONS HideProgress="1"/>
      <ACTIONS>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>******************************</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>Microsoft Office 2021 LTSC</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>******************************</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>Version: 251028</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>**********</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>ChangeLog:</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>20251028 - Hm: inital creation</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>******************************</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="1" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>set variable</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="SetX64Mode" level="1" breakpoint="0" ignore_error="0" comment="1" is_included="0" logging_enabled="1">
      <DATA>
      <MODE>1</MODE>
      </DATA>
      </ACTION>
      <ACTION type="EvalVar" level="1" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VARNAME>isOfficeInstalled</VARNAME>
      <SOURCE>Registry</SOURCE>
      <OPTIONS>0</OPTIONS>
      <Properties><PropertyEntry><Param>Key</Param><Value>SOFTWARE\Microsoft\Office\ClickToRun\Configuration</Value></PropertyEntry><PropertyEntry><Param>Registry</Param><Value>HKEY_LOCAL_MACHINE</Value></PropertyEntry><PropertyEntry><Param>Value</Param><Value>AudienceData</Value></PropertyEntry></Properties></DATA>
      </ACTION>
      <ACTION type="SetVar" level="1" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VARNAME>VerSubDir</VARNAME>
      <VALUE>%ver_int_dir%</VALUE>
      <OPTIONS>0</OPTIONS>
      </DATA>
      </ACTION>
      <ACTION type="SetVar" level="1" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <VARNAME>officeVersion</VARNAME>
      <VALUE>%versionint%</VALUE>
      <OPTIONS>0</OPTIONS>
      </DATA>
      </ACTION>
      <ACTION type="SetX64Mode" level="1" breakpoint="0" ignore_error="0" comment="1" is_included="0" logging_enabled="1">
      <DATA>
      <MODE>0</MODE>
      </DATA>
      </ACTION>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="1" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>Install</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="Conditional" level="1" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      </DATA>
      <CONDITION op1="{isOfficeInstalled}" op="MATCHES" op2="NOTFOUND" options="0"/>
      </ACTION>
      <ACTION type="IncludeBDS" level="2" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <FILENAME>..\global\install.bds</FILENAME>
      <DATERESOLVED>0</DATERESOLVED>
      <FILENAMERESOLVED></FILENAMERESOLVED>
      <RESOLVINGMACHINE></RESOLVINGMACHINE>
      <RESOLVEERROR></RESOLVEERROR>
      </DATA>
      </ACTION>
      <ACTION type="Comment" level="0" breakpoint="0" ignore_error="0" comment="1" is_included="0" logging_enabled="1">
      <DATA>
      <VALUE>Update</VALUE>
      </DATA>
      </ACTION>
      <ACTION type="Conditional" level="1" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      </DATA>
      <CONDITION op1="{isOfficeInstalled}" op="DOESNOTMATCH" op2="NOTFOUND" options="0"/>
      </ACTION>
      <ACTION type="IncludeBDS" level="2" breakpoint="0" ignore_error="0" comment="0" is_included="0" logging_enabled="1">
      <DATA>
      <FILENAME>..\global\update.bds</FILENAME>
      <DATERESOLVED>0</DATERESOLVED>
      <FILENAMERESOLVED></FILENAMERESOLVED>
      <RESOLVINGMACHINE></RESOLVINGMACHINE>
      <RESOLVEERROR></RESOLVEERROR>
      </DATA>
      </ACTION>
      </ACTIONS>
      </baramundiDeployScript>
    file_path: '%BUILD_DIR%\%pkg_dir%\release\install.bds'

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installbds: '{DIP}\Apl\%DIP_NAME%\%DIP_SUBDIR%\%ver_int_dir%\install.bds'
    bms_app_integration:
    - appname: '%NAME_LONG%'
      bundles:
      - action: exchange
        name: nV_%NAME_LONG%
      - action: add
        name: aV_%NAME_LONG% Uninstall
        version: new
      - action: add
        name: oV_%NAME_LONG% Uninstall
        version: previous
      currentversion:
        bundle: nV_%NAME_LONG%
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%versionint% ML'
      appfilesdir: '%DIP_NAME%\%DIP_SUBDIR%'
    bms_app_sharepoint:
    - SW-List-Name: '%NAME_LONG%'
      versionplatformtag: '%versionint% ML'
    bms_job_kiosk:
    - jobname: '%NAME_LONG%'
      substring: 'Taskkill'
      jobdescription: 'Microsoft Office 2021 LTSC x86 is meant for systems which do not have internet access.'
      autoenableapp: '%NAME_LONG% - Enable AutoUpdate'
      autoreleasejob: '@_AU-Rel_%NAME_LONG%'
    bms_app_iopt_copylocal: 'false'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'true'
    bms_app_iopt_usebbt: true
    bms_app_localfilecopy:
    - '{DIP}\Apl\%DIP_NAME%\%DIP_SUBDIR%\global\~~~SingleFolder'
    - '{DIP}\Apl\%DIP_NAME%\%DIP_SUBDIR%\%ver_int_dir%\install.bds~~~File'
    - '{DIP}\Apl\%DIP_NAME%\%DIP_SUBDIR%\%ver_int_dir%\Office2021LTSC.zip~~~File'
    bms_app_name: '%NAME_LONG%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: 'cmd.exe'
    bms_app_uninstparm: '/c exit 0'
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%versionint% ML (x64)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME1%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%DIP_SUBDIR%\%ver_int_dir%'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\%DIP_NAME%\%DIP_SUBDIR%\%ver_int_dir%\DEV'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%DIP_NAME%\bms_app_integration.json'
    icon_file_src: '%BUILD_DIR%\%pkg_dir%\icons\*.*'

- Processor: EndOfCheckPhase
