Description: Alters latest Microsoft DotNet Core Desktop Runtime Install-file for Windows.
Identifier: com.github.NickETH.recipes.build.SQLServerTools2019-Win64
ParentRecipe: com.github.NickETH.recipes.download.SQLServerTools2019-Win64
MinimumVersion: 1.3.1

Input:
  NAME: SQLServerTools
  MAJOR_VERSION: '2019'
  SEARCH_UPDATE_URL: https://www.microsoft.com/en-us/download/confirmation.aspx?id=100809
  VENDOR: 'Microsoft'
  PLATFORM: x64
  PF_STRING: '_64'
  LANG_STRING: _EN
  DIP_NAME: Endnote
  DIP_SUBDIR: ML

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/WinPEVersionExtractor
  Arguments:
    exe_path: '%pathname%'
    product_version: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: release:read:sourceunzipped
    org_ver: '%version%'
    pkg_dir: '%VENDOR%_%NAME%%PF_STRING%_::VVeerrssiioonn::%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%VENDOR%_%NAME%%PF_STRING%_%version%%LANG_STRING%'
    rename_var: pkg_dir

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: extract the SQLServer setup
  Arguments:
    cmdline_args:
    - /x:%BUILD_DIR%\%pkg_dir%\sourceunzipped\%NAME%
    - /q
    exe_file: '%pathname%'
    exe_folder: '%BUILD_DIR%\%pkg_dir%\sourceunzipped'
    run_elevated: 'true'

# - Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  # Arguments:
    # SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    # msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%%LANG_STRING%.msi'

- Processor: Copier
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%-LocalDB_%PF_STRING%_%version%%LANG_STRING%.MSI'
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\%NAME%\1033_ENU_LP\x64\Setup\x64\SQLLOCALDB.MSI'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%version%%LANG_STRING%.txt'
    new_ver: '%version%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: EndOfCheckPhase
