Description: Downloads the latest version of Microsoft's NET Desktop Runtime.
Identifier: com.github.NickETH.recipes.download.SQLServerTools2019-Win64
MinimumVersion: 1.3.1

Input:
  NAME: SQLServer
  MAJOR_VERSION: '2019'
  
  SEARCH_UPDATE_URL: https://www.microsoft.com/en-us/download/confirmation.aspx?id=100809
  # SEARCH_UPDATE_URL: https://www.microsoft.com/download/details.aspx?id=100809
  VENDOR: 'Microsoft'
  PLATFORM: x64
  PF_STRING: '_64'
  LANG_STRING: _EN
  DIP_NAME: Endnote
  DIP_SUBDIR: ML

Process:
- Processor: URLTextSearcher
  Arguments:
    # https://download.microsoft.com/download/6/e/7/6e72dddf-dfa4-4889-bc3d-e5d3a0fd11ce/SQLServer2019-KB5025808-x64.exe
    re_pattern: https://download.microsoft.com/download[/0-9a-f-]+/SQLServer2019-KB[0-9]+-x64.exe
    url: '%SEARCH_UPDATE_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%MAJOR_VERSION%.exe'
    url: '%match%'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/WinPEVersionExtractor
  Arguments:
    exe_path: '%pathname%'
    product_version: 'True'

- Processor: WindowsSignatureVerifier
  Arguments:
    version: '%parsed_string%'
    expected_subject: CN=Microsoft Corporation, O=Microsoft Corporation, L=Redmond, S=Washington, C=US
    input_path: '%pathname%'
