Description: Imports Teams to BMS
Identifier: com.github.NickETH.recipes.BMS.Teams-Win64
ParentRecipe: com.github.NickETH.recipes.build.Teams-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Teams
  VENDOR: Microsoft
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.homebysix-recipes.FindAndReplace/FindAndReplace
  Arguments:
    input_string: '%build_ver%'
    find: .
    replace: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installbds: '{DIP}\Apl\MS_Teams\Firewall\MS_Teams_FirewallRule.bds'
    bms_app_installcmd: '{DIP}\Apl\MS_Teams\%output_string%\ML\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1 OPTIONS="noAutoStart=true"
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: Teams (per User)
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn /norestart
    bms_app_uopt_rebootbhv: Reboot
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME%'
    inst_file_src_dest: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\release\*.ms?|%BMS_IMPORT_PATH_TST%\MS_Teams\%output_string%\ML'
    read_file_src_dest: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\*-%NAME%%PF_STRING%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\MS_Teams\%output_string%\DEV'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\MS_Teams\bms_app_integration.json'
    bms_app_integration:
    - appname: 'Teams (per User)'
      bundles:
      - action: exchange
        name: nV_Teams (per User)
      currentversion:
        bundle: nV_Teams (per User)
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_installcmd: '{DIP}\Apl\MS_Teams\%output_string%\ML\%NAME%-perComp%PF_STRING%_%build_ver%_ML.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1 DISABLEMSTEAMSAUTORUN=1
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: Teams (per Comp)
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn /norestart
    bms_app_uopt_rebootbhv: NoReboot
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME%'
    read_file_src_dest: '%BUILD_DIR%\%NAME%%PF_STRING%_%build_ver%_ML\read\*-%NAME%%PF_STRING%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\MS_Teams\%output_string%\DEV'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\MS_Teams\bms_app_integration.json'
    bms_app_integration:
    - appname: 'Teams (per Comp)'
      bundles:
      - action: exchange
        name: nV_Teams (per Comp)
      - action: add
        name: aV_Teams (per Comp) Uninstall
        version: new
      - action: add
        name: oV_Teams (per Comp) Uninstall
        version: previous
      currentversion:
        bundle: nV_Teams (per Comp)
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'

- Processor: EndOfCheckPhase
