Description: Downloads the latest Teams installer for Windows.
Identifier: com.github.NickETH.recipes.download.Teams-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Teams
  VENDOR: Microsoft
  USER_AGENT: Mozilla/5.0 (Windows NT 6.3; Win64, x64; Trident/7.0; rv:11.0) like Gecko
  SEARCH_URL: https://Teams-project.org/download.php?show_all=1
  SEARCH_PATTERN: (https.*client/FileZilla_(?P<version>([0-9]+\.)*[0-9]+)_win64-setup.exe.*)"\srel="nofollow"

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.msi'
    request_headers:
      user-agent: '%USER_AGENT%'
    url: https://teams.microsoft.com/downloads/desktopurl?env=production&plat=windows&arch=x64&managedInstaller=true&download=true

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Microsoft Corporation, O=Microsoft Corporation, L=Redmond, S=Washington, C=US
    input_path: '%pathname%'

- Processor: EndOfCheckPhase
