Description: Packages the latest Teams Work or School MSIX-file for Windows.
Identifier: com.github.NickETH.recipes.build.Teams-WoS-Win64
ParentRecipe: com.github.NickETH.recipes.download.Teams-WoS-Win64
MinimumVersion: 1.3.1

Input:
  NAME: 'Teams WoS'
  NAMESHORT: 'Teams2'
  VENDOR: Microsoft
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/SevenZipExtractor
  Comment: Extract the Teams AppxManifest.xml to the download dir
  Arguments:
    exe_path: '%pathname%'
    extract_dir: '%RECIPE_CACHE_DIR%\downloads\'
    extract_file: 'AppxManifest.xml'
    ignore_pattern: ''
    preserve_paths: 'False'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSIXInfoVersioner
  Comment: Get the version from AppxManifest.xml into version
  Arguments:
    appx_manifest_path: '%RECIPE_CACHE_DIR%\downloads\AppxManifest.xml'

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create the build environment
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: helpers:release:read
    org_ver: '%version%'
    pkg_dir: '%NAMESHORT%%PF_STRING%_::VVeerrssiioonn::_ML'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '4'

- Processor: com.github.sebtomasi.SharedProcessors/RenameVar
  Arguments:
    input_var: '%NAMESHORT%%PF_STRING%_%build_ver%_ML'
    rename_var: pkg_dir

- Processor: Copier
  Comment: Save a copy of the downloaded MSI to the release dir.
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\release\%NAMESHORT%%PF_STRING%_%build_ver%_ML.msix'
    overwrite: 'true'
    source_path: '%pathname%'
    
- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-%NAMESHORT%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-%NAMESHORT%%PF_STRING%_%build_ver%_ML.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps

- Processor: EndOfCheckPhase
