Description: Downloads latest Visual Studio Code for Windows x64 systemwide installer
Identifier: com.github.NickETH.recipes.download.VisualStudioCode-Win64
MinimumVersion: 1.3.1

Input:
  NAME: VisualStudioCode
  VENDOR: Microsoft
  DOWNLOAD_URL: https://go.microsoft.com/fwlink/?linkid=852157

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.exe'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=Microsoft Corporation, O=Microsoft Corporation, L=Redmond, S=Washington, C=US
    input_path: '%pathname%'
