Description: Downloads the latest release of Freeplane x64 from Github.
Identifier: com.github.NickETH.recipes.download.Freeplane-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Freeplane
  ASSET_REGEX: 'Freeplane-Setup.*?\.exe'
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: '%ASSET_REGEX%'
    # https://github.com/freeplane/freeplane/releases/download/release-1.13.2/Freeplane-Setup-1.13.2.exe
    github_repo: freeplane/freeplane
    include_prereleases: false

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.exe'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Comment: Generate the final version string.
  Arguments:
    input_string: '%version%'
    pattern_replace:
    - pattern: 'release-'
      repl: ''
      
- Processor: EndOfCheckPhase
  Arguments:
    version: '%parsed_string%'
