Description: Downloads the latest release of KeePassXC from Github.
Identifier: com.github.NickETH.recipes.download.KeePassXC-Win64
MinimumVersion: 1.3.1

Input:
  NAME: KeePassXC
  ASSET_REGEX: KeePassXC-.*-Win64\.msi
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: '%ASSET_REGEX%'
    github_repo: keepassxreboot/keepassxc
    include_prereleases: false

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.msi'

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN="DroidMonkey Apps, LLC", O="DroidMonkey Apps, LLC", S=Virginia, C=US
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: EndOfCheckPhase
