Description: Imports KeePassXC to BMS
Identifier: com.github.NickETH.recipes.BMS.KeePassXC-Win64
ParentRecipe: com.github.NickETH.recipes.build.KeePassXC-Win64
MinimumVersion: 1.3.1

Input:
  NAME: KeePassXC
  VENDOR: KeePassXC team
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: com.github.NickETH.recipes.SharedProcessors/MSIRunSQLget
  Arguments:
    SQL_command: SELECT `Value` FROM `Property` WHERE `Property`='ProductCode'
    msi_path: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi'

- Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
  Arguments:
    input_string: '%build_ver%'
    pattern_replace:
    - pattern: \.
      repl: _

- Processor: com.github.NickETH.recipes.SharedProcessors/BMSImporter
  Comment: Import the Application into Baramundi (BMS)
  Arguments:
    bms_CM_entry: AutoPKG-BMSImporter
    bms_app_category: baramundi Application
    bms_app_comment: 'Imported by: AutoPkg, %us_date% %time%'
    bms_app_conschecks: "CheckAppRC=0,3010\r\nDeinstall.CheckAppRC=0,1605,3010"
    bms_app_dependencies:
    - Visual C++ Redistributable~~~Visual C++ Redistributable-x86
    - Visual C++ Redistributable~~~Visual C++ Redistributable-x64
    bms_app_installcmd: '{DIP}\Apl\%NAME%\%parsed_string%\ML\%NAME%%PF_STRING%_%build_ver%_ML.msi'
    bms_app_installparm: /qn /norestart ALLUSERS=1 LAUNCHAPPONEXIT=0 AUTOSTARTPROGRAM=0
    bms_app_sharepoint:
    - SW-List-Name: '%NAME%'
      versionplatformtag: '%build_ver% ML (%PLATFORM%)'
    bms_app_integration:
    - appname: '%NAME%'
      bundles:
      - action: exchange
        name: 'nV_%NAME%'
                 
           
      - action: add
        name: aV_%NAME% Uninstall
        version: new
      - action: add
        name: oV_%NAME% Uninstall
        version: previous
      currentversion:
        bundle: 'nV_%NAME%'
        search: '[d]+\.[d]+\.[d]+\.[d]+ ML (%PLATFORM%)'
        type: bundles
      platform: (%PLATFORM%)
      subspec: ''
      vendor: '%VENDOR%'
      version: '%build_ver% ML'
      copyfolders: 1
    bms_job_kiosk:
    - jobname: '@_nV_KeePassXC - Update (DYN)'
      substring: 'Taskkill'
      jobdescription: 'Zum lokalen Verwalten von Passwörter. Kann ausserdem als alternative bzw. Backup-Authentisierungsmöglichkeit einer Multifaktor-Authentisierung anstelle eines Mobiltelefons verwendet werden.'
      autoenableapp: 'KeePassXC - Enable AutoUpdate'
      autoreleasejob: '@_AU-Rel_KeePassXC'
    bms_app_iopt_copylocal: 'true'
    bms_app_iopt_rebootbhv: NoReboot
    bms_app_iopt_reinstall: 'false'
    bms_app_iopt_usebbt: true
    bms_app_name: '%NAME%'
    bms_app_parentid: '%BMS_IMPORT_OU_GUID%'
    bms_app_seccont: LocalSystem
    bms_app_uninstcmd: msiexec.exe
    bms_app_uninstparm: /x %msi_value% /qn /norestart
    bms_app_valid4os: '%BMS_OS4X64%,%BMS_OS4SRV%'
    bms_app_vendor: '%VENDOR%'
    bms_app_version: '%build_ver% ML (%PLATFORM%)'
    bms_serverport: '%BMS_SERVER_PORT%'
    bms_serverurl: '%BMS_SERVER1%'
    bms_username: '%BMS_USERNAME%'
    inst_file_src_dest: '%BUILD_DIR%\%pkg_dir%\release\*.ms?|%BMS_IMPORT_PATH_TST%\%NAME%\%parsed_string%\ML'
    json_file_dest: '%BMS_IMPORT_PATH_TST%\%NAME%\bms_app_integration.json'
    read_file_src_dest: '%BUILD_DIR%\%pkg_dir%\read\*-%NAME%%PF_STRING%_%build_ver%_ML.txt|%BMS_IMPORT_PATH_TST%\%NAME%\%parsed_string%\DEV'
    icon_file_src: '%BUILD_DIR%\%pkg_dir%\icons\*.*'
- Processor: EndOfCheckPhase
