Description: Downloads the latest version of Inkscape.
Identifier: com.github.NickETH.recipes.download.Inkscape-Win64
MinimumVersion: 1.3.1

Input:
  NAME: Inkscape
  PLATFORM: x64
  PF_DIGIT: '64'
  SEARCH_URL: https://inkscape.org
  SEARCH_PATTERN1: (/release/(?P<version>[0-9]{1,3}.[0-9]{0,3}.[0-9]{0,3})/windows/)
  SEARCH_PATTERN2: '/gallery/item/[0-9]*?/inkscape-%version%.msi'
  
Process:
- Processor: URLTextSearcher
  Arguments:
    curl_opts:
    - -L
    re_pattern: '%SEARCH_PATTERN1%'
    result_output_var_name: release_page_match
    url: '%SEARCH_URL%/release'

- Processor: URLTextSearcher
  Arguments:
    SEARCH_PATTERN2: '/gallery/item/[0-9]*?/inkscape-%version%.msi'
    re_pattern: '%SEARCH_PATTERN2%'
    result_output_var_name: gallery_download_match
    url: '%SEARCH_URL%/release/inkscape-%version%/windows/%PF_DIGIT%-bit/msi/dl/'

- Processor: URLDownloader
  Arguments:
    curl_opts:
    - -L
    filename: '%NAME%.msi'
    url: '%SEARCH_URL%%gallery_download_match%'


- Processor: EndOfCheckPhase
