Description: Package the current R x64 release to an MSI-package.
Identifier: com.github.NickETH.recipes.build.R-Win64
ParentRecipe: com.github.NickETH.recipes.download.R-Win64
MinimumVersion: 1.3.1

Input:
  NAME: R
  PLATFORM: x64
  PF_STRING: _64
  LANG_STRING: _ML

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False

- Processor: com.github.NickETH.recipes.SharedProcessors/CreateNextBuild
  Comment: Create a build enviroment to build the MSI with Wix
  Arguments:
    BuildFiles: NextVerFiles.txt
    build_dir: '%BUILD_DIR%'
    folder_list: sourcepkt:sourceunzipped:release:read:helpers:wixproject\R:wixproject\Resources
    org_ver: '%version%'
    pkg_dir: '%NAME%%PF_STRING%_%version%%LANG_STRING%'
    recipe_dir: '%RECIPE_DIR%'
    recipe_path: '%RECIPE_PATH%'
    ver_fields: '3'

- Processor: Copier
  Comment: Copy the R install exe file to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%'
    overwrite: 'true'
    source_path: '%RECIPE_CACHE_DIR%\downloads\%filename%'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: run the R setup and install it to C:\APPS
  Arguments:
    cmdline_args:
    - /VERYSILENT
    - /DIR="C:\APPS\R\R-%version%"
    - /COMPONENTS="main,x64,translations"
    - /TASKS="recordversion,associate"
    - /LANG=en
    exe_file: '%BUILD_DIR%\%pkg_dir%\sourcepkt\R.exe'
    exe_folder: '%BUILD_DIR%\%pkg_dir%\sourcepkt'
    run_elevated: 'true'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: run the Rterm and install additional packages
  Arguments:
    cmdline_args:
    - --no-restore
    - --no-save
    - --file=%BUILD_DIR%\%pkg_dir%\helpers\install-r-pkg-STUD_AP_4x.txt
    - --args
    - '>%BUILD_DIR%\%pkg_dir%\helpers\install-r-pkg-STUD_AP_4x.log'
    exe_file: C:\APPS\R\R-%version%\bin\x64\Rterm.exe
    exe_folder: C:\APPS\R\R-%version%
    run_elevated: 'true'

- Processor: Copier
  Comment: Copy the Renviron.site file to the build dir
  Arguments:
    destination_path: C:\APPS\R\R-%version%\etc\Renviron.site
    overwrite: 'true'
    source_path: '%BUILD_DIR%\%pkg_dir%\helpers\Renviron.site'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: Compress the R folder with 7zip to a self extracting archive
  Arguments:
    cmdline_args:
    - a
    - -r
    - -sfx
    - -t7z
    - -v1900m
    - -mx9
    - '%BUILD_DIR%\%pkg_dir%\release\Rfiles.exe'
    - C:\APPS\R\*.*
    exe_file: '%SZIP_PATH%'
    exe_folder: C:\APPS\R

- Processor: Copier
  Comment: Copy the Rgui.exe file to the build dir
  Arguments:
    destination_path: '%BUILD_DIR%\%pkg_dir%\wixproject\R\Rgui.exe'
    overwrite: 'true'
    source_path: C:\APPS\R\R-%version%\bin\x64\Rgui.exe

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\create-log-R%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.NickETH.recipes.SharedProcessors/FileDateVersionSubst
  Arguments:
    file_path: '%BUILD_DIR%\%pkg_dir%\read\readme-R%PF_STRING%_%build_ver%%LANG_STRING%.txt'
    new_ver: '%build_ver%'
    re_pattern: '[0-9]+\.[0-9]+\.[0-9]+'

- Processor: com.github.haircut.processors/AppIconExtractor
  Arguments:
    ICON_PATH: '%BUILD_DIR%\%pkg_dir%\icons'
    icon_file_number: 0
    # composite_padding: 20
    # composite_position: ul
    # composite_uninstall_path: '%RECIPE_CACHE_DIR%/Icon-Uninstall-%NAME%.png'
    # composite_uninstall_template: /Users/haircut/Documents/delete.png
    icon_output_path: '%ICON_PATH%\Icon-%NAME%.png'
    source_app: '%BUILD_DIR%\%pkg_dir%\wixproject\R\Rgui.exe'
    #source_app: '%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%version%%LANG_STRING%.msi'
    #msi_icon_name: 'MainExecutableIcon.ico'
    composite_uninstall_path: '%ICON_PATH%\Icon-Uninstall-%NAME%.png'
    composite_update_path: '%ICON_PATH%\Icon-Update-%NAME%.png'
    composite_install_path: '%ICON_PATH%\Icon-Install-%NAME%.png'

- Processor: com.github.NickETH.recipes.SharedProcessors/ResourceWorker
  Comment: Extract the R res file
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\wixproject\R\Rgui.exe'
    output_file: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Icon-%NAME%.res'
    reswork_action: 'extract'
    reswork_cmd: 'ICONGROUP,,'
    # ignore_errors: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/ResourceWorker
  Comment: Generate a new Icon.exe file for R
  Arguments:
    exe_path: '%BUILD_DIR%\%pkg_dir%\helpers\Icon-Stub-1.exe'
    input_file: '%BUILD_DIR%\%pkg_dir%\sourceunzipped\Icon-%NAME%.res'
    output_file: '%BUILD_DIR%\%pkg_dir%\wixproject\Resources\Main-Icon.exe'
    reswork_action: 'add'
    reswork_cmd: 'ICONGROUP,,'
    # ignore_errors: 'True'

- Processor: com.github.NickETH.recipes.SharedProcessors/WixDefaults
  Comment: Set the actual version strings to the version.wxi file
  Arguments:
    build_dir: '%BUILD_DIR%\%pkg_dir%'
    build_ver: '%build_ver%'
    org_ver: '%build_ver%'

- Processor: com.github.NickETH.recipes.SharedProcessors/MSBuildRun
  Comment: Run the MSBuild script to generate the R MSI installer
  Arguments:
    build_file: '%BUILD_DIR%\%pkg_dir%\wixproject\R.build'
    build_folder: '%BUILD_DIR%\%pkg_dir%\wixproject'
    build_property: BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;AppDir=%BUILD_DIR%\%pkg_dir%\wixproject\R;version=%version%
    build_target: WIX

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: run the R setup and uninstall from C:\APPS
  Arguments:
    cmdline_args:
    - /VERYSILENT
    exe_file: C:\APPS\R\R-%version%\unins000.exe
    exe_folder: '%BUILD_DIR%\%pkg_dir%\sourcepkt'
    run_elevated: 'true'

- Processor: com.github.NickETH.recipes.SharedProcessors/ExecuteFile
  Comment: clean up the R folder from C:\APPS
  Arguments:
    cmdline_args:
    - /c
    - rmdir
    - /S
    - /Q
    - C:\APPS\R
    exe_file: cmd.exe
    exe_folder: C:\APPS
    run_elevated: 'true'

- Processor: com.github.NickETH.recipes.SharedProcessors/DateTimeStamps
