Description: Downloads the latest R installer package for Windows.
Identifier: com.github.NickETH.recipes.download.R-Win64
MinimumVersion: 1.3.1

Input:
  NAME: R

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: (?P<exe>R-(?P<version>([0-9]+\.)*[0-9]+)-win\.exe)
    url: https://cran.r-project.org/bin/windows/base/

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.exe'
    url: https://cloud.r-project.org/bin/windows/base/%match%

- Processor: EndOfCheckPhase
