Description: Download recipe for FileOpen Plugin.
Identifier: com.github.NickETH.recipes.download.FileOpenPlugin-Win64
MinimumVersion: 1.3.1

Input:
  NAME: FileOpenPlugin
  URL: https://plugin.fileopen.com/
  PLATFORM: x64
  PF_STRING: '_64'

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.msi'
    url: https://plugin.fileopen.com/current/FileOpenInstaller64.msi

- Processor: EndOfCheckPhase

- Processor: WindowsSignatureVerifier
  Arguments:
    expected_subject: CN=FileOpen Systems Inc., O=FileOpen Systems Inc., L=Santa Cruz, S=California, C=US, SERIALNUMBER=5070649, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Delaware, OID.1.3.6.1.4.1.311.60.2.1.3=US
    input_path: '%pathname%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False
