Description: Downloads latest NXLog CE x64 Install-file for Windows.
Identifier: com.github.NickETH.recipes.download.NXLog-CE-Win64
MinimumVersion: 1.3.1

Input:
  NAME: NXLog-CE
  VENDOR: NXLog Ltd.
  DOWNLOAD_URL: https://nxlog.co/products/nxlog-community-edition/download
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: (?P<match>https://nxlog.co/system/files/products/files/[\d]+/nxlog-ce-(?P<version>([0-9]+\.)*[0-9]+)\.msi)
    url: '%DOWNLOAD_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%_%PLATFORM%.msi'
    url: '%match%'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False
